#!/bin/sh
# СгенерируйтеCHANGELOG_LAST.mdна основе изменений, произошедших с момента тега последней версии. (теги vx.y.z-dev отключаются)
# CHANGELOG_LAST.md можно при необходимости редактировать вручную и вручную добавлять в документы/CHANGELOG.md.
#
# Требования:
# npm install -g автоматический журнал изменений
#
# Использование:
# журнал изменений-gen <следующая версия>
#
# Пример: если последней версией является v5.6.7, для исправления ошибок, второстепенных или основных версий можно использовать следующее:
# список изменений-gen v5.6.8
# список изменений-gen v5.7.0
# журнал изменений-gen v6.0.0

OUTPUT_NAME=CHANGELOG_LAST.rst
auto-changelog -t changelog-template.hbs -l false --latest-version $1 --unreleased-only --tag-pattern ^v[0-9]+.[0-9]+.[0-9]+$ --merge-url "https://github.com/lvgl/lvgl/pull/{id}" -o $OUTPUT_NAME

# Удалить начальный пробел из имени фиксации PR.
# Например, «- ** PR TITLE» становится «- ** PR TITLE»
sed -i 's/- \*\* */- \*\*/g' $OUTPUT_NAME

# Удалить конечный пробел из имени фиксации PR.
# Например, "- ** PR TITLE **" становится "- ** PR TITLE **"
sed -i 's/ \*\* /\*\* /g' $OUTPUT_NAME
