/**
 * @file lv_gridnav.h
 *
 */

#ifndef LV_GRIDNAV_H
#define LV_GRIDNAV_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../core/lv_obj.h"

#if LV_USE_GRIDNAV

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/
typedef enum {
    LV_GRIDNAV_CTRL_NONE = 0x0,

    /**
     * Если в направлении нет следующего/предыдущего объекта,
     * фокус переходит на объект в следующем/предыдущем ряду (на клавишах влево/вправо)
     * или первая/последняя строка (на клавишах вверх/вниз)
     */
    LV_GRIDNAV_CTRL_ROLLOVER = 0x1,

    /**
     * Если нажата стрелка и объект в фокусе можно прокручивать в этом направлении
     * тогда он будет прокручиваться вместо перехода к следующему/предыдущему объекту.
     * Если места для прокрутки больше нет, следующий/предыдущий объект будет сфокусирован как обычно. */
    LV_GRIDNAV_CTRL_SCROLL_FIRST = 0x2,

    /**
     * Для навигации по сетке используйте только клавиши «влево/вправо». Ключевые события вверх/вниз будут отправлены на
     * сфокусированный объект.
    */
    LV_GRIDNAV_CTRL_HORIZONTAL_MOVE_ONLY = 0x4,

    /**
     * Для навигации по сетке используйте только клавиши вверх/вниз. События левой/правой клавиши будут отправлены на
     * сфокусированный объект.
    */
    LV_GRIDNAV_CTRL_VERTICAL_MOVE_ONLY = 0x8

} lv_gridnav_ctrl_t;

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Добавьте к объекту функцию навигации по сетке. Он ожидает, что дети будут устроены
 * в макет в виде сетки. Хотя идеальное выравнивание пикселей не требуется.
 * Эта функция позволяет использовать клавиши для навигации среди детей и фокусировки на них.
 * Клавиши, кроме стрелок и событий, связанных с нажатием/отпусканием
 * передаются сосредоточенному ребенку.
 * @param obj       указатель на объект, к которому следует применить навигацию.
 * @param ctrl      флаги управления из `lv_gridnav_ctrl_t`.
 */
void lv_gridnav_add(lv_obj_t * obj, lv_gridnav_ctrl_t ctrl);

/**
 * Удаление поддержки навигации по сетке из объекта
 * @param obj       указатель на объект
 */
void lv_gridnav_remove(lv_obj_t * obj);

/**
 * Вручную сфокусируйте объект в контейнере Gridnav.
 * @param cont      указатель на контейнер GridNav
 * @param to_focus  указатель на объект для фокусировки
 * @param anim_en LV_ANIM_ON / OFF
 */
void lv_gridnav_set_focused(lv_obj_t * cont, lv_obj_t * to_focus, lv_anim_enable_t anim_en);

/**********************
 *      MACROS
 **********************/
#endif /*LV_USE_GRIDNAV*/

#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /* LV_GRIDNAV_H */
