/*
 * @file
 *
 **********************************************************************
 *                            DO NOT EDIT
 * Этот файл автоматически создается «style_api_gen.py».
 **********************************************************************
 */


#ifndef LV_STYLE_GEN_H
#define LV_STYLE_GEN_H

#ifdef __cplusplus
extern "C" {
#endif

/**
 * Устанавливает ширину виджета. Можно использовать значения в пикселях, процентах и ​​`LV_SIZE_CONTENT`.
 * Процентные значения относятся к ширине родительской области содержимого.
 * Default: Зависит от виджета, наследуется: Нет, макет: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_width(lv_style_t * style, int32_t value);

/**
 * Устанавливает минимальную ширину. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к ширине области содержимого родительского элемента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_min_width(lv_style_t * style, int32_t value);

/**
 * Устанавливает максимальную ширину. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к ширине области содержимого родительского элемента.
 * Default: LV_COORD_MAX , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_max_width(lv_style_t * style, int32_t value);

/**
 * Устанавливает высоту виджета. Можно использовать пиксель, проценты и `LV_SIZE_CONTENT`.
 * Процентные значения относятся к высоте родительской области содержимого.
 * Default: Зависит от виджета, наследуется: Нет, макет: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_height(lv_style_t * style, int32_t value);

/**
 * Устанавливает минимальную высоту. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к высоте области содержимого родительского элемента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_min_height(lv_style_t * style, int32_t value);

/**
 * Устанавливает максимальную высоту. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к высоте области содержимого родительского элемента.
 * Default: LV_COORD_MAX , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_max_height(lv_style_t * style, int32_t value);

/**
 * Его значение зависит от типа виджета. Например, в случаеlv_scaleэто означает
 * длина тиков.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_length(lv_style_t * style, int32_t value);

/**
 * Установите координату X виджета с учетом настроек``align``. Пиксель и процент
 * можно использовать значения. Процентные значения относятся к ширине родительского элемента.
 * область контента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_x(lv_style_t * style, int32_t value);

/**
 * Установите координату Y виджета с учетом настроек``align``. Пиксель и процент
 * можно использовать значения. Процентные значения относятся к высоте родительского элемента.
 * область контента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_y(lv_style_t * style, int32_t value);

/**
 * Установите выравнивание, которое указывает, из какой точки родительского элемента расположены X и Y.
 * координаты должны быть интерпретированы. Возможные значения: `LV_ALIGN_DEFAULT` ,
 * `LV_ALIGN_TOP_LEFT/MID/RIGHT`, `LV_ALIGN_BOTTOM_LEFT/MID/RIGHT`,
 * `LV_ALIGN_LEFT/RIGHT_MID` , `LV_ALIGN_CENTER` .  `LV_ALIGN_DEFAULT` означает
 * `LV_ALIGN_TOP_LEFT` с направлением основания LTR и `LV_ALIGN_TOP_RIGHT` с основанием RTL
 * направление.
 * Default: `LV_ALIGN_DEFAULT` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_align(lv_style_t * style, lv_align_t value);

/**
 * С помощью этого значения сделайте виджет шире с обеих сторон. Пиксель и процент (с
 * `lv_pct(x)` ) можно использовать значения. Процентные значения относятся к расширению виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_width(lv_style_t * style, int32_t value);

/**
 * Сделайте виджет выше с обеих сторон с этим значением. Пиксель и процент (с
 * `lv_pct(x)` ) можно использовать значения. Процентные значения относятся к высоте виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_height(lv_style_t * style, int32_t value);

/**
 * Переместите виджет с этим значением в направлении X. Применяется после макетов, выравниваний и других
 * позиционирование. Можно использовать значения в пикселях и процентах (с `lv_pct(x)`). Процент
 * значения относятся к ширине виджета.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_translate_x(lv_style_t * style, int32_t value);

/**
 * Переместите виджет с этим значением в направлении Y. Применяется после макетов, выравниваний и других
 * позиционирование. Можно использовать значения в пикселях и процентах (с `lv_pct(x)`). Процент
 * значения относятся к высоте виджета.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_translate_y(lv_style_t * style, int32_t value);

/**
 * Переместите объект вокруг центра родительского объекта (например, по окружности).
 * масштаба).
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_translate_radial(lv_style_t * style, int32_t value);

/**
 * Масштабировать виджет по горизонтали. Значение 256 (или `LV_SCALE_NONE` ) означает нормальный размер, 128.
 * половинный размер, 512 двойной размер и так далее.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_scale_x(lv_style_t * style, int32_t value);

/**
 * Масштабировать виджет по вертикали. Значение 256 (или `LV_SCALE_NONE`) означает нормальный размер, 128.
 * половинный размер, 512 двойной размер и так далее.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_scale_y(lv_style_t * style, int32_t value);

/**
 * Поворот виджета. Значение интерпретируется в единицах 0,1 градуса. Например. 450 означает 45 градусов.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_rotation(lv_style_t * style, int32_t value);

/**
 * Установите координату X точки поворота для преобразований. Относительно верхнего левого угла виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_pivot_x(lv_style_t * style, int32_t value);

/**
 * Установите координату Y точки поворота для преобразований. Относительно верхнего левого угла виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_pivot_y(lv_style_t * style, int32_t value);

/**
 * Наклон виджета по горизонтали. Значение интерпретируется в единицах 0,1 градуса. Например. 450
 * значит 45 град.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_skew_x(lv_style_t * style, int32_t value);

/**
 * Наклон виджета по вертикали. Значение интерпретируется в единицах 0,1 градуса. Например. 450
 * значит 45 град.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_transform_skew_y(lv_style_t * style, int32_t value);

/**
 * Устанавливает отступ сверху. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_top(lv_style_t * style, int32_t value);

/**
 * Устанавливает отступ внизу. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_bottom(lv_style_t * style, int32_t value);

/**
 * Устанавливает отступ слева. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_left(lv_style_t * style, int32_t value);

/**
 * Устанавливает отступ справа. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_right(lv_style_t * style, int32_t value);

/**
 * Устанавливает отступы между строками. Используется макетами.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_row(lv_style_t * style, int32_t value);

/**
 * Устанавливает отступы между столбцами. Используется макетами.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_column(lv_style_t * style, int32_t value);

/**
 * Отложите текстовые метки от делений шкалы/остатка `` LV_PART_ `` .
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_pad_radial(lv_style_t * style, int32_t value);

/**
 * Устанавливает поле сверху. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_margin_top(lv_style_t * style, int32_t value);

/**
 * Устанавливает поле внизу. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_margin_bottom(lv_style_t * style, int32_t value);

/**
 * Устанавливает поле слева. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_margin_left(lv_style_t * style, int32_t value);

/**
 * Устанавливает поле справа. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_margin_right(lv_style_t * style, int32_t value);

/**
 * Установите цвет фона виджета.
 * Default: `0xffffff` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_bg_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность фона. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите градиентный цветной фон. Используется только в том случае, если`grad_dir`не`LV_GRAD_DIR_NONE`.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_bg_grad_color(lv_style_t * style, lv_color_t value);

/**
 * Установите направление градиента фона. Возможные значения:
 * `LV_GRAD_DIR_NONE/HOR/VER`.
 * Default: `LV_GRAD_DIR_NONE` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_grad_dir(lv_style_t * style, lv_grad_dir_t value);

/**
 * Установите точку, с которой должен начинаться цвет фона для градиентов. 0 означает
 * верхняя/левая сторона, 255 нижняя/правая сторона, 128 центр и так далее.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_main_stop(lv_style_t * style, int32_t value);

/**
 * Установите точку, с которой должен начинаться градиент цвета фона. 0 означает вверх/влево
 * сторона, 255 нижняя/правая сторона, 128 центр и так далее.
 * Default: 255, по наследству: Нет, планировка: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_grad_stop(lv_style_t * style, int32_t value);

/**
 * Установите непрозрачность первого цвета градиента.
 * Default: 255, по наследству: Нет, планировка: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_main_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите непрозрачность второго цвета градиента.
 * Default: 255, по наследству: Нет, планировка: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_grad_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите определение градиента. Указанный экземпляр должен существовать, пока жив виджет.
 * NULL для отключения. Он обертывает `BG_GRAD_COLOR` , `BG_GRAD_DIR` , `BG_MAIN_STOP` и
 * `BG_GRAD_STOP` в один дескриптор и позволяет создавать градиенты с большим количеством цветов.
 * также. Если он установлен, другие свойства, связанные с градиентом, будут игнорироваться.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на дескриптор градиента
 */
void lv_style_set_bg_grad(lv_style_t * style, const lv_grad_dsc_t * value);

/**
 * Установите фоновое изображение. Может быть указателем на`lv_image_dsc_t`, направляясь к файлу или
 * an `LV_SYMBOL_...`.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на источник изображения
 */
void lv_style_set_bg_image_src(lv_style_t * style, const void * value);

/**
 * Установите непрозрачность фонового изображения. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает
 * полностью прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное закрытие, другое
 * значения или LV_OPA_10 , LV_OPA_20 и т. д. означают полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_image_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите цвет, который будет смешиваться с фоновым изображением.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_bg_image_recolor(lv_style_t * style, lv_color_t value);

/**
 * Установите интенсивность перекраски фонового изображения. Значение 0, `LV_OPA_0` или
 * `LV_OPA_TRANSP` означает отсутствие смешивания, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное
 * перекрашивание, интерпретируются другие значения или LV_OPA_10 , LV_OPA_20 и т.д.
 * пропорционально.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_image_recolor_opa(lv_style_t * style, lv_opa_t value);

/**
 * Если этот параметр включен, фоновое изображение будет расположено на видеоплите. Возможные значения:`true`или`false`.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_bg_image_tiled(lv_style_t * style, bool value);

/**
 * Установите цвет границы.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_border_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность границы. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_border_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите ширину границы. Можно использовать только значения пикселей.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_border_width(lv_style_t * style, int32_t value);

/**
 * Установите только, с какой стороны(-ов) должна быть нарисована граница. Возможные значения:
 * `LV_BORDER_SIDE_NONE/TOP/BOTTOM/LEFT/RIGHT/INTERNAL` .  Значения OR можно использовать как
 * ну, например  `LV_BORDER_SIDE_TOP | LV_BORDER_SIDE_LEFT` .
 * Default: `LV_BORDER_SIDE_FULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_border_side(lv_style_t * style, lv_border_side_t value);

/**
 * Устанавливает, должна ли граница рисоваться до или после рисования дочерних элементов.
 * `true` : после дочерних элементов,`false`: перед дочерними элементами.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_border_post(lv_style_t * style, bool value);

/**
 * Установите ширину контура в пикселях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_outline_width(lv_style_t * style, int32_t value);

/**
 * Установите цвет контура.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_outline_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность контура. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_outline_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите отступы контура, то есть зазор между виджетом и контуром.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_outline_pad(lv_style_t * style, int32_t value);

/**
 * Установите ширину тени в пикселях. Значение должно быть >= 0.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_shadow_width(lv_style_t * style, int32_t value);

/**
 * Установите смещение тени в пикселях по оси X.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_shadow_offset_x(lv_style_t * style, int32_t value);

/**
 * Установите смещение тени в пикселях по направлению Y.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_shadow_offset_y(lv_style_t * style, int32_t value);

/**
 * Выполните расчет тени, чтобы использовать в качестве основы прямоугольник большего или меньшего размера. Значение может
 * быть в пикселях, чтобы сделать область больше/меньше.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_shadow_spread(lv_style_t * style, int32_t value);

/**
 * Установите цвет тени.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_shadow_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность тени. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_shadow_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите непрозрачность изображения. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_image_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите цвет, который будет смешиваться с изображением.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_image_recolor(lv_style_t * style, lv_color_t value);

/**
 * Установите интенсивность смешивания цветов. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_image_recolor_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите определение цвета клавишей изображения. lv_image_colorkey_tсодержит два значения цвета:
 * `high_color` и`low_color`. цвет изображения от`low_color`до
 * `high_color` будет прозрачнее.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на ключ цвета изображения
 */
void lv_style_set_image_colorkey(lv_style_t * style, const lv_image_colorkey_t * value);

/**
 * Установите ширину линий в пикселях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_line_width(lv_style_t * style, int32_t value);

/**
 * Установите ширину штрихов в пикселях. Обратите внимание, что тире работает только на горизонтальных и вертикальных линиях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_line_dash_width(lv_style_t * style, int32_t value);

/**
 * Установите промежуток между черточками в пикселях. Обратите внимание, что тире работает только на горизонтальном и
 * вертикальные линии.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_line_dash_gap(lv_style_t * style, int32_t value);

/**
 * Конечные точки линий делаются закругленными.  `true`: закругленный,`false`: опорное окончание линии.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_line_rounded(lv_style_t * style, bool value);

/**
 * Установить цвет линий.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_line_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность линий.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_line_opa(lv_style_t * style, lv_opa_t value);

/**
 * Задайте ширину (толщину) дуг в пикселях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_arc_width(lv_style_t * style, int32_t value);

/**
 * Конечные точки сделайте закругленными.  `true`: закругленный,`false`: опорное окончание линии.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_arc_rounded(lv_style_t * style, bool value);

/**
 * Установить цвет дуги.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_arc_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность дуг.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_arc_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите изображение, из которого будет замаскирована дуга. Полезно отображать сложные
 * воздействие на дуги. Может быть указателем на`lv_image_dsc_t`или по пути к файлу.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на источник изображения
 */
void lv_style_set_arc_image_src(lv_style_t * style, const void * value);

/**
 * Устанавливает цвет текста.
 * Default: `0x000000` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_text_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность текста. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите шрифт текста (указатель`lv_font_t *`).
 * Default: `LV_FONT_DEFAULT` , по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на шрифт
 */
void lv_style_set_text_font(lv_style_t * style, const lv_font_t * value);

/**
 * Установите расстояние между буквами в пикселях.
 * Default: 0, по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_letter_space(lv_style_t * style, int32_t value);

/**
 * Установите межстрочный интервал в пикселях.
 * Default: 0, по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_line_space(lv_style_t * style, int32_t value);

/**
 * Установите оформление текста. Возможные значения:
 * `LV_TEXT_DECOR_NONE/UNDERLINE/STRIKETHROUGH` .  Также можно использовать значения OR.
 * Default: `LV_TEXT_DECOR_NONE` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_decor(lv_style_t * style, lv_text_decor_t value);

/**
 * Установите способ выравнивания строк текста. Обратите внимание, что это не выравнивает виджет
 * сам по себе, только строки внутри виджета. Возможные значения:
 * `LV_TEXT_ALIGN_LEFT/CENTER/RIGHT/AUTO` .  `LV_TEXT_ALIGN_AUTO` обнаружить текстовую базу
 * направлении и использует выравнивание по левому или правому краю соответственно.
 * Default: `LV_TEXT_ALIGN_AUTO` , по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_align(lv_style_t * style, lv_text_align_t value);

/**
 * Устанавливает цвет обводки контура буквы.
 * Default: `0x000000` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_text_outline_stroke_color(lv_style_t * style, lv_color_t value);

/**
 * Установите ширину обводки контура буквы в пикселях.
 * Default: 0, по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_outline_stroke_width(lv_style_t * style, int32_t value);

/**
 * Установите непрозрачность контура буквы. Значение 0, `LV_OPA_0` или
 * `LV_OPA_TRANSP` означает полностью прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает
 * полное покрытие, другие значения или LV_OPA_10 , LV_OPA_20 и т. д. означают полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_text_outline_stroke_opa(lv_style_t * style, lv_opa_t value);

/**
 * Конфигуратор включает размытие. Применяется к каждомуlv_partотдельно перед
 * дети оказываются.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_blur_radius(lv_style_t * style, int32_t value);

/**
 * Если`true`фон виджета будет размыт. Деталь должна иметь < 100 %
 * непрозрачность, чтобы сделать его видимым. Если `false`, работоспособная часть будет размыта при
 * рендерится, но до рисования детей.
 * Default: `false` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_blur_backdrop(lv_style_t * style, bool value);

/**
 * При установке `LV_BLUR_QUALITY_SPEED` алгоритм размытия будет отдавать предпочтение скорости.
 * качество.  `LV_BLUR_QUALITY_PRECISION` заставит использовать более высокое качество, но медленнее.
 * размытие. При использовании `LV_BLUR_QUALITY_AUTO` качество будет выбрано автоматически.
 * Default: `LV_BLUR_QUALITY_AUTO` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_blur_quality(lv_style_t * style, lv_blur_quality_t value);

/**
 * Конфигуратор включает размытие. Применяется к каждомуlv_partотдельно перед
 * дети оказываются.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_drop_shadow_radius(lv_style_t * style, int32_t value);

/**
 * Установите смещение тени в пикселях по оси X.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_drop_shadow_offset_x(lv_style_t * style, int32_t value);

/**
 * Установите смещение тени в пикселях по направлению Y.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_drop_shadow_offset_y(lv_style_t * style, int32_t value);

/**
 * Установите цвет тени.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_drop_shadow_color(lv_style_t * style, lv_color_t value);

/**
 * Установите непрозрачность тени.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_drop_shadow_opa(lv_style_t * style, lv_opa_t value);

/**
 * При установке `LV_BLUR_QUALITY_SPEED` алгоритм размытия будет отдавать предпочтение скорости.
 * качество.  `LV_BLUR_QUALITY_PRECISION` заставит использовать более высокое качество, но медленнее.
 * размытие. При использовании `LV_BLUR_QUALITY_AUTO` качество будет выбрано автоматически.
 * Default: `LV_BLUR_QUALITY_PRECISION` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_drop_shadow_quality(lv_style_t * style, lv_blur_quality_t value);

/**
 * Установите радиус на каждом углу. Значение интерпретируется в пикселях (>= 0) или
 * `LV_RADIUS_CIRCLE` для максимального радиуса.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_radius(lv_style_t * style, int32_t value);

/**
 * Переместите начальную точку объекта (например, отметку масштаба) радиально.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_radial_offset(lv_style_t * style, int32_t value);

/**
 * Включите обрезку содержимого, выходящего за закругленные углы родительского виджета. Может быть
 * `true` или`false`.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_clip_corner(lv_style_t * style, bool value);

/**
 * Уменьшите все значения непрозрачности виджета на этот коэффициент. Значение 0, `LV_OPA_0` или
 * `LV_OPA_TRANSP` означает полностью прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает
 * полное покрытие, другие значения или LV_OPA_10 , LV_OPA_20 и т. д. означают полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_opa(lv_style_t * style, lv_opa_t value);

/**
 * Сначала нарисуйте виджет на слое, затем уменьшите коэффициент непрозрачности слоя. Значение 0,
 * `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью прозрачный, 255, `LV_OPA_100` или
 * `LV_OPA_COVER` означает полное покрытие, другие значения или LV_OPA_10 , LV_OPA_20 и т. д.
 * означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_opa_layered(lv_style_t * style, lv_opa_t value);

/**
 * Смешайте цвет со всеми цветами виджета.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на дескриптор цветового фильтра
 */
void lv_style_set_color_filter_dsc(lv_style_t * style, const lv_color_filter_dsc_t * value);

/**
 * Интенсивность смешивания цветового фильтра.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_color_filter_opa(lv_style_t * style, lv_opa_t value);

/**
 * Установите цвет для смешивания с объектом.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Цвет для отправки
 */
void lv_style_set_recolor(lv_style_t * style, lv_color_t value);

/**
 * Устанавливает интенсивность смешивания цветов. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает
 * полностью прозрачный. Значение 255, `LV_OPA_100` или `LV_OPA_COVER` означает полностью
 * непрозрачный. Промежуточные значения, такие как LV_OPA_10 , LV_OPA_20 и т. д., приводят к
 * полупрозрачность.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_recolor_opa(lv_style_t * style, lv_opa_t value);

/**
 * Шаблон анимации для анимированного виджета. Должен быть указателем на `lv_anim_t`.
 * параметры анимации зависят от виджета, например. время анимации может быть, например,
 * время мигания курсора в текстовой области или время прокрутки ролика. См. Виджеты
 * документацию, чтобы узнать больше.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на дескриптор анимации
 */
void lv_style_set_anim(lv_style_t * style, const lv_anim_t * value);

/**
 * Продолжительность анимации в миллисекундах. Его значение зависит от виджета. Например. время мигания
 * курсора в текстовой области или время прокрутки ролика. См. Виджеты
 * документацию, чтобы узнать больше.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_anim_duration(lv_style_t * style, uint32_t value);

/**
 * Инициализированный``lv_style_transition_dsc_t``для описания перехода.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на дескриптор перехода
 */
void lv_style_set_transition(lv_style_t * style, const lv_style_transition_dsc_t * value);

/**
 * Описывает, как смешать цвета с фоном. Возможные значения:
 * `LV_BLEND_MODE_NORMAL/ADDITIVE/SUBTRACTIVE/MULTIPLY/DIFFERENCE`.
 * Default: `LV_BLEND_MODE_NORMAL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_blend_mode(lv_style_t * style, lv_blend_mode_t value);

/**
 * Установите макет виджета. Дочерние элементы будут перемещены и изменены в соответствии с
 * политики, установленные для макета. Возможные значения см. в документации макетов.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_layout(lv_style_t * style, uint16_t value);

/**
 * Установите базовое направление виджета. Возможные значения: `LV_BIDI_DIR_LTR/RTL/AUTO` .
 * Default: `LV_BASE_DIR_AUTO` , по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_base_dir(lv_style_t * style, lv_base_dir_t value);

/**
 * Если установлено, для виджета будет создан слой, который будет замаскирован
 * это растровая маска A8.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на растровую маску A8
 */
void lv_style_set_bitmap_mask_src(lv_style_t * style, const void * value);

/**
 * Отрегулируйте чувствительность поворотных энкодеров с точностью до 1/256. Это значит, 128: замедлить
 * поворотный до половины, 512: скорость увеличивается вдвое, 256: без изменений.
 * Default: `256` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_rotary_sensitivity(lv_style_t * style, uint32_t value);

#if LV_USE_FLEX
/**
 * Определяет, в каком направлении гибкий макет должен располагать дочерние элементы.
 * Default: `LV_FLEX_FLOW_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_flex_flow(lv_style_t * style, lv_flex_flow_t value);

/**
 * Определяет, как выровнять дочерние элементы в направлении гибкого потока.
 * Default: `LV_FLEX_ALIGN_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_flex_main_place(lv_style_t * style, lv_flex_align_t value);

/**
 * Определяет, как выровнять дочерние элементы перпендикулярно направлению гибкого потока.
 * Default: `LV_FLEX_ALIGN_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_flex_cross_place(lv_style_t * style, lv_flex_align_t value);

/**
 * Определяет способ выравнивания дорожек потока.
 * Default: `LV_FLEX_ALIGN_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_flex_track_place(lv_style_t * style, lv_flex_align_t value);

/**
 * Определяет, сколько места пропорционально занять из свободного места на дорожке виджета.
 * Default: `0` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_flex_grow(lv_style_t * style, uint8_t value);

#endif /* LV_USE_FLEX */

#if LV_USE_GRID
/**
 * Массив для описания столбцов сетки. Должен быть прекращен LV_GRID_TEMPLATE_LAST.
 * Default: `NULL` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на массив дескрипторов столбцов сетки
 */
void lv_style_set_grid_column_dsc_array(lv_style_t * style, const int32_t * value);

/**
 * Определяет способ распределения столбцов.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_column_align(lv_style_t * style, lv_grid_align_t value);

/**
 * Массив для описания строк сетки. Должен быть прекращен LV_GRID_TEMPLATE_LAST.
 * Default: `NULL` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Указатель на массив дескрипторов строк сетки
 */
void lv_style_set_grid_row_dsc_array(lv_style_t * style, const int32_t * value);

/**
 * Определяет способ распределения строк.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_row_align(lv_style_t * style, lv_grid_align_t value);

/**
 * Установите столбец, в котором должен быть размещен виджет.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_cell_column_pos(lv_style_t * style, int32_t value);

/**
 * Установите способ выравнивания виджета по горизонтали.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_cell_x_align(lv_style_t * style, lv_grid_align_t value);

/**
 * Установите, сколько столбцов должен охватывать виджет. Должно быть >= 1.
 * Default: 1, по наследству: Нет, раскладка: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_cell_column_span(lv_style_t * style, int32_t value);

/**
 * Установите строку, в которой должен быть размещен виджет.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_cell_row_pos(lv_style_t * style, int32_t value);

/**
 * Установите способ выравнивания виджета по вертикали.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_cell_y_align(lv_style_t * style, lv_grid_align_t value);

/**
 * Установите, сколько строк должен занимать виджет. Должно быть >= 1.
 * Default: 1, по наследству: Нет, раскладка: Да, доб. рисовать: Нет.
 * @param  style   Указатель на стиль
 * @param  value   Значение для отправки
 */
void lv_style_set_grid_cell_row_span(lv_style_t * style, int32_t value);

#endif /* LV_USE_GRID */

/**
 * Устанавливает ширину виджета. Можно использовать значения в пикселях, процентах и ​​`LV_SIZE_CONTENT`.
 * Процентные значения относятся к ширине родительской области содержимого.
 * Default: Зависит от виджета, наследуется: Нет, макет: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_WIDTH(val) \
    { \
        .prop = LV_STYLE_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает минимальную ширину. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к ширине области содержимого родительского элемента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MIN_WIDTH(val) \
    { \
        .prop = LV_STYLE_MIN_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает максимальную ширину. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к ширине области содержимого родительского элемента.
 * Default: LV_COORD_MAX , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MAX_WIDTH(val) \
    { \
        .prop = LV_STYLE_MAX_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает высоту виджета. Можно использовать пиксель, проценты и `LV_SIZE_CONTENT`.
 * Процентные значения относятся к высоте родительской области содержимого.
 * Default: Зависит от виджета, наследуется: Нет, макет: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_HEIGHT(val) \
    { \
        .prop = LV_STYLE_HEIGHT, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает минимальную высоту. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к высоте области содержимого родительского элемента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MIN_HEIGHT(val) \
    { \
        .prop = LV_STYLE_MIN_HEIGHT, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает максимальную высоту. Можно использовать пиксельные и процентные значения. Процентные значения
 * относятся к высоте области содержимого родительского элемента.
 * Default: LV_COORD_MAX , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MAX_HEIGHT(val) \
    { \
        .prop = LV_STYLE_MAX_HEIGHT, .value = { .num = (int32_t)val } \
    }

/**
 * Его значение зависит от типа виджета. Например, в случаеlv_scaleэто означает
 * длина тиков.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LENGTH(val) \
    { \
        .prop = LV_STYLE_LENGTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите координату X виджета с учетом настроек``align``. Пиксель и процент
 * можно использовать значения. Процентные значения относятся к ширине родительского элемента.
 * область контента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_X(val) \
    { \
        .prop = LV_STYLE_X, .value = { .num = (int32_t)val } \
    }

/**
 * Установите координату Y виджета с учетом настроек``align``. Пиксель и процент
 * можно использовать значения. Процентные значения относятся к высоте родительского элемента.
 * область контента.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_Y(val) \
    { \
        .prop = LV_STYLE_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Установите выравнивание, которое указывает, из какой точки родительского элемента расположены X и Y.
 * координаты должны быть интерпретированы. Возможные значения: `LV_ALIGN_DEFAULT` ,
 * `LV_ALIGN_TOP_LEFT/MID/RIGHT`, `LV_ALIGN_BOTTOM_LEFT/MID/RIGHT`,
 * `LV_ALIGN_LEFT/RIGHT_MID` , `LV_ALIGN_CENTER` .  `LV_ALIGN_DEFAULT` означает
 * `LV_ALIGN_TOP_LEFT` с направлением основания LTR и `LV_ALIGN_TOP_RIGHT` с основанием RTL
 * направление.
 * Default: `LV_ALIGN_DEFAULT` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_ALIGN(val) \
    { \
        .prop = LV_STYLE_ALIGN, .value = { .num = (int32_t)val } \
    }

/**
 * С помощью этого значения сделайте виджет шире с обеих сторон. Пиксель и процент (с
 * `lv_pct(x)` ) можно использовать значения. Процентные значения относятся к расширению виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_WIDTH(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Сделайте виджет выше с обеих сторон с этим значением. Пиксель и процент (с
 * `lv_pct(x)` ) можно использовать значения. Процентные значения относятся к высоте виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_HEIGHT(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_HEIGHT, .value = { .num = (int32_t)val } \
    }

/**
 * Переместите виджет с этим значением в направлении X. Применяется после макетов, выравниваний и других
 * позиционирование. Можно использовать значения в пикселях и процентах (с `lv_pct(x)`). Процент
 * значения относятся к ширине виджета.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSLATE_X(val) \
    { \
        .prop = LV_STYLE_TRANSLATE_X, .value = { .num = (int32_t)val } \
    }

/**
 * Переместите виджет с этим значением в направлении Y. Применяется после макетов, выравниваний и других
 * позиционирование. Можно использовать значения в пикселях и процентах (с `lv_pct(x)`). Процент
 * значения относятся к высоте виджета.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSLATE_Y(val) \
    { \
        .prop = LV_STYLE_TRANSLATE_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Переместите объект вокруг центра родительского объекта (например, по окружности).
 * масштаба).
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSLATE_RADIAL(val) \
    { \
        .prop = LV_STYLE_TRANSLATE_RADIAL, .value = { .num = (int32_t)val } \
    }

/**
 * Масштабировать виджет по горизонтали. Значение 256 (или `LV_SCALE_NONE` ) означает нормальный размер, 128.
 * половинный размер, 512 двойной размер и так далее.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_SCALE_X(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_SCALE_X, .value = { .num = (int32_t)val } \
    }

/**
 * Масштабировать виджет по вертикали. Значение 256 (или `LV_SCALE_NONE`) означает нормальный размер, 128.
 * половинный размер, 512 двойной размер и так далее.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_SCALE_Y(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_SCALE_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Поворот виджета. Значение интерпретируется в единицах 0,1 градуса. Например. 450 означает 45 градусов.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_ROTATION(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_ROTATION, .value = { .num = (int32_t)val } \
    }

/**
 * Установите координату X точки поворота для преобразований. Относительно верхнего левого угла виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_PIVOT_X(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_PIVOT_X, .value = { .num = (int32_t)val } \
    }

/**
 * Установите координату Y точки поворота для преобразований. Относительно верхнего левого угла виджета.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_PIVOT_Y(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_PIVOT_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Наклон виджета по горизонтали. Значение интерпретируется в единицах 0,1 градуса. Например. 450
 * значит 45 град.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_SKEW_X(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_SKEW_X, .value = { .num = (int32_t)val } \
    }

/**
 * Наклон виджета по вертикали. Значение интерпретируется в единицах 0,1 градуса. Например. 450
 * значит 45 град.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TRANSFORM_SKEW_Y(val) \
    { \
        .prop = LV_STYLE_TRANSFORM_SKEW_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает отступ сверху. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_TOP(val) \
    { \
        .prop = LV_STYLE_PAD_TOP, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает отступ внизу. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_BOTTOM(val) \
    { \
        .prop = LV_STYLE_PAD_BOTTOM, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает отступ слева. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_LEFT(val) \
    { \
        .prop = LV_STYLE_PAD_LEFT, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает отступ справа. Это уменьшает область контента в этом направлении.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_RIGHT(val) \
    { \
        .prop = LV_STYLE_PAD_RIGHT, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает отступы между строками. Используется макетами.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_ROW(val) \
    { \
        .prop = LV_STYLE_PAD_ROW, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает отступы между столбцами. Используется макетами.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_COLUMN(val) \
    { \
        .prop = LV_STYLE_PAD_COLUMN, .value = { .num = (int32_t)val } \
    }

/**
 * Отложите текстовые метки от делений шкалы/остатка `` LV_PART_ `` .
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_PAD_RADIAL(val) \
    { \
        .prop = LV_STYLE_PAD_RADIAL, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает поле сверху. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MARGIN_TOP(val) \
    { \
        .prop = LV_STYLE_MARGIN_TOP, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает поле внизу. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MARGIN_BOTTOM(val) \
    { \
        .prop = LV_STYLE_MARGIN_BOTTOM, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает поле слева. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MARGIN_LEFT(val) \
    { \
        .prop = LV_STYLE_MARGIN_LEFT, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает поле справа. Виджет сохранит это пространство от своих собратьев в макетах.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_MARGIN_RIGHT(val) \
    { \
        .prop = LV_STYLE_MARGIN_RIGHT, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет фона виджета.
 * Default: `0xffffff` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_BG_COLOR(val) \
    { \
        .prop = LV_STYLE_BG_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность фона. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_OPA(val) \
    { \
        .prop = LV_STYLE_BG_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите градиентный цветной фон. Используется только в том случае, если`grad_dir`не`LV_GRAD_DIR_NONE`.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_BG_GRAD_COLOR(val) \
    { \
        .prop = LV_STYLE_BG_GRAD_COLOR, .value = { .color = val } \
    }

/**
 * Установите направление градиента фона. Возможные значения:
 * `LV_GRAD_DIR_NONE/HOR/VER`.
 * Default: `LV_GRAD_DIR_NONE` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_GRAD_DIR(val) \
    { \
        .prop = LV_STYLE_BG_GRAD_DIR, .value = { .num = (int32_t)val } \
    }

/**
 * Установите точку, с которой должен начинаться цвет фона для градиентов. 0 означает
 * верхняя/левая сторона, 255 нижняя/правая сторона, 128 центр и так далее.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_MAIN_STOP(val) \
    { \
        .prop = LV_STYLE_BG_MAIN_STOP, .value = { .num = (int32_t)val } \
    }

/**
 * Установите точку, с которой должен начинаться градиент цвета фона. 0 означает вверх/влево
 * сторона, 255 нижняя/правая сторона, 128 центр и так далее.
 * Default: 255, по наследству: Нет, планировка: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_GRAD_STOP(val) \
    { \
        .prop = LV_STYLE_BG_GRAD_STOP, .value = { .num = (int32_t)val } \
    }

/**
 * Установите непрозрачность первого цвета градиента.
 * Default: 255, по наследству: Нет, планировка: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_MAIN_OPA(val) \
    { \
        .prop = LV_STYLE_BG_MAIN_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите непрозрачность второго цвета градиента.
 * Default: 255, по наследству: Нет, планировка: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_GRAD_OPA(val) \
    { \
        .prop = LV_STYLE_BG_GRAD_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите определение градиента. Указанный экземпляр должен существовать, пока жив виджет.
 * NULL для отключения. Он обертывает `BG_GRAD_COLOR` , `BG_GRAD_DIR` , `BG_MAIN_STOP` и
 * `BG_GRAD_STOP` в один дескриптор и позволяет создавать градиенты с большим количеством цветов.
 * также. Если он установлен, другие свойства, связанные с градиентом, будут игнорироваться.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на дескриптор градиента
 */
#define LV_STYLE_CONST_BG_GRAD(val) \
    { \
        .prop = LV_STYLE_BG_GRAD, .value = { .ptr = val } \
    }

/**
 * Установите фоновое изображение. Может быть указателем на`lv_image_dsc_t`, направляясь к файлу или
 * an `LV_SYMBOL_...`.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  val   Указатель на источник изображения
 */
#define LV_STYLE_CONST_BG_IMAGE_SRC(val) \
    { \
        .prop = LV_STYLE_BG_IMAGE_SRC, .value = { .ptr = val } \
    }

/**
 * Установите непрозрачность фонового изображения. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает
 * полностью прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное закрытие, другое
 * значения или LV_OPA_10 , LV_OPA_20 и т. д. означают полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_IMAGE_OPA(val) \
    { \
        .prop = LV_STYLE_BG_IMAGE_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет, который будет смешиваться с фоновым изображением.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_BG_IMAGE_RECOLOR(val) \
    { \
        .prop = LV_STYLE_BG_IMAGE_RECOLOR, .value = { .color = val } \
    }

/**
 * Установите интенсивность перекраски фонового изображения. Значение 0, `LV_OPA_0` или
 * `LV_OPA_TRANSP` означает отсутствие смешивания, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное
 * перекрашивание, интерпретируются другие значения или LV_OPA_10 , LV_OPA_20 и т.д.
 * пропорционально.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_IMAGE_RECOLOR_OPA(val) \
    { \
        .prop = LV_STYLE_BG_IMAGE_RECOLOR_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Если этот параметр включен, фоновое изображение будет расположено на видеоплите. Возможные значения:`true`или`false`.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BG_IMAGE_TILED(val) \
    { \
        .prop = LV_STYLE_BG_IMAGE_TILED, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет границы.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_BORDER_COLOR(val) \
    { \
        .prop = LV_STYLE_BORDER_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность границы. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BORDER_OPA(val) \
    { \
        .prop = LV_STYLE_BORDER_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите ширину границы. Можно использовать только значения пикселей.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BORDER_WIDTH(val) \
    { \
        .prop = LV_STYLE_BORDER_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите только, с какой стороны(-ов) должна быть нарисована граница. Возможные значения:
 * `LV_BORDER_SIDE_NONE/TOP/BOTTOM/LEFT/RIGHT/INTERNAL` .  Значения OR можно использовать как
 * ну, например  `LV_BORDER_SIDE_TOP | LV_BORDER_SIDE_LEFT` .
 * Default: `LV_BORDER_SIDE_FULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BORDER_SIDE(val) \
    { \
        .prop = LV_STYLE_BORDER_SIDE, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает, должна ли граница рисоваться до или после рисования дочерних элементов.
 * `true` : после дочерних элементов,`false`: перед дочерними элементами.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BORDER_POST(val) \
    { \
        .prop = LV_STYLE_BORDER_POST, .value = { .num = (int32_t)val } \
    }

/**
 * Установите ширину контура в пикселях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_OUTLINE_WIDTH(val) \
    { \
        .prop = LV_STYLE_OUTLINE_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет контура.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_OUTLINE_COLOR(val) \
    { \
        .prop = LV_STYLE_OUTLINE_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность контура. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_OUTLINE_OPA(val) \
    { \
        .prop = LV_STYLE_OUTLINE_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите отступы контура, то есть зазор между виджетом и контуром.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_OUTLINE_PAD(val) \
    { \
        .prop = LV_STYLE_OUTLINE_PAD, .value = { .num = (int32_t)val } \
    }

/**
 * Установите ширину тени в пикселях. Значение должно быть >= 0.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_SHADOW_WIDTH(val) \
    { \
        .prop = LV_STYLE_SHADOW_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите смещение тени в пикселях по оси X.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_SHADOW_OFFSET_X(val) \
    { \
        .prop = LV_STYLE_SHADOW_OFFSET_X, .value = { .num = (int32_t)val } \
    }

/**
 * Установите смещение тени в пикселях по направлению Y.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_SHADOW_OFFSET_Y(val) \
    { \
        .prop = LV_STYLE_SHADOW_OFFSET_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Выполните расчет тени, чтобы использовать в качестве основы прямоугольник большего или меньшего размера. Значение может
 * быть в пикселях, чтобы сделать область больше/меньше.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_SHADOW_SPREAD(val) \
    { \
        .prop = LV_STYLE_SHADOW_SPREAD, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет тени.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_SHADOW_COLOR(val) \
    { \
        .prop = LV_STYLE_SHADOW_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность тени. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_SHADOW_OPA(val) \
    { \
        .prop = LV_STYLE_SHADOW_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите непрозрачность изображения. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_IMAGE_OPA(val) \
    { \
        .prop = LV_STYLE_IMAGE_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет, который будет смешиваться с изображением.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_IMAGE_RECOLOR(val) \
    { \
        .prop = LV_STYLE_IMAGE_RECOLOR, .value = { .color = val } \
    }

/**
 * Установите интенсивность смешивания цветов. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_IMAGE_RECOLOR_OPA(val) \
    { \
        .prop = LV_STYLE_IMAGE_RECOLOR_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите определение цвета клавишей изображения. lv_image_colorkey_tсодержит два значения цвета:
 * `high_color` и`low_color`. цвет изображения от`low_color`до
 * `high_color` будет прозрачнее.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на ключ цвета изображения
 */
#define LV_STYLE_CONST_IMAGE_COLORKEY(val) \
    { \
        .prop = LV_STYLE_IMAGE_COLORKEY, .value = { .ptr = val } \
    }

/**
 * Установите ширину линий в пикселях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LINE_WIDTH(val) \
    { \
        .prop = LV_STYLE_LINE_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите ширину штрихов в пикселях. Обратите внимание, что тире работает только на горизонтальных и вертикальных линиях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LINE_DASH_WIDTH(val) \
    { \
        .prop = LV_STYLE_LINE_DASH_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите промежуток между черточками в пикселях. Обратите внимание, что тире работает только на горизонтальном и
 * вертикальные линии.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LINE_DASH_GAP(val) \
    { \
        .prop = LV_STYLE_LINE_DASH_GAP, .value = { .num = (int32_t)val } \
    }

/**
 * Конечные точки линий делаются закругленными.  `true`: закругленный,`false`: опорное окончание линии.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LINE_ROUNDED(val) \
    { \
        .prop = LV_STYLE_LINE_ROUNDED, .value = { .num = (int32_t)val } \
    }

/**
 * Установить цвет линий.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_LINE_COLOR(val) \
    { \
        .prop = LV_STYLE_LINE_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность линий.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LINE_OPA(val) \
    { \
        .prop = LV_STYLE_LINE_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Задайте ширину (толщину) дуг в пикселях.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_ARC_WIDTH(val) \
    { \
        .prop = LV_STYLE_ARC_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Конечные точки сделайте закругленными.  `true`: закругленный,`false`: опорное окончание линии.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_ARC_ROUNDED(val) \
    { \
        .prop = LV_STYLE_ARC_ROUNDED, .value = { .num = (int32_t)val } \
    }

/**
 * Установить цвет дуги.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_ARC_COLOR(val) \
    { \
        .prop = LV_STYLE_ARC_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность дуг.
 * Default: `LV_OPA_COVER` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_ARC_OPA(val) \
    { \
        .prop = LV_STYLE_ARC_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите изображение, из которого будет замаскирована дуга. Полезно отображать сложные
 * воздействие на дуги. Может быть указателем на`lv_image_dsc_t`или по пути к файлу.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на источник изображения
 */
#define LV_STYLE_CONST_ARC_IMAGE_SRC(val) \
    { \
        .prop = LV_STYLE_ARC_IMAGE_SRC, .value = { .ptr = val } \
    }

/**
 * Устанавливает цвет текста.
 * Default: `0x000000` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_TEXT_COLOR(val) \
    { \
        .prop = LV_STYLE_TEXT_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность текста. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью
 * прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает полное покрытие, другие значения
 * или LV_OPA_10 , LV_OPA_20 и т. д. означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_OPA(val) \
    { \
        .prop = LV_STYLE_TEXT_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите шрифт текста (указатель`lv_font_t *`).
 * Default: `LV_FONT_DEFAULT` , по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  val   Указатель на шрифт
 */
#define LV_STYLE_CONST_TEXT_FONT(val) \
    { \
        .prop = LV_STYLE_TEXT_FONT, .value = { .ptr = val } \
    }

/**
 * Установите расстояние между буквами в пикселях.
 * Default: 0, по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_LETTER_SPACE(val) \
    { \
        .prop = LV_STYLE_TEXT_LETTER_SPACE, .value = { .num = (int32_t)val } \
    }

/**
 * Установите межстрочный интервал в пикселях.
 * Default: 0, по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_LINE_SPACE(val) \
    { \
        .prop = LV_STYLE_TEXT_LINE_SPACE, .value = { .num = (int32_t)val } \
    }

/**
 * Установите оформление текста. Возможные значения:
 * `LV_TEXT_DECOR_NONE/UNDERLINE/STRIKETHROUGH` .  Также можно использовать значения OR.
 * Default: `LV_TEXT_DECOR_NONE` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_DECOR(val) \
    { \
        .prop = LV_STYLE_TEXT_DECOR, .value = { .num = (int32_t)val } \
    }

/**
 * Установите способ выравнивания строк текста. Обратите внимание, что это не выравнивает виджет
 * сам по себе, только строки внутри виджета. Возможные значения:
 * `LV_TEXT_ALIGN_LEFT/CENTER/RIGHT/AUTO` .  `LV_TEXT_ALIGN_AUTO` обнаружить текстовую базу
 * направлении и использует выравнивание по левому или правому краю соответственно.
 * Default: `LV_TEXT_ALIGN_AUTO` , по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_ALIGN(val) \
    { \
        .prop = LV_STYLE_TEXT_ALIGN, .value = { .num = (int32_t)val } \
    }

/**
 * Устанавливает цвет обводки контура буквы.
 * Default: `0x000000` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_TEXT_OUTLINE_STROKE_COLOR(val) \
    { \
        .prop = LV_STYLE_TEXT_OUTLINE_STROKE_COLOR, .value = { .color = val } \
    }

/**
 * Установите ширину обводки контура буквы в пикселях.
 * Default: 0, по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_OUTLINE_STROKE_WIDTH(val) \
    { \
        .prop = LV_STYLE_TEXT_OUTLINE_STROKE_WIDTH, .value = { .num = (int32_t)val } \
    }

/**
 * Установите непрозрачность контура буквы. Значение 0, `LV_OPA_0` или
 * `LV_OPA_TRANSP` означает полностью прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает
 * полное покрытие, другие значения или LV_OPA_10 , LV_OPA_20 и т. д. означают полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_TEXT_OUTLINE_STROKE_OPA(val) \
    { \
        .prop = LV_STYLE_TEXT_OUTLINE_STROKE_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Конфигуратор включает размытие. Применяется к каждомуlv_partотдельно перед
 * дети оказываются.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BLUR_RADIUS(val) \
    { \
        .prop = LV_STYLE_BLUR_RADIUS, .value = { .num = (int32_t)val } \
    }

/**
 * Если`true`фон виджета будет размыт. Деталь должна иметь < 100 %
 * непрозрачность, чтобы сделать его видимым. Если `false`, работоспособная часть будет размыта при
 * рендерится, но до рисования детей.
 * Default: `false` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BLUR_BACKDROP(val) \
    { \
        .prop = LV_STYLE_BLUR_BACKDROP, .value = { .num = (int32_t)val } \
    }

/**
 * При установке `LV_BLUR_QUALITY_SPEED` алгоритм размытия будет отдавать предпочтение скорости.
 * качество.  `LV_BLUR_QUALITY_PRECISION` заставит использовать более высокое качество, но медленнее.
 * размытие. При использовании `LV_BLUR_QUALITY_AUTO` качество будет выбрано автоматически.
 * Default: `LV_BLUR_QUALITY_AUTO` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BLUR_QUALITY(val) \
    { \
        .prop = LV_STYLE_BLUR_QUALITY, .value = { .num = (int32_t)val } \
    }

/**
 * Конфигуратор включает размытие. Применяется к каждомуlv_partотдельно перед
 * дети оказываются.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_DROP_SHADOW_RADIUS(val) \
    { \
        .prop = LV_STYLE_DROP_SHADOW_RADIUS, .value = { .num = (int32_t)val } \
    }

/**
 * Установите смещение тени в пикселях по оси X.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_DROP_SHADOW_OFFSET_X(val) \
    { \
        .prop = LV_STYLE_DROP_SHADOW_OFFSET_X, .value = { .num = (int32_t)val } \
    }

/**
 * Установите смещение тени в пикселях по направлению Y.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Да.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_DROP_SHADOW_OFFSET_Y(val) \
    { \
        .prop = LV_STYLE_DROP_SHADOW_OFFSET_Y, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет тени.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_DROP_SHADOW_COLOR(val) \
    { \
        .prop = LV_STYLE_DROP_SHADOW_COLOR, .value = { .color = val } \
    }

/**
 * Установите непрозрачность тени.
 * Default: `0` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_DROP_SHADOW_OPA(val) \
    { \
        .prop = LV_STYLE_DROP_SHADOW_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * При установке `LV_BLUR_QUALITY_SPEED` алгоритм размытия будет отдавать предпочтение скорости.
 * качество.  `LV_BLUR_QUALITY_PRECISION` заставит использовать более высокое качество, но медленнее.
 * размытие. При использовании `LV_BLUR_QUALITY_AUTO` качество будет выбрано автоматически.
 * Default: `LV_BLUR_QUALITY_PRECISION` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_DROP_SHADOW_QUALITY(val) \
    { \
        .prop = LV_STYLE_DROP_SHADOW_QUALITY, .value = { .num = (int32_t)val } \
    }

/**
 * Установите радиус на каждом углу. Значение интерпретируется в пикселях (>= 0) или
 * `LV_RADIUS_CIRCLE` для максимального радиуса.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_RADIUS(val) \
    { \
        .prop = LV_STYLE_RADIUS, .value = { .num = (int32_t)val } \
    }

/**
 * Переместите начальную точку объекта (например, отметку масштаба) радиально.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_RADIAL_OFFSET(val) \
    { \
        .prop = LV_STYLE_RADIAL_OFFSET, .value = { .num = (int32_t)val } \
    }

/**
 * Включите обрезку содержимого, выходящего за закругленные углы родительского виджета. Может быть
 * `true` или`false`.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_CLIP_CORNER(val) \
    { \
        .prop = LV_STYLE_CLIP_CORNER, .value = { .num = (int32_t)val } \
    }

/**
 * Уменьшите все значения непрозрачности виджета на этот коэффициент. Значение 0, `LV_OPA_0` или
 * `LV_OPA_TRANSP` означает полностью прозрачный, 255, `LV_OPA_100` или `LV_OPA_COVER` означает
 * полное покрытие, другие значения или LV_OPA_10 , LV_OPA_20 и т. д. означают полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_OPA(val) \
    { \
        .prop = LV_STYLE_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Сначала нарисуйте виджет на слое, затем уменьшите коэффициент непрозрачности слоя. Значение 0,
 * `LV_OPA_0` или `LV_OPA_TRANSP` означает полностью прозрачный, 255, `LV_OPA_100` или
 * `LV_OPA_COVER` означает полное покрытие, другие значения или LV_OPA_10 , LV_OPA_20 и т. д.
 * означает полупрозрачность.
 * Default: `LV_OPA_COVER` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_OPA_LAYERED(val) \
    { \
        .prop = LV_STYLE_OPA_LAYERED, .value = { .num = (int32_t)val } \
    }

/**
 * Смешайте цвет со всеми цветами виджета.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на дескриптор цветового фильтра
 */
#define LV_STYLE_CONST_COLOR_FILTER_DSC(val) \
    { \
        .prop = LV_STYLE_COLOR_FILTER_DSC, .value = { .ptr = val } \
    }

/**
 * Интенсивность смешивания цветового фильтра.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_COLOR_FILTER_OPA(val) \
    { \
        .prop = LV_STYLE_COLOR_FILTER_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Установите цвет для смешивания с объектом.
 * Default: `0x000000` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Цвет для отправки
 */
#define LV_STYLE_CONST_RECOLOR(val) \
    { \
        .prop = LV_STYLE_RECOLOR, .value = { .color = val } \
    }

/**
 * Устанавливает интенсивность смешивания цветов. Значение 0, `LV_OPA_0` или `LV_OPA_TRANSP` означает
 * полностью прозрачный. Значение 255, `LV_OPA_100` или `LV_OPA_COVER` означает полностью
 * непрозрачный. Промежуточные значения, такие как LV_OPA_10 , LV_OPA_20 и т. д., приводят к
 * полупрозрачность.
 * Default: `LV_OPA_TRANSP` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_RECOLOR_OPA(val) \
    { \
        .prop = LV_STYLE_RECOLOR_OPA, .value = { .num = (int32_t)val } \
    }

/**
 * Шаблон анимации для анимированного виджета. Должен быть указателем на `lv_anim_t`.
 * параметры анимации зависят от виджета, например. время анимации может быть, например,
 * время мигания курсора в текстовой области или время прокрутки ролика. См. Виджеты
 * документацию, чтобы узнать больше.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на дескриптор анимации
 */
#define LV_STYLE_CONST_ANIM(val) \
    { \
        .prop = LV_STYLE_ANIM, .value = { .ptr = val } \
    }

/**
 * Продолжительность анимации в миллисекундах. Его значение зависит от виджета. Например. время мигания
 * курсора в текстовой области или время прокрутки ролика. См. Виджеты
 * документацию, чтобы узнать больше.
 * Default: 0, унаследовано: Нет, расположение: Нет, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_ANIM_DURATION(val) \
    { \
        .prop = LV_STYLE_ANIM_DURATION, .value = { .num = (int32_t)val } \
    }

/**
 * Инициализированный``lv_style_transition_dsc_t``для описания перехода.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на дескриптор перехода
 */
#define LV_STYLE_CONST_TRANSITION(val) \
    { \
        .prop = LV_STYLE_TRANSITION, .value = { .ptr = val } \
    }

/**
 * Описывает, как смешать цвета с фоном. Возможные значения:
 * `LV_BLEND_MODE_NORMAL/ADDITIVE/SUBTRACTIVE/MULTIPLY/DIFFERENCE`.
 * Default: `LV_BLEND_MODE_NORMAL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BLEND_MODE(val) \
    { \
        .prop = LV_STYLE_BLEND_MODE, .value = { .num = (int32_t)val } \
    }

/**
 * Установите макет виджета. Дочерние элементы будут перемещены и изменены в соответствии с
 * политики, установленные для макета. Возможные значения см. в документации макетов.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_LAYOUT(val) \
    { \
        .prop = LV_STYLE_LAYOUT, .value = { .num = (int32_t)val } \
    }

/**
 * Установите базовое направление виджета. Возможные значения: `LV_BIDI_DIR_LTR/RTL/AUTO` .
 * Default: `LV_BASE_DIR_AUTO` , по наследству: Да, раскладка: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_BASE_DIR(val) \
    { \
        .prop = LV_STYLE_BASE_DIR, .value = { .num = (int32_t)val } \
    }

/**
 * Если установлено, для виджета будет создан слой, который будет замаскирован
 * это растровая маска A8.
 * Default: `NULL` , унаследовано: Нет, макет: Нет, доб. рисовать: Нет.
 * @param  val   Указатель на растровую маску A8
 */
#define LV_STYLE_CONST_BITMAP_MASK_SRC(val) \
    { \
        .prop = LV_STYLE_BITMAP_MASK_SRC, .value = { .ptr = val } \
    }

/**
 * Отрегулируйте чувствительность поворотных энкодеров с точностью до 1/256. Это значит, 128: замедлить
 * поворотный до половины, 512: скорость увеличивается вдвое, 256: без изменений.
 * Default: `256` , унаследовано: Да, расположение: Нет, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_ROTARY_SENSITIVITY(val) \
    { \
        .prop = LV_STYLE_ROTARY_SENSITIVITY, .value = { .num = (int32_t)val } \
    }

#if LV_USE_FLEX
/**
 * Определяет, в каком направлении гибкий макет должен располагать дочерние элементы.
 * Default: `LV_FLEX_FLOW_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_FLEX_FLOW(val) \
    { \
        .prop = LV_STYLE_FLEX_FLOW, .value = { .num = (int32_t)val } \
    }

/**
 * Определяет, как выровнять дочерние элементы в направлении гибкого потока.
 * Default: `LV_FLEX_ALIGN_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_FLEX_MAIN_PLACE(val) \
    { \
        .prop = LV_STYLE_FLEX_MAIN_PLACE, .value = { .num = (int32_t)val } \
    }

/**
 * Определяет, как выровнять дочерние элементы перпендикулярно направлению гибкого потока.
 * Default: `LV_FLEX_ALIGN_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_FLEX_CROSS_PLACE(val) \
    { \
        .prop = LV_STYLE_FLEX_CROSS_PLACE, .value = { .num = (int32_t)val } \
    }

/**
 * Определяет способ выравнивания дорожек потока.
 * Default: `LV_FLEX_ALIGN_NONE` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_FLEX_TRACK_PLACE(val) \
    { \
        .prop = LV_STYLE_FLEX_TRACK_PLACE, .value = { .num = (int32_t)val } \
    }

/**
 * Определяет, сколько места пропорционально занять из свободного места на дорожке виджета.
 * Default: `0` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_FLEX_GROW(val) \
    { \
        .prop = LV_STYLE_FLEX_GROW, .value = { .num = (int32_t)val } \
    }

#endif /* LV_USE_FLEX */

#if LV_USE_GRID
/**
 * Массив для описания столбцов сетки. Должен быть прекращен LV_GRID_TEMPLATE_LAST.
 * Default: `NULL` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Указатель на массив дескрипторов столбцов сетки
 */
#define LV_STYLE_CONST_GRID_COLUMN_DSC_ARRAY(val) \
    { \
        .prop = LV_STYLE_GRID_COLUMN_DSC_ARRAY, .value = { .ptr = val } \
    }

/**
 * Определяет способ распределения столбцов.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_COLUMN_ALIGN(val) \
    { \
        .prop = LV_STYLE_GRID_COLUMN_ALIGN, .value = { .num = (int32_t)val } \
    }

/**
 * Массив для описания строк сетки. Должен быть прекращен LV_GRID_TEMPLATE_LAST.
 * Default: `NULL` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Указатель на массив дескрипторов строк сетки
 */
#define LV_STYLE_CONST_GRID_ROW_DSC_ARRAY(val) \
    { \
        .prop = LV_STYLE_GRID_ROW_DSC_ARRAY, .value = { .ptr = val } \
    }

/**
 * Определяет способ распределения строк.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_ROW_ALIGN(val) \
    { \
        .prop = LV_STYLE_GRID_ROW_ALIGN, .value = { .num = (int32_t)val } \
    }

/**
 * Установите столбец, в котором должен быть размещен виджет.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_CELL_COLUMN_POS(val) \
    { \
        .prop = LV_STYLE_GRID_CELL_COLUMN_POS, .value = { .num = (int32_t)val } \
    }

/**
 * Установите способ выравнивания виджета по горизонтали.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_CELL_X_ALIGN(val) \
    { \
        .prop = LV_STYLE_GRID_CELL_X_ALIGN, .value = { .num = (int32_t)val } \
    }

/**
 * Установите, сколько столбцов должен охватывать виджет. Должно быть >= 1.
 * Default: 1, по наследству: Нет, раскладка: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_CELL_COLUMN_SPAN(val) \
    { \
        .prop = LV_STYLE_GRID_CELL_COLUMN_SPAN, .value = { .num = (int32_t)val } \
    }

/**
 * Установите строку, в которой должен быть размещен виджет.
 * Default: 0, по наследству: Нет, по расположению: Да, доп. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_CELL_ROW_POS(val) \
    { \
        .prop = LV_STYLE_GRID_CELL_ROW_POS, .value = { .num = (int32_t)val } \
    }

/**
 * Установите способ выравнивания виджета по вертикали.
 * Default: `LV_GRID_ALIGN_START` , по наследству: Нет, по расположению: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_CELL_Y_ALIGN(val) \
    { \
        .prop = LV_STYLE_GRID_CELL_Y_ALIGN, .value = { .num = (int32_t)val } \
    }

/**
 * Установите, сколько строк должен занимать виджет. Должно быть >= 1.
 * Default: 1, по наследству: Нет, раскладка: Да, доб. рисовать: Нет.
 * @param  val   Значение для отправки
 */
#define LV_STYLE_CONST_GRID_CELL_ROW_SPAN(val) \
    { \
        .prop = LV_STYLE_GRID_CELL_ROW_SPAN, .value = { .num = (int32_t)val } \
    }

#endif /* LV_USE_GRID */


#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /* LV_STYLE_GEN_H */
