/**
 * @file lv_os.h
 *
 */

#ifndef LV_OS_H
#define LV_OS_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *    OS OPTIONS
 *********************/

/*********************
 *      INCLUDES
 *********************/
#include "../misc/lv_types.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Заблокируйте общий мьютекс LVGL.
 * LVGL не является потокобезопасным, поэтому используется мьютекс, чтобы избежать одновременного выполнения нескольких функций LVGL.
 * из разных тем. Он должен вызываться при вызове функций LVGL из потоков.
 * отличается от темыlv_timer_handler. Его не нужно выходить в событияLVGL, потому что
 * они звонят изlv_timer_handler().
 * Он появляется внутриlv_timer_handler().
 */
void lv_lock(void);

/**
 * То же самое, что`lv_lock()`, но может отключиться из-за прерывания.
 * @return              LV_RESULT_OK: успех; LV_RESULT_INVALID: сбой
 */
lv_result_t lv_lock_isr(void);

/**
 * Пара`lv_lock()`и`lv_lock_isr()`.
 * Он разблокирует общий мьютекс LVGL.
 * Он появляется внутриlv_timer_handler().
 */
void lv_unlock(void);

/**
 * Приостанавливает текущий поток на определенное количество миллисекунд.
 * @param ms     количество миллисекунд для сна текущего потока.
 */
void lv_sleep_ms(uint32_t ms);

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /*LV_OS_H*/
