/* TSI 2023.xmo */
/*******************************************************************************
 * Copyright (c) 2023 Think Silicon Single Member PC
 *
 * Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию.
 * этого файла заголовка и/или связанных с ним файлов документации для использования, копирования,
 * изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копии
 * Материалы и разрешать лицам, которым предоставлены Материалы, делать
 * Итак, при соблюдении следующих условий:
 *
 * Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в
 * все копии или существенные части Материалов.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  Программное обеспечение предоставляется «как есть», без каких-либо явных или явных гарантий.
 *  подразумеваемые, включая, помимо прочего, гарантии товарной пригодности,
 *  пригодность для конкретной цели и отсутствие нарушений. Ни в коем случае нельзя
 *  Считайте, что Silicon Single MemberPCнесет ответственность за любые претензии, ущерб или другие
 *  ответственность, будь то по договору, правонарушению или иным образом, возникающая
 *  из, вне или в связи с программным обеспечением, использованием или другими сделками
 *  в программном обеспечении.
 ******************************************************************************/


#ifndef _NEMA_INTERPOLATORS_H_
#define _NEMA_INTERPOLATORS_H_

#ifdef __cplusplus
extern "C" {
#endif

#include "nema_sys_defs.h"

typedef struct _color_var_t {
    float r; /**< Red */
    float g; /**< Green */
    float b; /**< Blue */
    float a; /**< Alpha */
} color_var_t;

/** \brief Интерполировать цветной градиент для контура
 *
 * \param x0 x координата верхних левых вершин вершины
 * \param y0 Координата y на верхней левой вершине
 * \param w ширина стороны
 * \param h высота стороны
 * \param col0 цвет первой вершины
 * \param col1 цвет второй вершины
 * \param col1 цвет кончиков вершины
 *
 */
void nema_interpolate_rect_colors(int x0, int y0, int w, int h, color_var_t* col0, color_var_t* col1, color_var_t* col2);


/** \brief Интерполировать цветной градиент для треугольника
 *
 * \details Верхняя левая вершина рисуемого треугольника.
 *  также должен быть в аргументах вершины. Кроме того, если
 * обрезка применяется для рендеринга треугольника с градиентом,
 * верхняя левая вершина должна находиться внутри области отсечения.
 * \param x0 Координата x в первой вершине треугольника
 * \param y0 Координата y в первой вершине треугольника
 * \param x1 Координата x на вершине второго треугольника
 * \param y1 Координата y во второй вершине треугольника
 * \param x2 Координата x в вершине треугольника
 * \param y2 Координата y в вершине треугольника
 * \param col0 цвет первой вершины
 * \param col1 цвет второй вершины
 * \param col1 цвет кончиков вершины
 *
 */
void nema_interpolate_tri_colors(float x0, float y0, float x1, float y1, float x2, float y2, color_var_t* col0, color_var_t* col1, color_var_t* col2);

/** \brief Интерполировать значения буфера глубины для треугольника
 *
 * \param x0 Координата x в первой вершине треугольника
 * \param y0 Координата y в первой вершине треугольника
 * \param z0 Координата z в первой вершине треугольника
 * \param x1 Координата x на вершине второго треугольника
 * \param y1 Координата y во второй вершине треугольника
 * \param z1 Координата z на вершине второго треугольника
 * \param x2 Координата x в вершине треугольника
 * \param y2 Координата y в вершине треугольника
 * \param z2 Координата z в вершине треугольника
 *
 */
void nema_interpolate_tri_depth(float x0, float y0, float z0, float x1, float y1, float z1, float x2, float y2, float z2);

/** \brief Интерполировать значения текстур для треугольника
 *
 * \param x0 Координата x в первой вершине треугольника
 * \param y0 Координата y в первой вершине треугольника
 * \param w0 координата w в первой вершине треугольника
 * \param tx0 x координаты текстуры в первой вершине треугольника
 * \param ty0 y координаты текстуры в первой вершине треугольника
 * \param x1 Координата x на вершине второго треугольника
 * \param y1 Координата y во второй вершине треугольника
 * \param w1 координата w во второй вершине треугольника
 * \param tx1 x координаты текстуры во второй вершине треугольника
 * \param ty1 y координаты текстуры во второй вершине треугольника
 * \param x2 Координата x в вершине треугольника
 * \param y2 Координата y в вершине треугольника
 * \param координата w2 w в конце вершины треугольника
 * \param tx2 координаты текстуры x в вершине треугольника
 * \param ty2 координаты текстуры x на вершине треугольника
 * \param Ширина текстуры tex_width
 * \param Высота текстуры tex_height
 *
 */
void nema_interpolate_tx_ty(float x0, float y0, float w0, float tx0, float ty0,
                            float x1, float y1, float w1, float tx1, float ty1,
                            float x2, float y2, float w2, float tx2, float ty2,
                            int tex_width, int tex_height );
#ifdef __cplusplus
}
#endif

#endif // _NEMA_INTERPOLATORS_H_
