/* TSI 2023.xmo */
/*******************************************************************************
 * Copyright (c) 2023 Think Silicon Single Member PC
 *
 * Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию.
 * этого файла заголовка и/или связанных с ним файлов документации для использования, копирования,
 * изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копии
 * Материалы и разрешать лицам, которым предоставлены Материалы, делать
 * Итак, при соблюдении следующих условий:
 *
 * Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в
 * все копии или существенные части Материалов.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  Программное обеспечение предоставляется «как есть», без каких-либо явных или явных гарантий.
 *  подразумеваемые, включая, помимо прочего, гарантии товарной пригодности,
 *  пригодность для конкретной цели и отсутствие нарушений. Ни в коем случае нельзя
 *  Считайте, что Silicon Single MemberPCнесет ответственность за любые претензии, ущерб или другие
 *  ответственность, будь то по договору, правонарушению или иным образом, возникающая
 *  из, вне или в связи с программным обеспечением, использованием или другими сделками
 *  в программном обеспечении.
 ******************************************************************************/


#ifndef NEMA_PROVISIONAL_H__
#define NEMA_PROVISIONAL_H__

#include "nema_sys_defs.h"

#ifdef __cplusplus
extern "C" {
#endif

/** \brief Заполните треугольную полоску цвета (плавающие координаты)
 *
 * \param vertices указатель на координированные вершины (первая координата x вершины,
 *                 тогда координата вершины y)
 * \paramnum_verticesколичество вершин
 * \param stride Расстояние между двумя вершинами
 * \param rgba8888 используемый цвет
 *
 */
void nema_fill_triangle_strip_f(float* vertices, int num_vertices, int stride, uint32_t rgba8888);

/** \brief Заполните другой треугольник цвета (плавающие координаты)
 *
 * \param vertices указатель на координированные вершины (первая координата x вершины,
 *                 тогда координата вершины y)
 * \paramnum_verticesколичество вершин
 * \param stride Расстояние между двумя вершинами
 * \param rgba8888 используемый цвет
 *
 */
void nema_fill_triangle_fan_f(float* vertices, int num_vertices, int stride, uint32_t rgba8888);

/** \brief Рисует треугольник с изгибом границы. ЗаменитеAA, если он доступен.
 * Вырожденные треугольники имеют неопределенное поведение.
 *
 * \param x0 Координата x в первой вершине треугольника
 * \param y0 Координата y в первой вершине треугольника
 * \param x1 Координата x на вершине второго треугольника
 * \param y1 Координата y во второй вершине треугольника
 * \param x2 Координата x в вершине треугольника
 * \param y2 Координата y в вершине треугольника
 * \paramborder_widthширина треугольника границы
 * \param color треугольник цвета
 *
 */
void nema_draw_triangle_aa(float x0, float y0, float x1, float y1, float x2, float y2,
                           float border_width, uint32_t color);


/** \brief Нарисуйте цветной контур с закругленными краями и наклоните границу границы. ЗаменитеAA, если он доступен.
 *
 * \param x x координата верхних левых вершин показана
 * \param y y координата на верхней левой вершине
 * \param w ширина стороны
 * \param h высота стороны
 * \param r радиус угла
 * \paramborder_widthширина границы
 * \param rgba8888 Цвет rgba со скругленными углами
 *
 */
void nema_draw_rounded_rect_aa(float x, float y, float w, float h, float r, float border_width, uint32_t rgba8888);


/** \brief Нарисуйте закрашенный цветной контур с закругленными краями и наклоните границу границы. ЗаменитеAA, если он доступен.
 *
 * \param x x координата верхних левых вершин показана
 * \param y y координата на верхней левой вершине
 * \param w ширина стороны
 * \param h высота стороны
 * \param r радиус угла
 * \param rgba8888 Цвет rgba со скругленными углами
 *
 */
void nema_fill_rounded_rect_aa(float x, float y, float w, float h, float r, uint32_t rgba8888);

/** \brief Рисует четырехугольник с поворотом границы. ЗаменитеAA, если он доступен.
 * Поддерживаются только выпуклые четырехугольники.
 *
 * \param x0 Координата x в первой вершине четырехугольника
 * \param y0 Координата y в первой вершине четырёхугольника
 * \param x1 Координата x на вершине второго четырехугольника
 * \param y1 Координата y на второй вершине четырёхугольника
 * \param x2 Координата x в вершине четырехугольника
 * \param y2 Координата y на вершине четырехугольника
 * \param x3 Координата x в четвертой вершине четырехугольника
 * \param y3 Координата y на четвертой вершине четырёхугольника
 * \paramborder_widthширина треугольника границы
 * \param color цвет четырёхугольника
 *
 */
void nema_draw_quad_aa(float x0, float y0, float x1, float y1, float x2, float y2, float x3, float y3,
                       float border_width, uint32_t color);
#ifdef __cplusplus
}
#endif

#endif // NEMA_PROVISIONAL_H__
