/* TSI 2023.xmo */
/*******************************************************************************
 * Copyright (c) 2023 Think Silicon Single Member PC
 *
 * Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию.
 * этого файла заголовка и/или связанных с ним файлов документации для использования, копирования,
 * изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копии
 * Материалы и разрешать лицам, которым предоставлены Материалы, делать
 * Итак, при соблюдении следующих условий:
 *
 * Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в
 * все копии или существенные части Материалов.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  Программное обеспечение предоставляется «как есть», без каких-либо явных или явных гарантий.
 *  подразумеваемые, включая, помимо прочего, гарантии товарной пригодности,
 *  пригодность для конкретной цели и отсутствие нарушений. Ни в коем случае нельзя
 *  Считайте, что Silicon Single MemberPCнесет ответственность за любые претензии, ущерб или другие
 *  ответственность, будь то по договору, правонарушению или иным образом, возникающая
 *  из, вне или в связи с программным обеспечением, использованием или другими сделками
 *  в программном обеспечении.
 ******************************************************************************/


#ifndef NEMA_MATH_H__
#define NEMA_MATH_H__

#ifdef __cplusplus
extern "C" {
#endif

#define NEMA_E          2.71828182845904523536f  /**< e */
#define NEMA_LOG2E      1.44269504088896340736f  /**< log2(e) */
#define NEMA_LOG10E     0.434294481903251827651f /**< log10(e) */
#define NEMA_LN2        0.693147180559945309417f /**< ln(2) */
#define NEMA_LN10       2.30258509299404568402f  /**< ln(10) */
#define NEMA_PI         3.14159265358979323846f  /**< pi */
#define NEMA_PI_2       1.57079632679489661923f  /**< pi/2 */
#define NEMA_PI_4       0.785398163397448309616f /**< pi/4 */
#define NEMA_1_PI       0.318309886183790671538f /**< 1/pi */
#define NEMA_2_PI       0.636619772367581343076f /**< 2/pi */
#define NEMA_2_SQRTPI   1.12837916709551257390f  /**< 2/sqrt(pi) */
#define NEMA_SQRT2      1.41421356237309504880f  /**< sqrt(2) */
#define NEMA_SQRT1_2    0.707106781186547524401f /**< 1/sqrt(2) */

/** \brief Быстрая аппроксимация синуса заданного угла
 *
 * \paramangle_degreesУгол в градусах
 * \return Синус заданного угла
 *
 */
float nema_sin(float angle_degrees);


/** \brief Быстрая аппроксимация заданного угла косинуса
 *
 * \paramangle_degreesУгол в градусах
 * \return Косинус заданного угла
 *
 */
float nema_cos(float angle_degrees);

/** \brief Быстрая касательная аппроксимация заданного угла
 *
 * \paramangle_degreesУгол в градусах
 * \return Тангенс заданного угла
 *
 */
float nema_tan(float angle_degrees);


/** \brief Быстрая аппроксимация синуса заданного угла
 *
 * \paramangle_radiansУгол в радианах
 * \return Синус заданного угла
 *
 */
float nema_sin_r(float angle_radians);


/** \brief Быстрая аппроксимация заданного угла косинуса
 *
 * \paramangle_radiansУгол в радианах
 * \return Косинус заданного угла
 *
 */
float nema_cos_r(float angle_radians);

/** \brief Быстрая касательная аппроксимация заданного угла
 *
 * \paramangle_radiansУгол в радианах
 * \return Тангенс заданного угла
 *
 */
float nema_tan_r(float angle_radians);

/** \brief Быстрая арктангенсальная аппроксимация г/х
 *
 * \параметр y значение
 * \параметр x значение
 * \return Арктангенс заданного г/х в градусах
 *
 */
float nema_atan2(float y, float x);

/** \brief Быстрая арктангенсальная аппроксимация г/х
 *
 * \параметр y значение
 * \параметр x значение
 * \return Арктангенс заданного y/x в радианах
 *
 */
float nema_atan2_r(float y, float x);

/** \brief Грубое приближение x, возведенного на степень y.  USEWITHCAUTION!
 *
 * \param x базовое значение. Должность быть неотрицательным.
 * \param y значение громкости
 * \возвращаем результат возведения x в степень y
 *
 */
float nema_pow(float x, float y);

/** \brief Грубое приближение квадратного шага из x.  USEWITHCAUTION!
 *
 * \param x значение X. Должность быть неотрицательным
 * \param
 * \return Квадратный корень из x
 *
 */
float nema_sqrt(float x);


/** \brief Аппроксимация обратного тангенса x с плавающей запятой
 *
 * \param x значение X
 * \return Обратный тангенс (уголь) x в градусах
 *
 */
float nema_atan(float x);

/** \brief Найдите минимум два измерения
 *
 * \param Первое значение
 * \param b Второе значение
 * \return Минимум a и b
 *
 */
#define nema_min2(a,b) (((a)<(b))?( a):(b))

/** \brief Определите максимум двух результатов
 *
 * \param Первое значение
 * \param b Второе значение
 * \return Максимум a и b
 *
 */
#define nema_max2(a,b) (((a)>(b))?( a):(b))

/** \brief Значение клеммы
 *
 * \param val Значение для фиксации
 * \param min Минимальное значение
 * \param max Минимальное значение
 * \return Зафиксированное значение
 *
 */
#define nema_clamp(val, min, max) nema_min2((max), nema_max2((min), (val)))

/** \brief Вычислить абсолютное значение int
 *
 * \параметр значение
 * \return Абсолютное значение
 *
 */
#define nema_abs(a)    (((a)< 0 )?(-(a)):(a))

/** \brief Вычислить абсолютное значение числа с плавающей запятой
 *
 * \параметр значение
 * \return Абсолютное значение
 *
 */
#define nema_absf(a)    (((a)< 0.f )?(-(a)):(a))


/** \brief Сравнение двух чисел с плавающей запятой
 *
 * \param x Первое число с плавающей запятой
 * \param y число Второе с плавающей запятой
 * \return 1, если x == y, 0, если x != y
 *
 */
#define nema_floats_equal(x, y) (nema_absf((x) - (y)) <= 0.00001f * nema_min2(nema_absf(x), nema_absf(y)))

/** \brief Доказывает, что равно ли значение x означает
 *
 * \param x значение X
 * \return 1, если x == 0, 0, если x != 0
 *
 */
#define nema_float_is_zero(x) (nema_absf(x) <= 0.00001f)

/** \brief Перевести градусы в радианы
 *
 * \param d Угол в градусах
 * \return Угол в радианах
 *
 */
#define nema_deg_to_rad(d) (0.0174532925199f * (d))  //rad = град*пи/180

/** \brief Перевести радианы в градусы
 *
 * \param r Угол в радианах
 * \return Угол в градусах
 *
 */
#define nema_rad_to_deg(r) (57.295779513f    * (r))  //deg = рад * 180/пи

/** \brief Преобразование целого числа в фиксированную точку 16,16
 *
 * \param — значение для преобразования
 * \return 16.16 значение фиксированной точки
 *
 */
#define nema_i2fx(a)   ((a)*0x10000)

/** \brief Преобразование числа с плавающей запятой в фиксированную точку 16,16.
 *
 * \param — значение для преобразования
 * \return 16.16 значение фиксированной точки
 *
 */
// #definenema_f2fx(a) ((int)(((a)*((float)0x10000)+0.5f)))
int nema_f2fx(float f); //   ((int)(((a)*((float) 0x10000 )+0.5f)))

/** \краткое назначение пола
 *
 * \param a, которое необходимо оценить
 * \return минимальное значение
 *
 */
#define nema_floor(f) ((int)(f) - ( (int)(f) > (f) ))

/** \краткое назначение потолка
 *
 * \param, значение которого должно быть ограничено
 * \возврат максимального значения
 *
 */
#define nema_ceil(f)  ((int)(f) + ( (int)(f) < (f) ))

/** \краткая функция усечения
 *
 * \param x, которое нужно усечь
 * \вернуть усеченное значение
 *
 */
#define nema_truncf(x) (x < 0.0f ? nema_ceil(x) : nema_floor(x))

/** \краткая функция Float Modulo
 *
 * \param x Дивиденд
 * \параметры и делитель
 * \return Остаток
 *
 */
#define nema_fmod(x, y) ( (x) - nema_truncf( ( (x) / (y) ) ) * (y) )

#ifdef __cplusplus
}
#endif

#endif
