/****************************************************************************
 *
 * ftoption.h
 *
 *   Макросы конфигурации, выбираемые пользователем (только в спецификации).
 *
 * Copyright (C) 1996-2022 by
 * Дэвид Тернер, Роберт Вильгельм и Вернер Лемберг.
 *
 * Этот файл является частью проекта FreeType и может использоваться только
 * изменено и применяется в условиях проекта FreeType
 * лицензия LICENSE. TXT .  Продолжая использовать, изменять или распространять
 * этим файлом вы указываете, что прочитали лицензию и
 * понять и принять это полностью.
 *
 */

#ifndef FTOPTION_H_
#define FTOPTION_H_

#include <ft2build.h>

FT_BEGIN_HEADER

/**************************************************************************
 *
 *                USER-SELECTABLE CONFIGURATION MACROS
 *
 * Этот файл содержит определения макросов конфигурации по умолчанию для
 * стандартная сборка библиотеки FreeType.  Есть три пути использования
 * этот файл для создания версий библиотеки для конкретного проекта:
 *
 * - Вы можете изменить этот файл вручную, но это не рекомендуется в
 *   случаи, когда вы хотите собрать несколько версий библиотеки
 *   из одного исходного каталога.
 *
 * - Вы можете поместить копию этого файла в каталог сборки, подробнее
 *   Именно в`$BUILD/freetype/config/ftoption.h`, где `$BUILD`
 *   имя включенного каталога_before_, включаемого FreeType
 *   путь во время компиляции.
 *
 *   Makefile FreeType по умолчанию использует каталог сборки.
 *   `builds/<system>` по умолчанию, но вы можете легко изменить его под себя.
 *   собственные проекты.
 *
 * - Скопируйте файл <ft2build.h> в`$BUILD/ft2build.h`и измените его.
 *   немного, чтобы предварительно определить макрос `FT_CONFIG_OPTIONS_H`, используемый для поиска
 *   этот файл во время сборки.  Например,
 *
 *   ```
 *     #defineFT_CONFIG_OPTIONS_H<myftoptions.h>
 *     #include <freetype/config/ftheader.h>
 *   ```
 *
 *   будет использовать`$BUILD/myftoptions.h`вместо этого файла для макроса
 *   определения.
 *
 *   Также обратите внимание, что вы можете аналогичным образом предварительно определить макрос
 *   `FT_CONFIG_MODULES_H` используется для поиска файла со списком модулей.
 *   которые статически связаны с библиотекой во время компиляции.  Автор
 *   по умолчанию это файл`<freetype/config/ftmodule.h>`.
 *
 * Мы настоятельно рекомендуем использовать третий метод, когда это возможно.
 *
 */

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/**** G E N E R A L   F R E E T Y P E   2   C O N F I G U R A T I O N ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/*#************************************************************************
 *
 * Если вы используете эту опцию конфигурации, FreeType распознает
 * переменная среды под названием `FREETYPE_PROPERTIES`, которую можно использовать для
 * управлять различными драйверами и модулями шрифтов.  Контролируемый
 * Свойства перечислены в разделе @properties.
 *
 * Вам необходимо отменить определение этой опции конфигурации на платформах, на которых отсутствует
 * концепция концепции среды (и, следовательно, не имеет `getenv`
 * функция), например Windows CE.
 *
 * `FREETYPE_PROPERTIES` имеет следующую синтаксическую форму (здесь она разбита на
 * несколько строк для лучшей читаемости).
 *
 * ```
 *   <необязательный пробел>
 *   <имя-модуля1> ':'
 *   <имя-свойства1> '=' <значение-свойства1>
 *   <пробел>
 *   <имя-модуля2> ':'
 *   <имя-свойства2> '=' <значение-свойства2>
 *   ...
 * ```
 *
 * Пример:
 *
 * ```
 *   FREETYPE_PROPERTIES =truetype:версия-интерпретатора=35 \
 *                       cff:no-stem-darkening=1
 * ```
 *
 */
#define FT_CONFIG_OPTION_ENVIRONMENT_PROPERTIES

/**************************************************************************
 *
 * Раскомментируйте строку ниже, если вы хотите активировать рендеринг LCD.
 * технология, аналогичная ClearType в данной сборке библиотеки.  Это
 * Технология утраивает разрешение в направлении цветовых субпикселей.  Чтобы
 * Чтобы смягчить цветовые полосы, присущие этой технологии, вам также необходимо
 * явно настройте фильтрацию LCD.
 *
 * Если этот макрос не определен, FreeType предлагает альтернативуLCD.
 * технология рендеринга, обеспечивающая превосходный результат.
 */
/* #define FT_CONFIG_OPTION_SUBPIXEL_RENDERING */

/**************************************************************************
 *
 * Многие компиляторы предоставляют 64-битный тип данных, отличный от ANSI, который может использоваться
 * FreeType для ускорения некоторых компьютеров.  Однако это создаст некоторые
 * проблемы при компиляции библиотеки в строгом режиме ANSI.
 *
 * По этой причине использование 64-битных целых чисел обычно отключено, когда
 * определен макрос `__STDC__`.  Однако вы можете отключить это,
 * определение макроса `FT_CONFIG_OPTION_FORCE_INT64` здесь.
 *
 * Для большинства компиляторов это создаст предупреждения компиляции только тогда, когда
 * строительство библиотеки.
 *
 * ObNote: 64-битные целые числа, специфичные для компилятора, обнаруживаются в
 *         файл`ftconfig.h`либо статически, либо через `configure`
 *         скрипт на поддерживаемых платформах.
 */
#undef FT_CONFIG_OPTION_FORCE_INT64

/**************************************************************************
 *
 * Если этот макрос определен, не пытайтесь использовать ассемблерную версию
 * функции, критичные к производительности (например,@FT_MulFix).  Вам следует делать только
 * чтобы убедиться, что функция ассемблера работает правильно, или выполнить
 * тесты производительности различных реализаций.
 */
/* #define FT_CONFIG_OPTION_NO_ASSEMBLER */

/**************************************************************************
 *
 * Если этот макрос определен, попробуйте использовать встроенную ассемблерную версию
 * Функция@FT_MulFix, которая является «горячей точкой» при включении и подсказках.
 * глифы, и которые должны выполняться как можно быстрее.
 *
 * Обратите внимание: если ваш компилятор или CPU не поддерживается, по умолчанию будет установлено значение
 * Стандартная и переносимая продукция находится в `ftcalc.c`.
 */
#define FT_CONFIG_OPTION_INLINE_MULFIX

/**************************************************************************
 *
 * LZW - поддержка сжатых файлов.
 *
 *   FreeType теперь обрабатывает файлы шрифтов, сжимая их с помощью
 *   Программа `compress`.  В основном это используется для анализа многих PCF.
 *   файлы, поставляемые с различными дистрибутивами X11.  Реализация
 *   использует`zopen`NetBSD для частичного распаковывания файлов на лето (см.
 *   `src/lzw/ftgzip.c`).
 *
 *   Определите этот макрос, если вы хотите включить эту «функцию».
 */
#define FT_CONFIG_OPTION_USE_LZW

/**************************************************************************
 *
 * Поддержка сжатых файлов Gzip.
 *
 *   FreeType теперь обрабатывает файлы шрифтов, сжимая их с помощью
 *   Программа `gzip`.  В основном это используется для анализа многих файлов PCF.
 *   которые по анонимности с XFree86.  Реализация использует zlib для частичного
 *   разархивируйте файл на лето (см.`src/gzip/ftgzip.c`).
 *
 *   Определите этот макрос, если вы хотите включить эту «функцию».  См. также
 *   макрос `FT_CONFIG_OPTION_SYSTEM_ZLIB` ниже.
 */
#define FT_CONFIG_OPTION_USE_ZLIB

/**************************************************************************
 *
 * Выбор библиотеки ZLib
 *
 *   Этот макрос используется только тогда, когда определен `FT_CONFIG_OPTION_USE_ZLIB`.
 *   Он позволяет компоненту FreeType «ftgzip» связываться с системным файлом.
 *   установка библиотеки ZLib.  Это полезно в таких компонентах, как
 *   Unix или VMS, где он вообще уже доступен.
 *
 *   Если вы оставите его неопределенным, компонент будет использовать собственную копию
 *   Вместо этого исходники zlib.  Они были изменены для включения
 *   непосредственно внутри компонента и **не** экспортировать внешнюю функцию
 *   имена.  Это позволяет вам связаться с любой программой с FreeType_and_ZLib.
 *   без увязывания конфликтов.
 *
 *   Не воспользуйтесь здесь этим макросом`#undef`, так как сборка системы может определить
 *   это только для определенных конфигураций.
 *
 *   Если вы используете сборку системы, например cmake или скрипт`configure`,
 *   параметры, установленные этими программами, имеют приоритет, перезаписывая значение
 *   вот с настроенным.
 *
 *   Если вы используете сборку системы, сделайтеGNUнапрямую (то есть без
 *   `configure` ) и вы определяете этот макрос, вам также необходимо передать
 *   `SYSTEM_ZLIB=yes` в качестве аргумента.
 */
/* #define FT_CONFIG_OPTION_SYSTEM_ZLIB */

/**************************************************************************
 *
 * Поддержка сжатых файлов Bzip2.
 *
 *   FreeType теперь обрабатывает файлы шрифтов, сжимая их с помощью
 *   Программа `bzip2`.  В основном это используется для анализа многих файлов PCF.
 *   которые по анонимности с XFree86.  Реализация использует`libbz2`для частичного
 *   разархивируйте файл на лето (см.`src/bzip2/ftbzip2.c`).  Вопреки
 *   для gzip, bzip2 на данный момент не включен и необходимо использовать систему
 *   доступная реализация bzip2.
 *
 *   Определите этот макрос, если вы хотите включить эту «функцию».
 *
 *   Если вы используете сборку системы, например cmake или скрипт`configure`,
 *   параметры, установленные этими программами, имеют приоритет, перезаписывая значение
 *   вот с настроенным.
 */
/* #define FT_CONFIG_OPTION_USE_BZIP2 */

/**************************************************************************
 *
 * Определите, чтобы отключить использование функций и типов файлового потока, `FILE` ,
 * `fopen` и т. д. д. Будем использовать меньшие системные библиотеки во встроенных
 * системы, имеющие несколько системных библиотек, некоторые с файлами или без них.
 * поддержка потока, в тех случаях, когда поддержка файлового потока не требуется
 * например, загрузка в память файлов шрифтов.
 */
/* #define FT_CONFIG_OPTION_DISABLE_STREAM_SUPPORT */

/**************************************************************************
 *
 * Поддержка растровых изображений PNG.
 *
 *   FreeType теперь обрабатывает загрузку цветных растровых глифов в формате PNG.
 *   Для этого необходима помощь внешней библиотеки libpng.  Несжатый
 *   цветные растровые изображения не требуют каких-либо внешних библиотек и будут поддерживаться
 *   независимо от этой конфигурации.
 *
 *   Определите этот макрос, если вы хотите включить эту «функцию».
 *
 *   Если вы используете сборку системы, например cmake или скрипт`configure`,
 *   параметры, установленные этими программами, имеют приоритет, перезаписывая значение
 *   вот с настроенным.
 */
#define FT_CONFIG_OPTION_USE_PNG

/**************************************************************************
 *
 * Поддержка HarfBuzz.
 *
 *   FreeType использует функцию HarfBuzz для улучшения электронных подсказок OpenType.
 *   шрифты.  Многие глифы, если они доступны, не могут быть напрямую адресованы шрифтом.
 *   Карта персонажей также будет подсвечена.
 *
 *   Определите этот макрос, если вы хотите включить эту «функцию».
 *
 *   Если вы используете сборку системы, например cmake или скрипт`configure`,
 *   параметры, установленные этими программами, имеют приоритет, перезаписывая значение
 *   вот с настроенным.
 */
/* #define FT_CONFIG_OPTION_USE_HARFBUZZ */

/**************************************************************************
 *
 * Поддержка Бротли.
 *
 *   FreeType использует компонент Brotli для поддержки распаковки.
 *   WOFF2 потоки.
 *
 *   Определите этот макрос, если вы хотите включить эту «функцию».
 *
 *   Если вы используете сборку системы, например cmake или скрипт`configure`,
 *   параметры, установленные этими программами, имеют приоритет, перезаписывая значение
 *   вот с настроенным.
 */
/* #define FT_CONFIG_OPTION_USE_BROTLI */

/**************************************************************************
 *
 * Обработка имён Postscript Glyph
 *
 *   По умолчанию FreeType 2 компилируется с модулем «psnames».  этот
 *   модуль отвечает за преобразование строки имени глифа в Юникод.
 *   значение или вернуть стандартное имя глифа Macintosh для использования с
 *   Таблица сообщений TrueType.
 *
 *   Измените определение этого макроса, если вы не хотите, чтобы в вашем файле компилировались «psnames».
 *   сборка FreeType.  Это имеет следующие эффекты:
 *
 *   - Драйвер TrueType предоставит свой собственный набор имен глифов, если вы
 *     создайте его для поддержки имен Postscript в таблице 'post' TrueType,
 *     но не будет синтезировать отсутствующую карту символов Юникода.
 *
 *   - Драйвер Type~1 не сможет синтезировать карту символов Unicode.
 *     из глифов, встречающихся в шрифтах.
 *
 *   Обычно вы отменяете определение этого макроса конфигурации при создании
 *   версия FreeType, не содержащая драйвера Type~1 илиCFF.
 */
#define FT_CONFIG_OPTION_POSTSCRIPT_NAMES

/**************************************************************************
 *
 * Поддержка имен Postscript для измерений Unicode
 *
 *   По умолчанию FreeType~2 собирается со скомпилированным модулем «psnames».
 *   Помимо прочего, модуль используется для преобразования имени глифа в
 *   Значение Юникода.  Это особенно полезно для синтеза
 *   использовать Charmap Unicode от драйвераCFF/Type~1 через большой
 *   таблица под названием «Список глифов Adobe» (AGL).
 *
 *   Если вы не хотите, измените определение этого макроса, список чтобы Adobe Glyph скомпилировался.
 *   в вашем модуле «psnames».  Драйвер типа~1 не получится
 *   синтезировать карту символов Юникода из глифов, найденных в шрифтах.
 */
#define FT_CONFIG_OPTION_ADOBE_GLYPH_LIST

/**************************************************************************
 *
 * Поддержка шрифтов Mac
 *
 *   Определите этот макрос, если вам нужна поддержка контурных шрифтов в формате Mac.
 *   (mac dfont, ресурс mac, macbinary, независимо ресурс mac) на
 *   платформа, отличная от Mac.
 *
 *   Обратите внимание, что ресурс «FOND» не проверен.
 */
/* #define FT_CONFIG_OPTION_MAC_FONTS */

/**************************************************************************
 *
 * Угадывание методов доступа к вилкам встроенных ресурсов
 *
 *   Включите поддержку дополнительных шрифтов Mac на платформах, отличных от Mac (например,GNU/Linux).
 *
 *   Ветви ресурсов, которые включают данные шрифтов, иногда хранятся в
 *   места, которые пользователи или разработчики не ожидали.  В некоторых случаях
 *   Разветвления ресурсов начинаются с некоторого смещения от начала файла.  В
 *   в других случаях фактическая ветка ресурса хранится в файле, отличном от
 *   то, что указывает пользователь.  Если эта опция активирована, попробуйте FreeType
 *   чтобы угадать, нужно ли использовать такие смещения или другие имена файлов.
 *
 *   Обратите внимание, что обычный прямой доступ к ветвям ресурсов контролируется через
 *   опция `FT_CONFIG_OPTION_MAC_FONTS`.
 */
#ifdef FT_CONFIG_OPTION_MAC_FONTS
    #define FT_CONFIG_OPTION_GUESSING_EMBEDDED_RFORK
#endif

/**************************************************************************
 *
 * Разрешить использование`FT_Incremental_Interface`для загрузки шрифтов, которые
 * не содержат данных глифа, но предоставляют их через функцию обратного вызова.  Это
 * требуется клиентам, поддерживающим форматы документов, предоставляющие данные шрифтов
 * постепенный анализ документа, например Ghostscript
 * интерпретатор языка PostScript.
 */
#define FT_CONFIG_OPTION_INCREMENTAL

/**************************************************************************
 *
 * Размер пула рендеринга в байтах, используемый конвертером строк развертки для
 * сделать всю свою работу.
 */
#define FT_RENDER_POOL_SIZE  16384L

/**************************************************************************
 *
 * FT_MAX_MODULES
 *
 *   Максимальное количество модулей, которые можно зарегистрировать в одном
 *   Объект библиотеки FreeType.  32~ — значение по умолчанию.
 */
#define FT_MAX_MODULES  32

/**************************************************************************
 *
 * Уровень отладки
 *
 *   FreeType можно скомпилировать в режиме отладки или трассировки.  В режиме отладки
 *   ошибки сообщаются через компонент «ftdebug».  В режиме трассировки
 *   дополнительные сообщения отправляются на стандартный вывод во время выполнения.
 *
 *   Определите `FT_DEBUG_LEVEL_ERROR` для сборки библиотеки в режиме отладки.
 *   Определите `FT_DEBUG_LEVEL_TRACE`, чтобы построить его в режиме трассировки.
 *
 *   Не определяйте ни один из этих макросов для компиляции в режиме выпуска!
 *
 *   Не указывайте здесь эти макросы`#undef`, так как сборка системы может определить
 *   их только для определенных конфигураций.
 */
/* #define FT_DEBUG_LEVEL_ERROR */
/* #define FT_DEBUG_LEVEL_TRACE */

/**************************************************************************
 *
 * Ведение журнала
 *
 *   Компиляция FreeType в режиме отладки или трассировки приводит к регистрации FreeType.
 *   и записывайте сообщения в журнал `stderr`.  Включение этого макроса
 *   автоматически форсирует `FT_DEBUG_LEVEL_ERROR` и
 *   `FT_DEBUG_LEVEL_TRACE` макросы и позволяет FreeType записывать ошибки и
 *   записать сообщения журнала в файл вместо`stderr`.  Для записей журналов
 *   в файле FreeType использует внешнюю библиотеку`dlg`(исходный код
 *   код находится в `src/dlg`).
 *
 *   Для этой опции требуется компилятор C99.
 */
/* #define FT_DEBUG_LOGGING */

/**************************************************************************
 *
 * Отладка автоустановщика
 *
 *   Если определен `FT_DEBUG_AUTOFIT`, FreeType предоставляет некоторые средства для
 *   управлять поведением автоустановщика в целях отладки с помощью глобальных
 *   логические переменные (следовательно, вам не следует **никогда** включать это
 *   при компиляции в режиме выпуска):
 *
 *   ```
 *     _af_debug_disable_horz_hints
 *     _af_debug_disable_vert_hints
 *     _af_debug_disable_blue_hints
 *   ```
 *
 *   Кроме того, следующие функции предоставляют дампы различных
 *   Внутренняя структура автоподбора в стандартном выводе (с использованием `printf`):
 *
 *   ```
 *     af_glyph_hints_dump_points
 *     af_glyph_hints_dump_segments
 *     af_glyph_hints_dump_edges
 *     af_glyph_hints_get_num_segments
 *     af_glyph_hints_get_segment_offset
 *   ```
 *
 *   В качестве аргумента они используют еще одну глобальную переменную:
 *
 *   ```
 *     _af_debug_hints
 *   ```
 *
 *   Пожалуйста, взгляните на демонстрационную программу `ftgrid`, чтобы увидеть, как они
 *   следует использовать переменные и макросы.
 *
 *   Не указывайте здесь эти макросы`#undef`, так как сборка системы может определить
 *   их только для определенных конфигураций.
 */
/* #define FT_DEBUG_AUTOFIT */

/**************************************************************************
 *
 * Отладка памяти
 *
 *   FreeType теперь подключается со связным отладчиком памяти, способом
 *   обнаружения простых ошибок, таких как утечки памяти или двойное удаление.  Чтобы
 *   скомпилируйте его в своей сборке библиотеки, вы должны определить
 *   `FT_DEBUG_MEMORY` здесь.
 *
 *   Обратите внимание, что отладчик памяти активируется во время выполнения только тогда, когда
 *   также определение переменная_environment_`FT2_DEBUG_MEMORY` !
 *
 *   Не воспользуйтесь`#undef`здесь этим макросом, поскольку он может определить систему сборки.
 *   только для определенных конфигураций.
 */
/* #define FT_DEBUG_MEMORY */

/**************************************************************************
 *
 * Ошибки модуля
 *
 *   Если этот макрос установлен (по умолчанию_not_), старший байт
 *   код ошибки указывает модуль, в котором произошла ошибка, а
 *   младший байт — это реальный код ошибки.
 *
 *   Установка этого макроса имеет смысл только в целях отладки, поскольку он
 *   нарушит совместимость исходного кода некоторых программ, использующих
 *   FreeType~2.
 *
 *   Более подробную информацию можно найти в файлах`ftmoderr.h`и `fterrors.h`.
 */
#undef FT_CONFIG_OPTION_USE_MODULE_ERRORS

/**************************************************************************
 *
 * Поддержка глифов OpenType SVG
 *
 *   Установка этого макроса включает поддержку глифов OpenType SVG.  Автор
 *   по умолчанию FreeType может изживать только документыSVG.  Однако оно также может
 *   визуализировать их, если внешние функции рендеринга подключены в
 *   время выполнения.
 *
 *   Более подробную информацию о хуках можно найти в файле `otsvg.h`.
 */
#define FT_CONFIG_OPTION_SVG

/**************************************************************************
 *
 * Строки ошибок
 *
 *   Если этот макрос установлен,`FT_Error_String`вернет осмысленный результат.
 *   описания.  По умолчанию это не включено, чтобы уменьшить общее
 *   размер FreeType.
 *
 *   Более подробную информацию можно найти в файле `fterrors.h`.
 */
#define FT_CONFIG_OPTION_ERROR_STRINGS

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/****        S F N T   D R I V E R    C O N F I G U R A T I O N       ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_EMBEDDED_BITMAPS`, если вы хотите поддерживать
 * встроенные растровые изображения во всех форматах с использованием модуля «sfnt» (именно
 * TrueType~& OpenType).
 */
#define TT_CONFIG_OPTION_EMBEDDED_BITMAPS

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_COLOR_LAYERS`, если вы хотите поддерживать цветную
 * контуры (из таблиц 'COLR'/'CPAL') во всех форматах с использованием 'sfnt'
 * модуль (а именно TrueType~& OpenType).
 */
#define TT_CONFIG_OPTION_COLOR_LAYERS

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_POSTSCRIPT_NAMES`, если вы хотите иметь возможность
 * загрузить и перечислить имена глифов Postscript в TrueType или OpenType
 * файл.
 *
 * Обратите внимание: если вы не скомпилировали модуль «psnames», отменив определение
 * выше`FT_CONFIG_OPTION_POSTSCRIPT_NAMES`модуль 'sfnt' будет
 * содержат дополнительный код, используемый для чтения таблицы имен PS из шрифта.
 *
 * (По умолчанию модуль использует «psnames» для извлечения имен глифов.)
 */
#define TT_CONFIG_OPTION_POSTSCRIPT_NAMES

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_SFNT_NAMES`, если вашим приложениям необходим доступ
 * имена внутренней таблицы в формате на основеSFNT, например TrueType или
 * ОпенТип.  Таблица имен содержит различные строки, используемые для описания
 * шрифт, например фамилия, авторские права, версия и т. д. Он не содержит
 * хотя любое имя глифа.
 *
 * Доступ к именам SFNT осуществляется с помощью функций, объявленных в
 * `ftsnames.h` .
 */
#define TT_CONFIG_OPTION_SFNT_NAMES

/**************************************************************************
 *
 * Поддержка TrueType CMap
 *
 *   Здесь вы можете точно настроить таблицы TrueType CMap.
 *   поддерживается.
 */
#define TT_CONFIG_CMAP_FORMAT_0
#define TT_CONFIG_CMAP_FORMAT_2
#define TT_CONFIG_CMAP_FORMAT_4
#define TT_CONFIG_CMAP_FORMAT_6
#define TT_CONFIG_CMAP_FORMAT_8
#define TT_CONFIG_CMAP_FORMAT_10
#define TT_CONFIG_CMAP_FORMAT_12
#define TT_CONFIG_CMAP_FORMAT_13
#define TT_CONFIG_CMAP_FORMAT_14

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/****    T R U E T Y P E   D R I V E R    C O N F I G U R A T I O N   ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_BYTECODE_INTERPRETER`, если вы хотите скомпилировать
 * интерпретатор байт-кода в драйвере TrueType.
 *
 * Отменив это определение, вы скомпилируете только код, необходимый для загрузки.
 * Глифы TrueType без подсказок.
 *
 * Не воспользуйтесь`#undef`здесь этим макросом, поскольку он может определить систему сборки.
 * только для определенных конфигураций.
 */
#define TT_CONFIG_OPTION_BYTECODE_INTERPRETER

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_SUBPIXEL_HINTING`, если вы хотите скомпилировать
 * Поддержка субпиксельных хинтингов в драйвере TrueType.  Это изменяет
 * Механизм подсказок TrueType, когда используется что-либо кроме`FT_RENDER_MODE_MONO`.
 * просил.
 *
 * В частности, он модифицирует интерпретатор байт-кода для интерпретации (или
 * нет) конструкция сделана таким образом, чтобы все шрифты TrueType выглядели так:
 * они делают это в среде Windows ClearType (DirectWrite).  См. [1] для
 * технический обзор того, что это означает.  См. `ttinterp.h`для получения дополнительной информации.
 * Подробности об опции LEAN.
 *
 * Есть три возможных значения.
 *
 * Значение 1:
 *   Это значение связано с прозвищем «Бесконечность», предоставленным
 *   человек по прозвищу Infinality с целью создания TrueType
 *   шрифты представлены лучше, чем в Windows.  Широкие возможности настройки
 *   и гибкость, вплоть до правил для одиночных глифов в шрифтах, но и
 *   очень медленно.  Его экспериментальный и медленный характер и оригинальный
 *   потеря интереса разработчика означала, что эта опция никогда не была включена в
 *   сборки по умолчанию.
 *
 *   Соответствующая версия интерпретатора — v38.
 *
 * Значение 2:
 *   Новый режим по умолчанию для драйвера TrueType.  Код бесконечности
 *   база была урезана до минимума и удалены все возможности настройки.
 *   во имя скорости и простоты.  Конфигурация была в основном
 *   ориентируйтесь на такие шрифты, как «Arial», «Times New Roman» или «Courier».
 *   Устаревшие шрифты — это шрифты, которые изменяют вертикальные основы для достижения чистоты.
 *   черно-белые растровые изображения.  Новый режим ориентирован на применение минимального
 *   набор правил для всех шрифтов без разбора, чтобы современные и веб-
 *   шрифты отображаются хорошо, а устаревшие шрифты отображаются нормально.
 *
 *   Соответствующая версия интерпретатора — v40.
 *
 * Значение 3:
 *   Скомпилируйте обе версии, сделав доступными версии v38 и v40 (последняя является
 *   по умолчанию).
 *
 * Отменив их определение, вы получите результат рендеринга, как в Windows, без
 * ClearType, т.е. е. WindowsXPбез включенного ClearType и Win9x.
 * (версия переводчика v35).  Или нет, смотря сколько намекает крови
 * и проверка разрывов, которые дизайнер шрифтов вложил в данный шрифт.  Если ты
 * определить один или оба параметра подсказки субпикселей, вы можете переключаться между ними
 * между v35 и теми, которые вы установили (используя `FT_Property_Set`).
 *
 * Эта опция требует, чтобы `TT_CONFIG_OPTION_BYTECODE_INTERPRETER` был
 * определен.
 *
 * [1]
 * https://www.microsoft.com/typography/cleartype/truetypecleartype.aspx
 */
/* #define TT_CONFIG_OPTION_SUBPIXEL_HINTING  1         */
#define TT_CONFIG_OPTION_SUBPIXEL_HINTING  2
/* #define TT_CONFIG_OPTION_SUBPIXEL_HINTING  ( 1 | 2 ) */

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_COMPONENT_OFFSET_SCALED` для компиляции
 * Загрузчик глифов TrueType для использования модификации Apple о том, как обрабатывать
 * смещения компонентов в составных глифах.
 *
 * Apple иMSрасходуются во мнениях относительно поведения смещенных компонентов по умолчанию
 * композиты.  Apple говорит, что их следует масштабировать с помощью масштабирования
 * факторы в матрице преобразования (грубо говоря, она более сложная), в то время как
 * MS говорит, что не следует.  OpenType определяет два бита в составе
 * флаги массива, которые можно использовать для ограничения неоднозначности, но старые шрифты не будут
 * они есть.
 *
 *   https://www.microsoft.com/typography/otspec/glyf.htm
 *   https://developer.apple.com/fonts/TrueType-Reference-Manual/RM06/Chap6glyf.html
 */
#undef TT_CONFIG_OPTION_COMPONENT_OFFSET_SCALED

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_GX_VAR_SUPPORT`, если вы хотите включить поддержку.
 * для технологий искажаемых шрифтов Apple («fvar», «gvar», «cvar» и
 * «аварские» таблицы).  С пометкой «Вариации шрифтов» теперь это часть OpenType.
 * также.  Это во многом похоже на поддержку нескольких мастеров типа~1.
 */
#define TT_CONFIG_OPTION_GX_VAR_SUPPORT

/**************************************************************************
 *
 * Определите `TT_CONFIG_OPTION_BDF`, если вы хотите включить поддержку
 * встроенная таблица «BDF ~» в растровых форматах на основе SFNT.
 */
#define TT_CONFIG_OPTION_BDF

/**************************************************************************
 *
 * Опция `TT_CONFIG_OPTION_MAX_RUNNABLE_OPCODES` управляет максимальным
 * количество инструкций байт-кода, выполняемых за один запуск
 * интерпретатор байт-кода, необходимый для предотвращения бесконечных циклов.  Ты не хочешь
 * изменить это, за исключением очень особых ситуаций (например, создание
 * фаззер библиотеки тратит меньше времени на обработку сломанных шрифтов).
 *
 * Не ожидается, что это значение когда-либо будет изменено конфигуратором.
 * сценарий; вместо этого он был окружен `#ifndef ... #endif`, так что
 * значение может быть установлено как опция препроцессора по команде компилятора
 * линия.
 */
#ifndef TT_CONFIG_OPTION_MAX_RUNNABLE_OPCODES
    #define TT_CONFIG_OPTION_MAX_RUNNABLE_OPCODES  1000000L
#endif

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/****      T Y P E 1   D R I V E R    C O N F I G U R A T I O N       ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/**************************************************************************
 *
 * `T1_MAX_DICT_DEPTH` — максимальная глубина вложения словарей и массивов.
 * в потоке Тип~1 (см.`t1load.c`).  Требуется минимум ~4.
 */
#define T1_MAX_DICT_DEPTH  5

/**************************************************************************
 *
 * `T1_MAX_SUBRS_CALLS` подробно описывает максимальное количество вложенных подпрограмм.
 * вызовы во время загрузки глифа.
 */
#define T1_MAX_SUBRS_CALLS  16

/**************************************************************************
 *
 * `T1_MAX_CHARSTRING_OPERANDS` — емкость стека символьных строк.  А
 * требуется минимум ~16.
 *
 * Китайский шрифт MingTiEG-Medium (охватывающий символCNS11643).
 * комплект) необходимо 256.
 */
#define T1_MAX_CHARSTRINGS_OPERANDS  256

/**************************************************************************
 *
 * Определите этот макрос конфигурации, если вы хотите предотвратить компиляцию
 * модуль 't1afm', который отвечает за чтение файловAFMType~1
 * в существующее лицо.  Обратите внимание, что если он установлен, драйвер типа ~1 будет
 * неспособен определить кернинговые расстояния.
 */
#undef T1_CONFIG_OPTION_NO_AFM

/**************************************************************************
 *
 * Определите этот макрос конфигурации, если вы хотите предотвратить компиляцию
 * поддержка шрифтов Multiple Masters в драйвере Тип ~1.
 */
#undef T1_CONFIG_OPTION_NO_MM_SUPPORT

/**************************************************************************
 *
 * `T1_CONFIG_OPTION_OLD_ENGINE` будет контролировать предварительный Adobe Type~1
 * Движок компилируется во FreeType.  Если определено, то можно
 * переключаться между двумя движками, используя свойство `hinting-engine`
 * модуль драйвера type1.
 */
/* #define T1_CONFIG_OPTION_OLD_ENGINE */

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/****         C F F   D R I V E R    C O N F I G U R A T I O N        ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/**************************************************************************
 *
 * Используя `CFF_CONFIG_OPTION_DARKENING_PARAMETER_{X,Y}{1,2,3,4}`, это
 * можно установить значения по умолчанию для четырех контрольных точек, которые
 * определить поведение затемнения штока (нового) двигателя CFF.  Для более
 * подробности, пожалуйста, прочитайте документацию `darkening-parameters`
 * свойство (файл`ftdriver.h`), которое позволяет управлять во время выполнения.
 *
 * **Не** отменяйте определение этих макросов!
 */
#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_X1   500
#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y1   400

#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_X2  1000
#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y2   275

#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_X3  1667
#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y3   275

#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_X4  2333
#define CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y4     0

/**************************************************************************
 *
 * `CFF_CONFIG_OPTION_OLD_ENGINE` контроль, будет ли движение в Adobe CFF
 * компилируется во FreeType.  Если определено, можно переключить
 * между двумя движениями с использованием свойств`hinting-engine`файла cff.
 * драйверный модуль.
 */
/* #define CFF_CONFIG_OPTION_OLD_ENGINE */

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/****         P C F   D R I V E R    C O N F I G U R A T I O N        ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/**************************************************************************
 *
 * Существует множество шрифтов PCF, называемых «Исправленными», которые выглядят совершенно
 * разные и не имеющие ничего общего друг с другом.  При выборе
 * «Управлено» вKDEили Gnome: результаты единичны довольно случайными.
 * стиль часто меняется, если изменить размер и невозможно выбрать некоторые
 * шрифты вообще.  Эта опция позволяет сделать модуль «pcf» аккумулятором литейного завода.
 * имя (плюс пробел) к фамилии.
 *
 * Мы также проверяем, есть ли у нас «широкие» символы; все вместе мы
 * получить семейные имена, такие как «SonyFixed» или «MiscFixedWide».
 *
 * Если эта опция активирована, ею можно управлять с помощью
 * Свойство`no-long-family-names`модуля драйвера «pcf».
 */
/* #define PCF_CONFIG_OPTION_LONG_FAMILY_NAMES */

/*************************************************************************/
/*************************************************************************/
/****                                                                 ****/
/****    A U T O F I T   M O D U L E    C O N F I G U R A T I O N     ****/
/****                                                                 ****/
/*************************************************************************/
/*************************************************************************/

/**************************************************************************
 *
 * Скомпилируйте модуль autofit со скриптомCJK(китайский, японский, корейский).
 * поддержка.
 */
#define AF_CONFIG_OPTION_CJK

/**************************************************************************
 *
 * Скомпилировать модуль «autofit» с поддержкой резервного индийского кабеля, охватывающий
 * Скрипты, которые не поддерживают «латинский» подмодуль модуля «autofit».
 * (пока) ручка.  В настоящее время для этого требуется опция `AF_CONFIG_OPTION_CJK`.
 */
#ifdef AF_CONFIG_OPTION_CJK
    #define AF_CONFIG_OPTION_INDIC
#endif

/**************************************************************************
 *
 * Используйте метрики размера, аналогичные TrueType, для «легких» автоматических подсказок.
 *
 * Настоятельно рекомендуется избегать этой опции, которая существует только для
 * помочь некоторым устаревшим приложениям сохранить свой внешний вид и поведение с
 * уважение к шрифтам TrueType с автоматической подсказкой.
 *
 * Сама причина, по которой эта опция вообще существует, — это дистрибутивыGNU/Linux.
 * Fedora, например, которая не изменила следующее изменение (которое было
 * присутствует во FreeType между версиями 2.4.6 и 2.7.1 включительно).
 *
 * ```
 *   16 июля 2011 г. Стивен Чу <steven.f.chu@gmail.com>
 *
 *     [truetype] Исправлены метрики при запросе размера масштабируемых шрифтов.
 * ```
 *
 * Этот проблемный коммит теперь отменен (более или менее).
 */
/* #define AF_CONFIG_OPTION_TT_SIZE_METRICS */

/* */

/*
 * Этот макрос устарел.  Поддержка удалена в версии FreeType.
 * 2.5.
 */
/* #define FT_CONFIG_OPTION_OLD_INTERNALS */

/*
 * Следующие три макроса являются искусственными, если используется встроенная хинтинг TrueType.
 * требуемых определениями выше.  Не меняйте это.
 */
#ifdef TT_CONFIG_OPTION_BYTECODE_INTERPRETER
    #define  TT_USE_BYTECODE_INTERPRETER

    #ifdef TT_CONFIG_OPTION_SUBPIXEL_HINTING
        #if TT_CONFIG_OPTION_SUBPIXEL_HINTING & 1
            #define  TT_SUPPORT_SUBPIXEL_HINTING_INFINALITY
        #endif

        #if TT_CONFIG_OPTION_SUBPIXEL_HINTING & 2
            #define  TT_SUPPORT_SUBPIXEL_HINTING_MINIMAL
        #endif
    #endif
#endif

/*
 * Макрос TT_SUPPORT_COLRV1 определен, чтобы указать клиентам, что это
 * Версия FreeType поддерживает «COLR» v1 API.  Это определение
 * полезно для клиентов FreeType, которые хотят реализовать поддержку «COLR» v1.
 * в зависимости от предварительной проверки до его официального выпуска в
 * FreeType, и хотя эта функция пока не может быть протестирована с использованием
 * версии макросов.  Не меняйте этот макрос.  Это можно будет удалить, как только
 * Эта функция присутствует в релизной версии FreeType, и можно использовать макросы версии.
 * для проверки доступности.
 */
#ifdef TT_CONFIG_OPTION_COLOR_LAYERS
    #define  TT_SUPPORT_COLRV1
#endif

/*
 * Проверьте параметры затемнения CFF.  Проверки такие же, как и в функции
 * `cff_property_set` в файле`cffdrivr.c`.
 */
#if CFF_CONFIG_OPTION_DARKENING_PARAMETER_X1 < 0   || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X2 < 0   || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X3 < 0   || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X4 < 0   || \
    \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y1 < 0   || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y2 < 0   || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y3 < 0   || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y4 < 0   || \
    \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X1 >        \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X2     || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X2 >        \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X3     || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X3 >        \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_X4     || \
    \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y1 > 500 || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y2 > 500 || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y3 > 500 || \
    CFF_CONFIG_OPTION_DARKENING_PARAMETER_Y4 > 500
    #error "Invalid CFF darkening parameters!"
#endif

FT_END_HEADER

#endif /* FTOPTION_H_ */

/* END */
