/**
 * @file lv_cache.h
 *
 */

#ifndef LV_CACHE_H
#define LV_CACHE_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/

#include "../lv_types.h"

#include "lv_cache_entry.h"

#include "class/lv_cache_class.h"
#include "instance/lv_cache_instance.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Создайте объект кэша с заданными параметрами.
 * @param cache_class   Класс кэша. В настоящее время поддерживаются только два встроенных класса:
 *                        - lv_cache_class_lru_rb_count для кэша на основеLRUс политикой вытеснения на основе подсчета.
 *                        - lv_cache_class_lru_rb_size для кеша на основеLRUс политикой вытеснения на основе размера.
 * @param node_size     Размер узла — это размер данных, хранящихся в кеше.
 * @param max_size      Максимальный размер — это максимальный объем памяти или счетчик, который может хранить кэш.
 *                        - lv_cache_class_lru_rb_count:max_size— максимальное количество узлов в кэше.
 *                        - lv_cache_class_lru_rb_size:max_size— максимальный размер кэша в байтах.
 * @param ops           Набор операций, которые можно выполнять с кэшем. Подробности см. в lv_cache_ops_t.
 * @return              Возвращает указатель на созданный объект кэша в случае успеха,`NULL`в случае ошибки.
 */
lv_cache_t * lv_cache_create(const lv_cache_class_t * cache_class,
                             size_t node_size, size_t max_size,
                             lv_cache_ops_t ops);

/**
 * Уничтожить объект кэша.
 * @param cache         Указатель объекта кэша, который необходимо уничтожить.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 */
void lv_cache_destroy(lv_cache_t * cache, void * user_data);

/**
 * Получите запись кэша с заданным ключом. Если записи нет в кеше, возвращается `NULL` (не найден).
 * Если запись найдена, ее приоритет будет изменен политической кэша. И`lv_cache_entry_t::ref_cnt`будет увеличен.
 * @param cache         Указатель объекта кэша для получения записи.
 * @param key           Ключ входа для получения.
 * @param user_data     Указатель пользовательских данных, который будет передан в обратный вызов создания.
 * @return              Возвращает указатель на полученную запись кэша в случае успеха с увеличением`lv_cache_entry_t::ref_cnt`и`NULL`в случае ошибки.
 */
lv_cache_entry_t * lv_cache_acquire(lv_cache_t * cache, const void * key, void * user_data);

/**
 * Получите запись кэша с заданным ключом. Если записи нет в кеше, будет создана новая запись с заданным ключом.
 * Если запись найдена, ее приоритет будет изменен политической кэша. И`lv_cache_entry_t::ref_cnt`будет увеличен.
 * Если вы хотите использоватьAPIдля упрощения кода, вам следует принять`lv_cache_ops_t::create_cb`, который создает новую запись с ключом данных.
 * ЭтотAPIпредставляет собой сочетание lv_cache_acquire() и lv_cache_add(). Эффект тот же, что и при вызове lv_cache_acquire() и lv_cache_add() по отдельности.
 * И внутреннее воздействие на кеш также соответствует этим двум API.
 * @param cache         Указатель объекта кэша для получения записи.
 * @param key           Ключ записи, которую необходимо получить или создать.
 * @param user_data     Указатель пользовательских данных, который будет передан в обратный вызов создания.
 * @return              Возвращает указатель на полученную или созданную запись кэша в случае успеха с увеличением`lv_cache_entry_t::ref_cnt`и`NULL`в случае ошибки.
 */
lv_cache_entry_t * lv_cache_acquire_or_create(lv_cache_t * cache, const void * key, void * user_data);

/**
 * Добавьте новую запись в кэш с указанным ключом и данными. Если кеш заполнен, для удаления записи будет использоваться политика кеша.
 * @param cache         Указатель объекта кэша для добавления записи.
 * @param key           Ключ добавляемой записи.
 * @param user_data     Указатель пользовательских данных, который будет передан в обратный вызов создания.
 * @return              Возвращает указатель на добавленную запись кэша в случае успеха с увеличением`lv_cache_entry_t::ref_cnt`и`NULL`в случае ошибки.
 */
lv_cache_entry_t * lv_cache_add(lv_cache_t * cache, const void * key, void * user_data);

/**
 * Освободите запись кэша. `lv_cache_entry_t::ref_cnt`будет уменьшен. Если`lv_cache_entry_t::ref_cnt`появится, произойдет ошибка.
 * Если запись, переданная в эту функцию, является последней ссылкой на данные и запись помечена как недействительная, для удаления записи будет использоваться политика кэша.
 * @param cache         Указатель объекта кэша для освобождения записи.
 * @param entry         Указатель записи кэша, который необходимо освободить.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 */
void lv_cache_release(lv_cache_t * cache, lv_cache_entry_t * entry, void * user_data);

/**
 * Зарезервируйте определенный объем памяти/счета в кеше. Эта функция полезна, когда вы хотите заранее зарезервировать определенный объем памяти/счета.
 * например, когда вы знаете, что он понадобится вам позже.
 * Если текущий размер кэша превышает зарезервированный размер, функция будет удалять записи до тех пор, пока не будет достигнут зарезервированный размер.
 * @param cache         Указатель объекта кэша, который нужно зарезервировать.
 * @param reserved_size Объем памяти/счета для резервирования.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 */
void lv_cache_reserve(lv_cache_t * cache, uint32_t reserved_size, void * user_data);

/**
 * Удалить запись кэша с заданным ключом. Если записи нет в кеше, с ней ничего не произойдет.
 * Если запись найдена, она будет удалена из кэша, а ее данные будут освобождены при освобождении последней ссылки на нее.
 * @note Данные будут освобождены не сразу, а после освобождения последней ссылки на них. Но эта запись не будет найдена lv_cache_acquire().
 *       Если вы хотите снова кэшировать тот же ключ, вам следует использоватьlv_cache_add() илиlv_cache_acquire_or_create().
 * @param cache         Указатель объекта кэша для удаления записи.
 * @param key           Ключ записи, которую нужно удалить.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 */
void lv_cache_drop(lv_cache_t * cache, const void * key, void * user_data);

/**
 * Удалите все записи кэша. Все записи будут удалены из кэша, а их данные будут освобождены, когда будет выпущена последняя ссылка на них.
 * @note Если на некоторые записи по-прежнему ссылаются другие объекты, произойдет ошибка. И такого случая не должно происходить в обычных случаях..
 * @param cache         Указатель объекта кэша для удаления всех записей.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 */
void lv_cache_drop_all(lv_cache_t * cache, void * user_data);

/**
 * Удалить одну запись из кеша. Политика выселения будет использоваться для выбора записи для выселения.
 * @param cache         Указатель объекта кэша для удаления записи.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 * @return              Возвращает true, если запись удалена, и false, если ни одна запись не удалена.
 */
bool lv_cache_evict_one(lv_cache_t * cache, void * user_data);

/**
 * Установите максимальный размер кэша.
 * Если текущий размер кэша превышает новый максимальный размер, политика кэша будет использоваться для удаления записей до тех пор, пока не будет достигнут новый максимальный размер.
 * Если установлено значение 0, кэш будет отключен.
 * @note Но такое поведение произойдет только тогда, когда в кеш будут добавлены новые записи.
 * @param cache         Указатель объекта кэша для установки максимального размера.
 * @param max_size      Новый максимальный размер кэша.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 */
void   lv_cache_set_max_size(lv_cache_t * cache, size_t max_size, void * user_data);

/**
 * Получите максимальный размер кэша.
 * @param cache         Указатель объекта кэша для получения максимального размера.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 * @return              Возвращает максимальный размер кэша.
 */
size_t lv_cache_get_max_size(lv_cache_t * cache, void * user_data);

/**
 * Получить текущий размер кэша.
 * @param cache         Указатель объекта кэша для получения текущего размера.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 * @return              Возвращает текущий размер кэша.
 */
size_t lv_cache_get_size(lv_cache_t * cache, void * user_data);

/**
 * Получите свободный размер кэша.
 * @param cache         Указатель объекта кэша для получения свободного размера.
 * @param user_data     Указатель пользовательских данных, который будет передан в бесплатный обратный вызов.
 * @return              Возвращает свободный размер кэша.
 */
size_t lv_cache_get_free_size(lv_cache_t * cache, void * user_data);

/**
 * Верните верно, если кэш включен.
 * Отключенный кеш означает, что кешаmax_sizeравен 0. В этом случае все операции с кешем будут простаивать.
 * @param cache         Указатель объекта кэша, чтобы проверить, отключен ли он.
 * @return              Возвращает true, если кэш включен, в противном случае — false.
 */
bool lv_cache_is_enabled(lv_cache_t * cache);

/**
 * Установите обратный вызов сравнения кеша.
 * @param cache         Указатель объекта кэша для установки обратного вызова сравнения.
 * @param compare_cb    Обратный вызов сравнения для установки.
 * @param user_data     Указатель пользовательских данных.
 */
void   lv_cache_set_compare_cb(lv_cache_t * cache, lv_cache_compare_cb_t compare_cb, void * user_data);

/**
 * Установите обратный вызов создания кеша.
 * @param cache         Указатель объекта кэша для установки обратного вызова создания.
 * @param alloc_cb      Обратный вызов создания для установки.
 * @param user_data     Указатель пользовательских данных.
 */
void   lv_cache_set_create_cb(lv_cache_t * cache, lv_cache_create_cb_t alloc_cb, void * user_data);

/**
 * Установите бесплатный обратный вызов кеша.
 * @param cache         Указатель объекта кэша для установки бесплатного обратного вызова.
 * @param free_cb       Бесплатный обратный вызов для установки.
 * @param user_data     Указатель пользовательских данных.
 */
void   lv_cache_set_free_cb(lv_cache_t * cache, lv_cache_free_cb_t free_cb, void * user_data);

/**
 * Дайте имя объекту кэша. Сохраняется только указатель строки.
 * @param cache         Указатель объекта кэша для установки имени.
 * @param name          Имя кэша.
 */
void lv_cache_set_name(lv_cache_t * cache, const char * name);

/**
 * Получите имя объекта кэша.
 * @param cache         Указатель объекта кэша для получения имени.
 * @return              Возвращает имя кэша.
 */
const char * lv_cache_get_name(lv_cache_t * cache);

/**
 * Создайте итератор для объекта кэша. Итератор используется для перебора всех записей кэша.
 * @param cache         Указатель объекта кэша для создания итератора.
 * @return              Возвращает указатель на созданный итератор в случае успеха и`NULL`в случае ошибки.
 */
lv_iter_t * lv_cache_iter_create(lv_cache_t * cache);

/*************************
 *    GLOBAL VARIABLES
 *************************/

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /* LV_CACHE_H */
