/**
 * @file lv_test_indev.h
 *
 */

#ifndef LV_TEST_INDEV_H
#define LV_TEST_INDEV_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../../lv_conf_internal.h"
#if LV_USE_TEST

#include "../../misc/lv_types.h"
#include "../../indev/lv_indev.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Создайте мышь (указатель), клавиатуру и кодировщик.
 * Ими можно управлять с помощью вызовов функций во время теста.
 */
void lv_test_indev_create_all(void);

/**
 * Удалить все тестовые устройства ввода
 */
void lv_test_indev_delete_all(void);

/**
 * Получите один из разработчиков, созданных в `lv_test_indev_create_all`.
 * @param type  type of the indev to get
 * @return      the indev
 */
lv_indev_t * lv_test_indev_get_indev(lv_indev_type_t type);

/**
 * Переместите мышь в заданные координаты.
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 * @param x     the target absolute X coordinate
 * @param y     the target absolute Y coordinate
 */
void lv_test_mouse_move_to(int32_t x, int32_t y);

/**
 * Переместите указатель мыши в центр виджета
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 * @param obj   pointer to an widget
 */
void lv_test_mouse_move_to_obj(lv_obj_t * obj);

/**
 * Переместите курсор мыши. Сохраняйте нажатое или отпущенное состояние
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 * @param x     the difference in X to move
 * @param y     the difference in Y to move
 */
void lv_test_mouse_move_by(int32_t x, int32_t y);

/**
 *  Зажмите кнопку мыши.
 *  Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 */
void lv_test_mouse_press(void);

/**
 *  Отпустите кнопку мыши.
 *  Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 */
void lv_test_mouse_release(void);

/**
 * Эмулировать щелчок по заданной точке.
 * Сначала установите отпущенное состояние, подождите немного, нажмите, подождите и снова отпустите.
 * Время ожидания составляет 50 мс.
 * Внутренне вызывается `lv_timer_handler`, что означает, что все события будут запускаться внутри этой функции.
 * @param x     the target absolute X coordinate
 * @param y     the target absolute Y coordinate
 */
void lv_test_mouse_click_at(int32_t x, int32_t y);

/**
 * Эмулировать нажатие клавиши.
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 * @param k     the key to press
 */
void lv_test_key_press(uint32_t k);

/**
 * Отпустите ранее нажатую кнопку.
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 * @param k     the key to press
 */
void lv_test_key_release(void);

/**
 * Эмулируйте нажатие клавиши.
 * Сначала установите отпущенное состояние, подождите немного, нажмите, подождите и снова отпустите.
 * Время ожидания составляет 50 мс.
 * Внутренне вызывается `lv_timer_handler`, что означает, что все события будут запускаться внутри этой функции.
 * @param k     the key to hit
 */
void lv_test_key_hit(uint32_t k);


/**
 * Эмулировать вращение энкодера, использовать положительный параметр для вращения вправо
 * и отрицательный для поворота влево.
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 * @param d     number of encoder ticks to emulate
 */
void lv_test_encoder_add_diff(int32_t d);

/**
 * Эмуляция энкодера включает ожидание 50 мс. Используйте положительный параметр для поворота вправо
 * и отрицательный для поворота влево.
 * Внутренне вызывается `lv_timer_handler`, что означает, что все события будут запускаться внутри этой функции.
 * @param d     number of encoder ticks to emulate
 */
void lv_test_encoder_turn(int32_t d);

/**
 * Эмулировать печать энкодера.
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 */
void lv_test_encoder_press(void);

/**
 * Эмулировать выпуск кодировщика.
 * Эта функция не ждет, а просто меняет состояние и немедленно возвращает результат.
 */
void lv_test_encoder_release(void);

/**
 * Эмулировать щелчок кодировщика.
 * Сначала установите отпущенное состояние, подождите немного, нажмите, подождите и снова отпустите.
 * Время ожидания составляет 50 мс.
 * Внутренне вызывается `lv_timer_handler`, что означает, что все события будут запускаться внутри этой функции.
 */
void lv_test_encoder_click(void);

/**********************
 *      MACROS
 **********************/

#endif /*LV_USE_TEST*/

#ifdef __cplusplus
} /*внешний "С"*/
#endif

#endif /*LV_TEST_INDEV_H*/




