/**
 * @file lv_group_private.h
 *
 */

#ifndef LV_GROUP_PRIVATE_H
#define LV_GROUP_PRIVATE_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../misc/lv_ext_data.h"
#include "lv_group.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**
 * Группы можно использовать для логического хранения объектов, чтобы их можно было сфокусировать индивидуально.
 * Они не предназначены для размещения объектов на экране (для этого используйте макеты).
 */
struct _lv_group_t {
#if LV_USE_EXT_DATA
    lv_ext_data_t ext_data;
#endif
    lv_ll_t obj_ll;        /**< Связный список объектов группы*/
    lv_obj_t ** obj_focus; /**< Объект в фокусе*/

    lv_group_focus_cb_t focus_cb;              /**< Функция, вызываемая при получении фокуса новым объектом (необязательно)*/
    lv_group_edge_cb_t  edge_cb;               /**< Функция, вызываемая при достижении края группы, когда в этом
                                                    направлении больше нет объектов для фокуса (например, чтобы
                                                    воспроизвести звук или показать отскок прокрутки) */

    void * user_data;

    uint8_t frozen : 1;         /**< 1: нельзя перевести фокус на новый объект*/
    uint8_t editing : 1;        /**< 1: режим редактирования, 0: режим навигации*/
    uint8_t refocus_policy : 1; /**< 1: после удаления сфокусированного объекта фокус переходит на предыдущий;
                                   0: после удаления сфокусированного объекта фокус переходит на следующий.*/
    uint8_t wrap : 1;           /**< 1: переход к следующему/предыдущему объекту может циклически переноситься
                                   в конец/начало списка; 0: переход останавливается на краю списка.*/
};


/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Инициализировать групповой модуль
 * @remarks Внутренняя функция, не вызывайте ее напрямую.
 */
void lv_group_init(void);

/**
 * Деинициализировать модуль групп
 * @remarks Внутренняя функция, не вызывайте ее напрямую.
 */
void lv_group_deinit(void);

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /*LV_GROUP_PRIVATE_H*/
