/**
 * @file lv_obj_tree.h
 *
 */

#ifndef LV_OBJ_TREE_H
#define LV_OBJ_TREE_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../misc/lv_types.h"
#include "../misc/lv_anim.h"
#include "../display/lv_display.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

typedef enum {
    LV_OBJ_TREE_WALK_NEXT,
    LV_OBJ_TREE_WALK_SKIP_CHILDREN,
    LV_OBJ_TREE_WALK_END,
} lv_obj_tree_walk_res_t;

typedef lv_obj_tree_walk_res_t (*lv_obj_tree_walk_cb_t)(lv_obj_t *, void *);

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Удалить объект и все его дочерние элементы.
 * Также удалите объекты из их группы и удалите всю анимацию (если есть).
 * Отправьте `LV_EVENT_DELETE` удаленным объектам.
 * @param obj       указатель на объект
 */
void lv_obj_delete(lv_obj_t * obj);

/**
 * Удалить всех дочерних элементов объекта.
 * Также удалите объекты из их группы и удалите всю анимацию (если есть).
 * Отправьте `LV_EVENT_DELETE` удаленным объектам.
 * @param obj       указатель на объект
 */
void lv_obj_clean(lv_obj_t * obj);

/**
 * Удалить объект после некоторой задержки
 * @param obj       указатель на объект
 * @param delay_ms  время ожидания перед удалением в миллисекундах
 */
void lv_obj_delete_delayed(lv_obj_t * obj, uint32_t delay_ms);

/**
 * Функция, которую можно легко использовать в обратном вызове готовности анимации для удаления объекта, когда анимация готова.
 * @param a         указатель на анимацию
 */
void lv_obj_delete_anim_completed_cb(lv_anim_t * a);

/**
 * Вспомогательная функция для асинхронного удаления объектов.
 * Полезно в случаях, когда вы не можете удалить объект непосредственно в обработчике `LV_EVENT_DELETE` (т. е. родительском).
 * @param obj       объект для удаления
 * @see lv_async_call
 */
void lv_obj_delete_async(lv_obj_t * obj);

/**
 * Переместить родителя объекта. Относительные координаты будут сохранены.
 *
 * @param obj       указатель на объект, родительский элемент которого необходимо изменить
 * @param parent указатель на нового родителя
 */
void lv_obj_set_parent(lv_obj_t * obj, lv_obj_t * parent);

/**
 * Поменяйте местами два объекта.
 * При использовании в списках его можно использовать для сортировки элементов списка.
 * @param obj1  указатель на первый объект
 * @param obj2  указатель на второй объект
 */
void lv_obj_swap(lv_obj_t * obj1, lv_obj_t * obj2);

/**
 * перемещает объект по заданному индексу в его родителе.
 * При использовании в списках его можно использовать для сортировки элементов списка.
 * @param obj  указатель на объект, который нужно переместить.
 * @param index  новый индекс в родительском файле. -1, чтобы считать сзади
 * @note чтобы перейти на задний план:lv_obj_move_to_index(obj, 0)
 * @note для перемещения вперед (вверх):lv_obj_move_to_index(obj,lv_obj_get_index(obj) - 1)
 */
void lv_obj_move_to_index(lv_obj_t * obj, int32_t index);

/**
 * Получить экран объекта
 * @param obj       указатель на объект
 * @return          указатель на экран объекта
 */
lv_obj_t * lv_obj_get_screen(const lv_obj_t * obj);

/**
 * Получить отображение объекта
 * @param obj       указатель на объект
 * @return          указатель на отображение объекта
 */
lv_display_t * lv_obj_get_display(const lv_obj_t * obj);

/**
 * Получить родителя объекта
 * @param obj       указатель на объект
 * @return          родитель объекта. ( NULL, если`obj`был экраном)
 */
lv_obj_t * lv_obj_get_parent(const lv_obj_t * obj);

/**
 * Получите дочерний объект по индексу дочернего объекта.
 * @param obj       указатель на объект, дочерний элемент которого должен быть получен
 * @param idx       индекс ребенка.
 *                  0: самый старший (первый созданный) ребенок
 *                  1: второй по возрасту
 *                  количество детей-1: самый младший
 *                  -1: самый младший
 *                  -2: второй младший
 * @return          указатель на дочерний элемент или NULL, если индекс недействителен
 */
lv_obj_t * lv_obj_get_child(const lv_obj_t * obj, int32_t idx);

/**
 * Получите дочерний объект по индексу дочернего объекта. Рассмотрим детей только с данным типом.
 * @param obj       указатель на объект, дочерний элемент которого должен быть получен
 * @param idx       индекс ребенка.
 *                  0: самый старший (первый созданный) ребенок
 *                  1: второй по возрасту
 *                  количество детей-1: самый младший
 *                  -1: самый младший
 *                  -2: второй младший
 * @param class_p   тип детей, которых нужно проверить
 * @return          указатель на дочерний элемент или NULL, если индекс недействителен
 */
lv_obj_t * lv_obj_get_child_by_type(const lv_obj_t * obj, int32_t idx,
                                    const lv_obj_class_t * class_p);

/**
 * Вернуть родственного объекта
 * @param obj       указатель на объект, чей брат должен быть получен
 * @param idx       0: сам `obj`
 *                  -1: первый старший брат
 *                  -2: следующий старший брат
 *                  1: первый младший брат
 *                  2: следующий младший брат
 *                  и т. д.
 * @return          указатель на запрошенного брата или NULL, если такого брата нет
 */
lv_obj_t * lv_obj_get_sibling(const lv_obj_t * obj, int32_t idx);

/**
 * Вернуть родственного объекта. Рассмотрим братьев и сестер только данного типа.
 * @param obj       указатель на объект, чей брат должен быть получен
 * @param idx       0: сам `obj`
 *                  -1: первый старший брат
 *                  -2: следующий старший брат
 *                  1: первый младший брат
 *                  2: следующий младший брат
 *                  и т. д.
 * @param class_p   тип детей, которых нужно проверить
 * @return          указатель на запрошенного брата или NULL, если такого брата нет
 */
lv_obj_t * lv_obj_get_sibling_by_type(const lv_obj_t * obj, int32_t idx,
                                      const lv_obj_class_t * class_p);

/**
 * Получить количество детей
 * @param obj       указатель на объект
 * @return          количество детей
 */
uint32_t lv_obj_get_child_count(const lv_obj_t * obj);

/**
 * Получите количество детей, имеющих данный тип.
 * @param obj       указатель на объект
 * @param class_p   тип детей, которых нужно проверить
 * @return          количество детей
 */

uint32_t lv_obj_get_child_count_by_type(const lv_obj_t * obj, const lv_obj_class_t * class_p);

#if LV_USE_OBJ_NAME

/**
 * Задайте имя виджету. Имя будет выделено и освобождено, когда
 * виджет удален или задано новое имя.
 * @param obj       указатель на объект
 * @param name      имя, которое нужно установить. Если установлено значение `NULL`, по умолчанию используется «<widget_type>_#».
 *                  будет использоваться имя.
 * @note Если имя заканчивается на `#`, старшие братья и сестры с таким же именем
 * будет учитываться, а `#` будет заменен индексом
 * данный виджет. Например, создание нескольких виджетов с именем
 * «mybtn_#» связана с разрешенными именами, например «mybtn_0», «mybtn_1»,
 * «mybtn_2» и т. д. д. Имя разрешено, когда `lv_obj_get_name_resolved`
 * вызывается, поэтому результат отражает существующие в данный момент виджеты по адресу
 * в тот раз.
 */
void lv_obj_set_name(lv_obj_t * obj, const char * name);

/**
 * Задайте имя виджету. Сохранится только указатель.
 * @param obj       указатель на объект
 * @param name      имя, которое нужно установить. Если установлено значение `NULL`, по умолчанию используется «<widget_type>_#».
 *                  будет использоваться имя.
 * @note Если имя заканчивается на `#`, старшие братья и сестры с таким же именем
 * будет учитываться, а `#` будет заменен индексом
 * данный виджет. Например, создание нескольких виджетов с именем
 * «mybtn_#» связана с разрешенными именами, например «mybtn_0», «mybtn_1»,
 * «mybtn_2» и т. д. д. Имя разрешено, когда `lv_obj_get_name_resolved`
 * вызывается, поэтому результат отражает существующие в данный момент виджеты по адресу
 * в тот раз.
 */
void lv_obj_set_name_static(lv_obj_t * obj, const char * name);

/**
 * Получите имя набора в том виде, в каком оно было установлено.
 * @param obj       указатель на объект
 * @return          получите имя набора или NULL, если оно еще не установлено
 */
const char * lv_obj_get_name(const lv_obj_t * obj);

/**
 * Получите имя набора или создайте имя автоматически.
 * @param obj       указатель на объект
 * @param buf       буфер для хранения имени
 * @param buf_size  размер буфера в байтах
 * @note Если имя заканчивается на `#`, старшие братья и сестры с таким же именем
 * будет учитываться, а `#` будет заменен индексом
 * данный виджет. Например, создание нескольких виджетов с именем
 * «mybtn_#» связана с разрешенными именами, например «mybtn_0», «mybtn_1»,
 * «mybtn_2» и т. д. д. Имя разрешено, когда `lv_obj_get_name_resolved`
 * вызывается, поэтому результат отражает существующие в данный момент виджеты по адресу
 * в тот раз.
 */
void lv_obj_get_name_resolved(const lv_obj_t * obj, char buf[], size_t buf_size);

/**
 * Найдите ребенка с заданным именем у родителя. Этот ребенок не обязательно должен быть
 * прямой ребенок родителя. Сначала будут проверены прямые дочерние элементы родителя,
 * и прямые дочерние элементы первого дочернего элемента и т. д. (поиск в ширину).
 *
 * Если имя виджета не было установлено, будет указано имя типа «lv_button_1».
 * быть создан для него с помощью `lv_obj_get_name_resolved`.
 *
 * @param parent        виджет, с которого должен начаться поиск
 * @return              найденный виджет или NULL, если не найден.
 */
lv_obj_t * lv_obj_find_by_name(const lv_obj_t * parent, const char * name);

/**
 * Получить объект по имени. Имя также может быть путем, например
 * «main_container /lv_button_1/метка».
 * В этом случае первая часть пути имени должна быть прямым дочерним элементом родительского элемента.
 * вторая часть должна быть прямым дочерним элементом первой и т. д.
 *
 * Если имя виджета не было установлено, будет указано имя типа «lv_button_1».
 * быть создан для него с помощью `lv_obj_get_name_resolved`.
 *
 * @param parent        виджет, с которого должен начаться поиск
 * @return              найденный виджет или NULL, если не найден.
 */
lv_obj_t * lv_obj_get_child_by_name(const lv_obj_t * parent, const char * name_path);

#endif /*LV_USE_OBJ_NAME*/

/**
 * Получите индекс ребенка.
 * @param obj       указатель на объект
 * @return          дочерний индекс объекта.
 *                  например 0: самый старый (первый созданный дочерний элемент).
 *                  (-1, если дочерний элемент не найден или родительский элемент не существует)
 */
int32_t lv_obj_get_index(const lv_obj_t * obj);

/**
 * Получите индекс ребенка. Рассмотрим детей только с данным типом.
 * @param obj       указатель на объект
 * @param class_p   тип детей, которых нужно проверить
 * @return          дочерний индекс объекта.
 *                  например 0: самый старый (первый созданный дочерний элемент данного класса).
 *                  (-1, если дочерний элемент не найден или родительский элемент не существует)
 */
int32_t lv_obj_get_index_by_type(const lv_obj_t * obj, const lv_obj_class_t * class_p);

/**
 * Перебрать всех дочерних элементов любого объекта.
 * @param start_obj     начать интеграцию с этого объекта
 * @param cb            вызовите этот обратный вызов для объектов
 * @param user_data     указатель на любые данные, связанные с пользователем (будет передан`cb`)
 */
void lv_obj_tree_walk(lv_obj_t * start_obj, lv_obj_tree_walk_cb_t cb, void * user_data);

/**
 * Переберите все дочерние элементы любого объекта и выведите их ID.
 * @param start_obj     начать интеграцию с этого объекта
 */
void lv_obj_dump_tree(lv_obj_t * start_obj);

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*внешний "С"*/
#endif

#endif /*LV_OBJ_TREE_H*/
