/**
 * @file lv_obj_pos.h
 *
 */

#ifndef LV_OBJ_POS_H
#define LV_OBJ_POS_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../misc/lv_area.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

typedef enum {
    /** Нет флагов */
    LV_OBJ_POINT_TRANSFORM_FLAG_NONE = 0x00,

    /** Учитывайте также трансформационные свойства родителей. */
    LV_OBJ_POINT_TRANSFORM_FLAG_RECURSIVE = 0x01,

    /** Выполните обратное преобразование (-угол и 1/зум) */
    LV_OBJ_POINT_TRANSFORM_FLAG_INVERSE = 0x02,

    /** И инверсный, и рекурсивный*/
    LV_OBJ_POINT_TRANSFORM_FLAG_INVERSE_RECURSIVE = 0x03,
} lv_obj_point_transform_flag_t;

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * Задайте положение объекта относительно заданного выравнивания.
 * @param obj       указатель на объект
 * @param x         новая координата x
 * @param y         новая координата Y
 * @note            При выравнивании по умолчанию это расстояние от верхнего левого угла.
 * @note            например  ВыравниваниеLV_ALIGN_CENTER— это смещение от центра родительского элемента.
 * @note            Позиция интерпретируется в области содержимого родительского элемента.
 * @note            Значения могут быть установлены в пикселях или процентах от родительского размера с помощью `lv_pct(v)`.
 */
void lv_obj_set_pos(lv_obj_t * obj, int32_t x, int32_t y);

/**
 * Установите координату x объекта
 * @param obj       указатель на объект
 * @param x         новая координата x
 * @note            При выравнивании по умолчанию это расстояние от верхнего левого угла.
 * @note            например  ВыравниваниеLV_ALIGN_CENTER— это смещение от центра родительского элемента.
 * @note            Позиция интерпретируется в области содержимого родительского элемента.
 * @note            Значения могут быть установлены в пикселях или процентах от родительского размера с помощью `lv_pct(v)`.
 */
void lv_obj_set_x(lv_obj_t * obj, int32_t x);

/**
 * Установите координату y объекта
 * @param obj       указатель на объект
 * @param y         новая координата Y
 * @note            При выравнивании по умолчанию это расстояние от верхнего левого угла.
 * @note            например  ВыравниваниеLV_ALIGN_CENTER— это смещение от центра родительского элемента.
 * @note            Позиция интерпретируется в области содержимого родительского элемента.
 * @note            Значения могут быть установлены в пикселях или процентах от родительского размера с помощью `lv_pct(v)`.
 */
void lv_obj_set_y(lv_obj_t * obj, int32_t y);

/**
 * Установите размер объекта.
 * @param obj       указатель на объект
 * @param w         новая ширина
 * @param h         новая высота
 * @note            возможные значения:
 *                  пиксель просто установите размер соответственно
 *                  LV_SIZE_CONTENT задает размер, чтобы задействовать всех дочерних элементов в заданном направлении.
 *                  lv_pct (x), чтобы установить размер в процентах от размера области измерения родительского элемента (размер без отступов).
 *                                      x должен находиться в диапазоне [0..1000]%
 */
void lv_obj_set_size(lv_obj_t * obj, int32_t w, int32_t h);

/**
 * Пересчитать размер объекта
 * @param obj       указатель на объект
 * @return          правда: размер был изменен
 */
bool lv_obj_refr_size(lv_obj_t * obj);

/**
 * Установить ширину объекта
 * @param obj       указатель на объект
 * @param w         новая ширина
 * @note            возможные значения:
 *                  пиксель просто установите размер соответственно
 *                  LV_SIZE_CONTENT задает размер, чтобы задействовать всех дочерних элементов в заданном направлении.
 *                  lv_pct (x), чтобы установить размер в процентах от размера области измерения родительского элемента (размер без отступов).
 *                                      x должен находиться в диапазоне [0..1000]%
 */
void lv_obj_set_width(lv_obj_t * obj, int32_t w);

/**
 * Установить высоту объекта
 * @param obj       указатель на объект
 * @param h         новая высота
 * @note            возможные значения:
 *                  пиксель просто установите размер соответственно
 *                  LV_SIZE_CONTENT задает размер, чтобы задействовать всех дочерних элементов в заданном направлении.
 *                  lv_pct (x), чтобы установить размер в процентах от размера области измерения родительского элемента (размер без отступов).
 *                                      x должен находиться в диапазоне [0..1000]%
 */
void lv_obj_set_height(lv_obj_t * obj, int32_t h);

/**
 * Установите ширину, уменьшенную за счет левого и правого отступа, а также ширину границы.
 * @param obj       указатель на объект
 * @param w         ширина без отступов в пикселях
 */
void lv_obj_set_content_width(lv_obj_t * obj, int32_t w);

/**
 * Установите высоту, уменьшенную верхним и нижним отступом, а также ширину границы.
 * @param obj       указатель на объект
 * @param h         высота без отступов в пикселях
 */
void lv_obj_set_content_height(lv_obj_t * obj, int32_t h);

/**
 * Установить макет объекта
 * @param obj       указатель на объект
 * @param layout    указатель на дескриптор макета для установки
 */
void lv_obj_set_layout(lv_obj_t * obj, uint32_t layout);

/**
 * Проверьте, позиционируется ли объект и по макету или нет.
 * @param obj       указатель на объект для тестирования
 * @return true: позиционируется по макету; false: не позиционируется макетом
 */
bool lv_obj_is_layout_positioned(const lv_obj_t * obj);

/**
 * Отметьте объект для обновления макета.
 * @param obj      указатель на объект, дочерние элементы которого необходимо обновить
 */
void lv_obj_mark_layout_as_dirty(lv_obj_t * obj);

/**
 * Обновите макет объекта.
 * @param obj      указатель на объект, положение и размер которого необходимо обновить
 */
void lv_obj_update_layout(const lv_obj_t * obj);

/**
 * Измените выравнивание объекта.
 * @param obj       указатель на объект для выравнивания
 * @param align     тип выравнивания (см. перечисление «lv_align_t»)`LV_ALIGN_OUT_...`использовать нельзя.
 */
void lv_obj_set_align(lv_obj_t * obj, lv_align_t align);

/**
 * Измените выравнивание объекта и установите новые координаты.
 * Эквивалентно:
 * lv_obj_set_align (объект, выровнять);
 * lv_obj_set_pos (объект,x_ofs,y_ofs);
 * @param obj       указатель на объект для выравнивания
 * @param align     тип выравнивания (см. перечисление «lv_align_t»)`LV_ALIGN_OUT_...`использовать нельзя.
 * @param x_ofs     Смещение координаты x после выравнивания
 * @param y_ofs     смещение координаты y после выравнивания
 */
void lv_obj_align(lv_obj_t * obj, lv_align_t align, int32_t x_ofs, int32_t y_ofs);

/**
 * Совместите объект с другим объектом.
 * @param obj       указатель на объект для выравнивания
 * @param base      указатель на другой объект (если используется родительский элементNULL`obj`). 'obj' будет выровнен по нему.
 * @param align     тип выравнивания (см. перечисление 'lv_align_t')
 * @param x_ofs     Смещение координаты x после выравнивания
 * @param y_ofs     смещение координаты y после выравнивания
 * @note            если положение или размер`base`изменяется,`obj`необходимо снова выровнять вручную
 */
void lv_obj_align_to(lv_obj_t * obj, const lv_obj_t * base, lv_align_t align, int32_t x_ofs,
                     int32_t y_ofs);

/**
 * Выровняйте объект по центру его родителя.
 * @param obj       указатель на объект для выравнивания
 * @note            если родительский размер изменится,`obj`необходимо снова выровнять вручную
 */
void lv_obj_center(lv_obj_t * obj);

/**
 * Установите матрицу преобразования объекта
 * @param obj       указатель на объект
 * @param matrix    указатель на матрицу для установки
 * @note `LV_DRAW_TRANSFORM_USE_MATRIX` необходимо включить.
 */
void lv_obj_set_transform(lv_obj_t * obj, const lv_matrix_t * matrix);

/**
 * Сбросить матрицу преобразования объекта в единичную матрицу
 * @param obj       указатель на объект
 * @note `LV_DRAW_TRANSFORM_USE_MATRIX` необходимо включить.
 */
void lv_obj_reset_transform(lv_obj_t * obj);

/**
 * Копирование координат объекта в область
 * @param obj       указатель на объект
 * @param coords    указатель на область для хранения координат
 */
void lv_obj_get_coords(const lv_obj_t * obj, lv_area_t * coords);

/**
 * Получите координату x объекта.
 * @param obj       указатель на объект
 * @return          расстояние`obj`от левой стороны родительского элемента плюс левое отступ родительского элемента
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @note            Нулевое возвращаемое значение означает, что объект находится на левом отступе от родителя, а не на левом краю.
 * @note            Прокрутка родительского элемента не меняет возвращаемое значение.
 * @note            Возвращаемое значение всегда является расстоянием от родителя, даже если`obj`позиционируется макетом.
 */
int32_t lv_obj_get_x(const lv_obj_t * obj);

/**
 * Получите координату x2 объекта.
 * @param obj       указатель на объект
 * @return          расстояние`obj`от правой стороны родительского элемента плюс правое дополнение родительского элемента
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @note            Нулевое возвращаемое значение означает, что объект находится на правом отступе от родителя, а не на правом краю.
 * @note            Прокрутка родительского элемента не меняет возвращаемое значение.
 * @note            Возвращаемое значение всегда является расстоянием от родителя, даже если`obj`позиционируется макетом.
 */
int32_t lv_obj_get_x2(const lv_obj_t * obj);

/**
 * Получите координату y объекта.
 * @param obj       указатель на объект
 * @return          расстояние`obj`от верхней стороны родительского элемента плюс верхнее отступ родительского элемента
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @note            Нулевое возвращаемое значение означает, что объект находится на верхнем отступе родительского элемента, а не на верхнем крае.
 * @note            Прокрутка родительского элемента не меняет возвращаемое значение.
 * @note            Возвращаемое значение всегда является расстоянием от родителя, даже если`obj`позиционируется макетом.
 */
int32_t lv_obj_get_y(const lv_obj_t * obj);

/**
 * Получите координату y2 объекта.
 * @param obj       указатель на объект
 * @return          расстояние`obj`от нижней стороны родительского элемента плюс нижнее отступ родительского элемента
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @note            Нулевое возвращаемое значение означает, что объект находится на нижнем отступе родительского элемента, а не на нижнем крае.
 * @note            Прокрутка родительского элемента не меняет возвращаемое значение.
 * @note            Возвращаемое значение всегда является расстоянием от родителя, даже если`obj`позиционируется макетом.
 */
int32_t lv_obj_get_y2(const lv_obj_t * obj);

/**
 * Получите фактически установленную координату x объекта, т.е. смещение от заданного выравнивания.
 * @param obj       указатель на объект
 * @return          заданная координата x
 */
int32_t lv_obj_get_x_aligned(const lv_obj_t * obj);

/**
 * Получите фактически установленную координату y объекта, т.е. смещение от заданного выравнивания.
 * @param obj       указатель на объект
 * @return          заданная координата y
 */
int32_t lv_obj_get_y_aligned(const lv_obj_t * obj);

/**
 * Получить ширину объекта
 * @param obj       указатель на объект
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @return          ширина в пикселях
 */
int32_t lv_obj_get_width(const lv_obj_t * obj);

/**
 * Получить высоту объекта
 * @param obj       указатель на объект
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @return          высота в пикселях
 */
int32_t lv_obj_get_height(const lv_obj_t * obj);

/**
 * Получите ширину, уменьшенную на левое и правое отступы и ширину границы.
 * @param obj       указатель на объект
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @return          ширина, которая по-прежнему вписывается в родительский элемент, не вызывая переполнения (что делает родительский элемент прокручиваемым)
 */
int32_t lv_obj_get_content_width(const lv_obj_t * obj);

/**
 * Уменьшите высоту на верхнее и нижнее отступы и ширину границы.
 * @param obj       указатель на объект
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @return          высота, которая по-прежнему вписывается в родительский элемент, не вызывая переполнения (что делает родительский элемент прокручиваемым)
 */
int32_t lv_obj_get_content_height(const lv_obj_t * obj);

/**
 * Получите площадь, уменьшенную за счет отступов и ширины границы.
 * @param obj       указатель на объект
 * @note            Положение объекта пересчитывается только при следующей перерисовке. Принудительный перерасчет координат
 *                  позвоните`lv_obj_update_layout(obj)`.
 * @param area      область, которая по-прежнему вписывается в родительский элемент, не вызывая переполнения (что делает родительский элемент прокручиваемым)
 */
void lv_obj_get_content_coords(const lv_obj_t * obj, lv_area_t * area);

/**
 * Получите ширину, занимаемую «частями» виджета. Например. ширина всех столбцов таблицы.
 * @param obj       указатель на объект
 * @return          ширина виртуально нарисованного контента
 * @note            Этот размер не зависит от реального размера виджета.
 *                  Он просто показывает, насколько велик внутренний («виртуальный») контент.
 */
int32_t lv_obj_get_self_width(const lv_obj_t * obj);

/**
 * Получите высоту, занимаемую «частями» виджета. Например. высота всех строк таблицы.
 * @param obj       указатель на объект
 * @return          ширина виртуально нарисованного контента
 * @note            Этот размер не зависит от реального размера виджета.
 *                  Он просто показывает, насколько велик внутренний («виртуальный») контент.
 */
int32_t lv_obj_get_self_height(const lv_obj_t * obj);

/**
 * Получите ширину стиля, фактически используемую объектом, после ограничения ширины в минимальном и максимальном диапазоне.
 * @param obj       указатель на объект
 * @return          минимальная/максимальная/нормальная ширина, установленная `lv_obj_set_style_<min/max>_width()`
 * @note            Это не расчетный размер, поэтому, если размер был установлен как`LV_SIZE_CONTENT`или `LV_PCT()`
 *                  тогда это значение будет возвращено.
 */
int32_t lv_obj_get_style_clamped_width(lv_obj_t * obj);

/**
 * Получите высоту стиля, фактически используемую объектом, после ограничения высоты в минимальном и максимальном диапазоне.
 * @param obj       указатель на объект
 * @return          минимальная/максимальная/нормальная высота, установленная `lv_obj_set_style_<min/max>_height()`
 * @note            Это не расчетный размер, поэтому, если размер был установлен как`LV_SIZE_CONTENT`или `LV_PCT()`
 *                  тогда это значение будет возвращено.
 */
int32_t lv_obj_get_style_clamped_height(lv_obj_t * obj);

/**
 * @brief Определите, была ли разрешенная ширина объекта ограничена ограничением минимальной ширины.
 *
 * Эта функция сообщает, были ли в последнем расчете макета/размера объект
 * конечную (использованную) ширину пришлось увеличить, чтобы удовлетворить требованиям минимальной ширины.
 *
 * @param obj Указатель на действительный объект.
 * @return true Вычисленная ширина == эффективная минимальная ширина (т. е. она была зафиксирована).
 * @return false Ширина больше минимальной (не ограничена минимальной величиной).
 */
bool lv_obj_is_width_min(lv_obj_t * obj);

/**
 * @brief Определите, была ли разрешенная высота объекта ограничена ограничением минимальной высоты.
 *
 * Эта функция сообщает, были ли в последнем расчете макета/размера объект
 * конечную (использованную) высоту пришлось увеличить, чтобы удовлетворить требования к минимальной высоте.
 *
 * @param obj Указатель на действительный объект.
 * @return true Вычисленная высота == эффективная минимальная высота (т. е. она была зафиксирована).
 * @return false Высота больше минимальной (не ограничена минимальной высотой).
 */
bool lv_obj_is_height_min(lv_obj_t * obj);

/**
 * @brief Определите, была ли разрешенная ширина объекта ограничена ограничением максимальной ширины.
 *
 * Эта функция сообщает, были ли в последнем расчете макета/размера объект
 * конечную (использованную) ширину пришлось увеличить, чтобы удовлетворить требованиям максимальной ширины.
 *
 * @param obj Указатель на действительный объект.
 * @return true Вычисленная ширина == эффективная максимальная ширина (т. е. она была зафиксирована).
 * @return false Ширина меньше максимальной (не ограничена минимальной).
 */
bool lv_obj_is_width_max(lv_obj_t * obj);

/**
 * @brief Определите, была ли разрешенная высота объекта ограничена ограничением максимальной высоты.
 *
 * Эта функция сообщает, были ли в последнем расчете макета/размера объект
 * конечную (использованную) высоту пришлось увеличить, чтобы удовлетворить требования к максимальной высоте.
 *
 * @param obj Указатель на действительный объект.
 * @return true Вычисленная высота == эффективная максимальная высота (т. е. она была зафиксирована).
 * @return false Высота меньше максимальной (не ограничена минимальной).
 */
bool lv_obj_is_height_max(lv_obj_t * obj);

/**
 * Обрабатывается, если размер внутреннего («виртуального») содержимого объекта изменился.
 * @param obj       указатель на объект
 * @return          ложь: ничего не произошло; правда: произошло обновление
 */
bool lv_obj_refresh_self_size(lv_obj_t * obj);

void lv_obj_refr_pos(lv_obj_t * obj);

void lv_obj_move_to(lv_obj_t * obj, int32_t x, int32_t y);

void lv_obj_move_children_by(lv_obj_t * obj, int32_t x_diff, int32_t y_diff, bool ignore_floating);

/**
 * Получить матрицу преобразования объекта
 * @param obj       указатель на объект
 * @return          указатель на матрицу преобразования или NULL, если не установлен
 */
const lv_matrix_t * lv_obj_get_transform(const lv_obj_t * obj);

/**
 * Преобразуйте точку, используя свойства стиля угла и масштабирования объекта.
 * @param obj           указатель на объект, свойства стиля которого следует использовать
 * @param p             точку для преобразования, сюда также будет записан результат
 * @param flags         OR -ed значение :cpp:enum: `lv_obj_point_transform_flag_t`
 */
void lv_obj_transform_point(const lv_obj_t * obj, lv_point_t * p, lv_obj_point_transform_flag_t flags);

/**
 * Преобразуйте массив точек, используя свойства стиля угла и масштабирования объекта.
 * @param obj           указатель на объект, свойства стиля которого следует использовать
 * @param points        массив точек для преобразования, сюда также будет записан результат
 * @param count         количество точек в массиве
 * @param flags         OR -ed значение :cpp:enum: `lv_obj_point_transform_flag_t`
 */
void lv_obj_transform_point_array(const lv_obj_t * obj, lv_point_t points[], size_t count,
                                  lv_obj_point_transform_flag_t flags);

/**
 * Преобразуйте область, используя свойства стиля угла и масштабирования объекта.
 * @param obj           указатель на объект, свойства стиля которого следует использовать
 * @param area          область для преобразования, сюда также будет записан результат
 * @param flags         OR -ed значение :cpp:enum: `lv_obj_point_transform_flag_t`
 */
void lv_obj_get_transformed_area(const lv_obj_t * obj, lv_area_t * area, lv_obj_point_transform_flag_t flags);

/**
 * Пометить область объекта как недействительную.
 * Область будет усечена до площади объекта и помечена для перерисовки.
 * @param obj       указатель на объект
 * @param           area область для перерисовки
 * @return LV_RESULT_OK : область признана недействительной; LV_RESULT_INVALID: область не была признана недействительной.
 *         (возможно, это было за кадром или полностью обрезано)
 */
lv_result_t lv_obj_invalidate_area(const lv_obj_t * obj, const lv_area_t * area);

/**
 * Отметьте объект как недействительный, чтобы перерисовать его область.
 * @param obj       указатель на объект
 * @return LV_RESULT_OK : область признана недействительной; LV_RESULT_INVALID: область не была признана недействительной.
 *         (возможно, это было за кадром или полностью обрезано)
 */
lv_result_t lv_obj_invalidate(const lv_obj_t * obj);

/**
 * Укажите, видна ли сейчас часть объекта (хотя бы частично) или нет.
 * @param obj       указатель на объект
 * @param area      нужно проверить. Сюда будет записана видимая часть области.
 * @return истинно видимый; false не отображается (скрыто, вне родительского элемента, на другом экране и т. д.)
 */
bool lv_obj_area_is_visible(const lv_obj_t * obj, lv_area_t * area);

/**
 * Сказать, виден ли объект (хотя бы частично) сейчас или нет
 * @param obj       указатель на объект
 * @return      правда: видимый; false не отображается (скрыто, вне родительского элемента, на другом экране и т. д.)
 */
bool lv_obj_is_visible(const lv_obj_t * obj);

/**
 * Установить размер расширенной кликабельной области
 * @param obj       указатель на объект
 * @param size      расширенная кликабельная область во всех 4 направлениях [px]
 */
void lv_obj_set_ext_click_area(lv_obj_t * obj, int32_t size);

/**
 * Получите область, в которой можно щелкнуть объект.
 * Это обычная область объекта плюс расширенная область щелчка.
 * @param obj       указатель на объект
 * @param area      сохраните область результатов здесь
 */
void lv_obj_get_click_area(const lv_obj_t * obj, lv_area_t * area);

/**
 * Проверка попадания объекта в определенную точку экранного пространства.
 * @param obj       возражать против хит-теста
 * @param point     точка экранного пространства (абсолютная координата)
 * @return          true: если объект рассматривается под точкой
 */
bool lv_obj_hit_test(lv_obj_t * obj, const lv_point_t * point);

/**
 * Зафиксируйте уменьшение между минимальной и верхней границей. Если минимальная/максимальная ширина указана в валютах, используйтеref_width.
 * @param width         ширина для зажима
 * @param min_width     минимальная ширина
 * @param max_width     максимальная ширина
 * @param ref_width     эталонная ширина, используемая, когда минимальная/максимальная ширина указана в процентах
 * @return              зажатая ширина
 */
int32_t lv_clamp_width(int32_t width, int32_t min_width, int32_t max_width, int32_t ref_width);

/**
 * Зафиксируйте высоту между минимальной и высокой высотой. Если минимальная/максимальная высота указана в валютах, используйтеref_height.
 * @param height         высота для зажима
 * @param min_height     минимальная высота
 * @param max_height     максимальная высота
 * @param ref_height     эталонная высота, используемая, когда минимальная/максимальная высота указана в процентах
 * @return              Зажатая высота
 */
int32_t lv_clamp_height(int32_t height, int32_t min_height, int32_t max_height, int32_t ref_height);

/**
 * @brief Вычисляет ширину в пикселях объектаLVGLна основе его стиля и родителя для заданной ширины `prop`.
 * @param obj Указатель на объект LVGL, ширина которого вычисляется.
 * @param prop Для какой ширины стиля рассчитываться. Допустимые значения:LV_STYLE_WIDTH,LV_STYLE_MIN_WIDTHили
 * LV_STYLE_MAX_WIDTH.
 * @return Вычисленная ширина объекта:
 * @note Если ширина стиля имеет фиксированное значение, возвращается это значение.
 * @note Если ширина стиля равна `LV_SIZE_CONTENT`, вычисляется и возвращается ширина содержимого.
 * @note Если ширина стиля равна `LV_PCT()`, процент применяется к ширине родительского элемента.
 */
int32_t lv_obj_calc_dynamic_width(lv_obj_t * obj, lv_style_prop_t prop);

/**
 * @brief Вычисляет высоту в пикселях объектаLVGLна основе его стиля и родителя для заданной высоты `prop`.
 * @param obj Указатель на объект LVGL, высота которого вычисляется.
 * @param prop На какую высоту стиля рассчитывать. Допустимые значения:LV_STYLE_HEIGHT,LV_STYLE_MIN_HEIGHTили
 * LV_STYLE_MAX_HEIGHT.
 * @return Вычисленная высота объекта:
 * @note Если высота стиля имеет фиксированное значение, возвращается это значение.
 * @note Если высота стиля равна `LV_SIZE_CONTENT`, высота содержимого вычисляется и возвращается.
 * @note Если высота стиля равна `LV_PCT()`, процент применяется к высоте родительского элемента.
 */
int32_t lv_obj_calc_dynamic_height(lv_obj_t * obj, lv_style_prop_t prop);

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*внешний "С"*/
#endif

#endif /*LV_OBJ_POS_H*/
