/**
 * @file lv_obj_scroll.h
 *
 */

#ifndef LV_OBJ_SCROLL_H
#define LV_OBJ_SCROLL_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../misc/lv_area.h"
#include "../misc/lv_anim.h"
#include "../misc/lv_types.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/*Невозможно включить lv_obj.h, так как он включает этот заголовочный файл.*/

/** Режимы полосы прокрутки: показывает, когда полосы прокрутки должны быть видны.*/
typedef enum {
    LV_SCROLLBAR_MODE_OFF,      /**< Никогда не показывать полосы прокрутки*/
    LV_SCROLLBAR_MODE_ON,       /**< Всегда показывать полосы прокрутки*/
    LV_SCROLLBAR_MODE_ACTIVE,   /**< Показывать полосы, пока виджет прокручивается*/
    LV_SCROLLBAR_MODE_AUTO,     /**< Показывать полосы, если содержимое можно прокрутить*/
} lv_scrollbar_mode_t;

/** Параметры выравнивания диапазона прокрутки. Сообщает, где выровнять привязываемые дочерние элементы при остановке прокрутки.*/
typedef enum {
    LV_SCROLL_SNAP_NONE,    /**< Не выравнивать, оставить как есть*/
    LV_SCROLL_SNAP_START,   /**< Выровнять по левому/верхнему краю*/
    LV_SCROLL_SNAP_END,     /**< Выровнять по правому/нижнему краю*/
    LV_SCROLL_SNAP_CENTER   /**< Выровнять по центру*/
} lv_scroll_snap_t;

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/*=====================
 * Функции установки
 *====================*/

/**
 * Установите, как должны вести себя полосы прокрутки.
 * @param obj       указатель на виджет
 * Режим @param LV_SCROLL_MODE_ON / OFF / AUTO / ACTIVE
 */
void lv_obj_set_scrollbar_mode(lv_obj_t * obj, lv_scrollbar_mode_t mode);

/**
 * Установить направление. Виджет можно прокручивать.
 * @param obj       указатель на виджет
 * @param dir       одно или несколько побитовых значений перечисления `lv_dir_t`
 */
void lv_obj_set_scroll_dir(lv_obj_t * obj, lv_dir_t dir);

/**
 * Установите, где привязывать детей, когда прокрутка заканчивается по горизонтали.
 * @param obj       указатель на виджет
 * @param align     значение из перечисления `lv_scroll_snap_t`
 */
void lv_obj_set_scroll_snap_x(lv_obj_t * obj, lv_scroll_snap_t align);

/**
 * Установите, где привязывать детей, когда прокрутка заканчивается вертикально.
 * @param obj       указатель на виджет
 * @param align     значение из перечисления `lv_scroll_snap_t`
 */
void lv_obj_set_scroll_snap_y(lv_obj_t * obj, lv_scroll_snap_t align);

/*=====================
 * Геттерные функции
 *====================*/

/**
 * Получить текущий режим прокрутки (когда скрывать полосы прокрутки)
 * @param obj       указатель на виджет
 * @return          текущий режим прокрутки из `lv_scrollbar_mode_t`
 */
lv_scrollbar_mode_t lv_obj_get_scrollbar_mode(const lv_obj_t * obj);

/**
 * Проложить маршрут Виджет можно прокручивать (устанавливается с помощью`lv_obj_set_scroll_dir()`)
 * @param obj       указатель на виджет
 * @return          текущий бит(ы) направления прокрутки
 */
lv_dir_t lv_obj_get_scroll_dir(const lv_obj_t * obj);

/**
 * Узнайте, куда прикрепить дочерние виджеты, когда горизонтальная прокрутка заканчивается.
 * @param obj       указатель на виджет
 * @return          текущее значение привязки из `lv_scroll_snap_t`
 */
lv_scroll_snap_t lv_obj_get_scroll_snap_x(const lv_obj_t * obj);

/**
 * Узнайте, куда прикрепить дочерние виджеты, когда вертикальная прокрутка заканчивается.
 * @param  obj      указатель на виджет
 * @return          текущее значение привязки из `lv_scroll_snap_t`
 */
lv_scroll_snap_t lv_obj_get_scroll_snap_y(const lv_obj_t * obj);

/**
 * Получить текущую позицию прокрутки X. Идентичен`lv_obj_get_scroll_left()`.
 * @param obj       указатель на прокручиваемый виджет контейнера
 * @return          текущая позиция прокрутки от левого края
 *                      - Если виджет не прокручивается, верните 0.
 *                      - При прокрутке вернитесь > 0.
 *                      - При прокрутке внутрь (эластичная прокрутка) верните <0.
 */
int32_t lv_obj_get_scroll_x(const lv_obj_t * obj);

/**
 * Получить текущую позицию прокрутки Y. Идентичен`lv_obj_get_scroll_top()`.
 * @param obj       указатель на прокручиваемый виджет контейнера
 * @return          текущая позиция прокрутки от верхнего края
 *                      - Если виджет не прокручивается, верните 0.
 *                      - При прокрутке вернитесь > 0.
 *                      - При прокрутке внутрь (эластичная прокрутка) верните <0.
 */
int32_t lv_obj_get_scroll_y(const lv_obj_t * obj);

/**
 * Количество пикселей, на которое можно прокручивать контейнер с возможностью прокрутки. Виджет может быть прокручен вниз.
 * до появления его верхнего края.  Когда флаг LV_OBJ_FLAG_SCROLL_ELASTIC
 * установлено в виджете, это значение может быть отрицательным во время работы виджета.
 * перетянуто ниже нормальной границы верхнего края.
 * @param obj       указатель на прокручиваемый виджет контейнера
 * @return          Пиксели Виджет можно прокручивать вниз до появления его верхнего края.
 */
int32_t lv_obj_get_scroll_top(const lv_obj_t * obj);

/**
 * Количество пикселей, на которое можно прокручивать контейнер с возможностью прокрутки. Виджет
 * до появления его нижнего края.  Когда флаг LV_OBJ_FLAG_SCROLL_ELASTIC
 * установлено в виджете, это значение может быть отрицательным во время работы виджета.
 * перетянуто выше нормальной границы нижнего края.
 * @param obj       указатель на прокручиваемый виджет контейнера
 * @return          Виджет пикселей можно прокручивать вверх до появления его нижнего края.
 */
int32_t lv_obj_get_scroll_bottom(const lv_obj_t * obj);

/**
 * Количество пикселей в прокручиваемом контейнере. Виджет можно прокручивать вправо.
 * до появления его левого края.  Когда флаг LV_OBJ_FLAG_SCROLL_ELASTIC
 * установлено в виджете, это значение может быть отрицательным во время работы виджета.
 * перетащен дальше вправо, чем его обычная левая граница.
 * @param obj       указатель на прокручиваемый виджет контейнера
 * @return          Виджет пикселей можно прокручивать прямо до появления его левого края.
 */
int32_t lv_obj_get_scroll_left(const lv_obj_t * obj);

/**
 * Количество пикселей, на которое контейнер с возможностью прокрутки. Виджет можно прокручивать влево.
 * до появления его правого края.  Когда флаг LV_OBJ_FLAG_SCROLL_ELASTIC
 * установлено в виджете, это значение может быть отрицательным во время работы виджета.
 * перетащен дальше влево, чем его обычная правая граница.
 * @param obj       указатель на прокручиваемый виджет контейнера
 * @return          Пиксели Виджет можно прокручивать влево до появления его правого края.
 */
int32_t lv_obj_get_scroll_right(const lv_obj_t * obj);

/**
 * Получите координаты X и Y, где прокрутка закончится для виджета, если выполняется анимация прокрутки.
 * Если нет анимации прокрутки, укажите текущую позицию прокрутки `x` или `y`.
 * @param obj       указатель на прокручиваемый виджет
 * @param end       указатель на объект `lv_point_t`, в котором сохраняется результат
 */
void lv_obj_get_scroll_end(lv_obj_t * obj, lv_point_t * end);

/*=====================
 * Другие функции
 *====================*/

/**
 * Прокрутка на заданное количество пикселей.
 * @param obj       указатель на прокручиваемый виджет для прокрутки
 * @param dx        пикселей для горизонтальной прокрутки
 * @param dy        пикселей для вертикальной прокрутки
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 * @note            Значение > 0 означает прокрутку вправо/вниз (показывать больше контента справа/внизу)
 * @note            например dy = -20 означает прокрутку вниз на 20 пикселей.
 */
void lv_obj_scroll_by(lv_obj_t * obj, int32_t dx, int32_t dy, lv_anim_enable_t anim_en);

/**
 * Прокрутка на заданное количество пикселей.
 * `dx` и `dy` будут иметь внутренние ограничения, позволяющие прокручивать только область содержимого.
 * @param obj       указатель на прокручиваемый виджет для прокрутки
 * @param dx        пикселей для горизонтальной прокрутки
 * @param dy        пикселей для вертикальной прокрутки
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 * @note            например dy = -20 означает прокрутку вниз на 20 пикселей.
 */
void lv_obj_scroll_by_bounded(lv_obj_t * obj, int32_t dx, int32_t dy, lv_anim_enable_t anim_en);

/**
 * Прокрутите до указанной координаты в виджете.
 * `x` и `y` будут иметь внутренние ограничения, позволяющие прокручивать только область содержимого.
 * @param obj       указатель на прокручиваемый виджет для прокрутки
 * @param x         пикселей для горизонтальной прокрутки
 * @param y         пикселей для вертикальной прокрутки
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 */
void lv_obj_scroll_to(lv_obj_t * obj, int32_t x, int32_t y, lv_anim_enable_t anim_en);

/**
 * Прокрутите до координаты X на виджете.
 * `x` будет иметь внутренние ограничения, позволяющие прокручивать только область содержимого.
 * @param obj       указатель на прокручиваемый виджет для прокрутки
 * @param x         пикселей для горизонтальной прокрутки
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 */
void lv_obj_scroll_to_x(lv_obj_t * obj, int32_t x, lv_anim_enable_t anim_en);

/**
 * Прокрутите до координаты Y в виджете.
 * `y` будет иметь внутренние ограничения, позволяющие прокручивать только область содержимого.
 * @param obj       указатель на прокручиваемый виджет для прокрутки
 * @param y         пикселей для вертикальной прокрутки
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 */
void lv_obj_scroll_to_y(lv_obj_t * obj, int32_t y, lv_anim_enable_t anim_en);

/**
 * Прокрутите родительский виджет`obj`до тех пор, пока`obj`не станет видимым.
 * @param obj       указатель на виджет для прокрутки в поле зрения
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 */
void lv_obj_scroll_to_view(lv_obj_t * obj, lv_anim_enable_t anim_en);

/**
 * Рекурсивно прокручивайте родительские виджеты`obj`, пока`obj`не станет видимым.
 * Виджет будет прокручиваться в поле зрения, даже если у него есть вложенные прокручиваемые родительские элементы.
 * @param obj       указатель на виджет для прокрутки в поле зрения
 * @param anim_en   LV_ANIM_ON: прокрутка с анимацией; LV_ANIM_OFF: прокрутить немедленно
 */
void lv_obj_scroll_to_view_recursive(lv_obj_t * obj, lv_anim_enable_t anim_en);

/**
 * Сообщить, прокручивается ли Виджет в данный момент или нет
 * @param obj   указатель на виджет
 * @return      true:`obj`прокручивается
 */
bool lv_obj_is_scrolling(const lv_obj_t * obj);

/**
 * Остановить прокрутку текущего объекта
 *
 * @param obj Объект, который прокручивается
 */
void lv_obj_stop_scroll_anim(const lv_obj_t * obj);

/**
 * Проверьте дочерние элементы`obj`и прокрутите `obj`, чтобы настроить настройку scroll_snap.
 * @param obj       Виджет, дочерние элементы которого необходимо проверить и привязать
 * @param anim_en LV_ANIM_ON / OFF
 */
void lv_obj_update_snap(lv_obj_t * obj, lv_anim_enable_t anim_en);

/**
 * Получить площадь полос прокрутки
 * @param obj   указатель на виджет
 * @param hor   указатель для хранения области горизонтальной полосы прокрутки
 * @param ver   указатель для хранения области вертикальной полосы прокрутки
 */
void lv_obj_get_scrollbar_area(lv_obj_t * obj, lv_area_t * hor, lv_area_t * ver);

/**
 * Сделать недействительной область полос прокрутки
 * @param obj       указатель на виджет
 */
void lv_obj_scrollbar_invalidate(lv_obj_t * obj);

/**
 * Проверяет, прокручивается ли содержимое, и приводит его в нормальное положение.
 * @param obj       указатель на виджет
 * @param anim_en LV_ANIM_ON / OFF
 */
void lv_obj_readjust_scroll(lv_obj_t * obj, lv_anim_enable_t anim_en);

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /*LV_OBJ_SCROLL_H*/
