/**
 * @file lv_refr.h
 *
 */

#ifndef LV_REFR_H
#define LV_REFR_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "lv_obj.h"
#include "../display/lv_display.h"
#include "../misc/lv_types.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 *  STATIC PROTOTYPES
 **********************/

/**********************
 *  STATIC VARIABLES
 **********************/

/**********************
 *      MACROS
 **********************/

/**********************
 *   GLOBAL FUNCTIONS
 **********************/

/**
 * Перерисуйте недействительные области сейчас.
 * Обычно перерисовка периодически выполняется в`lv_timer_handler`, но постоянная блокировка процесса
 * может предотвратить вызов `lv_timer_handler`. В этом случае, еслиGUIобновляется в процессе
 * (например, индикатор выполнения) эту функцию можно вызвать, когда экран должен быть обновлен.
 * @param disp указатель для отображения для обновления.  NULL, чтобы обновить все дисплеи.
 */
void lv_refr_now(lv_display_t * disp);

/**
 * Перерисовывается объект и все его дочерние элементы с использованием переданного контекста отрисовки.
 * @param layer указатель на слой, где рисовать.
 * @param obj   начальный объект перерисовки должен начаться
 */
void lv_obj_redraw(lv_layer_t * layer, lv_obj_t * obj);

/**
 * Вызывается периодически для обработки обновления
 * @param timer указатель на сам таймер, или `NULL`
 */
void lv_display_refr_timer(lv_timer_t * timer);

/**********************
 *   STATIC FUNCTIONS
 **********************/

#ifdef __cplusplus
} /*внешний "С"*/
#endif

#endif /*LV_REFR_H*/
