/*----------------------------------------------*/
/* Конфигурации системы TJpgDecR0.03          */
/*----------------------------------------------*/

#define JD_SZBUF        512
/* Определяет размер входного буфера потока */

#define JD_FORMAT       0
/* Определяет выходной формат пикселей.
/  0: RGB888 (24 бит/пикс.)
/  1: RGB565 (16 бит/пикс.)
/  2: Оттенки серого (8 бит/пиксель)
*/

#define JD_USE_SCALE    0
/* Переключает функцию удаления накипи на выходе.
/  0: Отключить
/  1: Включить
*/

#define JD_TBLCLIP      1
/* Используйте преобразование таблицы для арифметики насыщения. Немного быстрее, но увеличивает размер кода на 1 KB.
/  0: Отключить
/  1: Включить
*/

#define JD_FASTDECODE   1
/* Уровень оптимизации
/  0: Базовая оптимизация. Подходит для 8/16-битных микроконтроллеров.
/  1: + 32-битный переключатель стволов. Подходит для 32-битных микроконтроллеров.
/  2: + Преобразование таблиц для декодирования Хаффмана (требуется 6 <<HUFF_BITбайтовRAM)
*/

