/**
 * @file lv_string.h
 *
 */

#ifndef LV_STRING_H
#define LV_STRING_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/
#include "../lv_conf_internal.h"
#include "../misc/lv_types.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**
 * @brief Копирует блок памяти из адреса источника в адрес назначения.
 * @param dst Указатель на целевой массив, куда необходимо скопировать содержимое.
 * @param src Указатель на источник копируемых данных.
 * @param len Количество байтов для копирования.
 * @return Указатель на целевой массив.
 * @note Функция не проверяет перекрытие блоков памяти источника и назначения.
 */
void * lv_memcpy(void * dst, const void * src, size_t len);

/**
 * @brief Заполняет блок памяти указанным значением.
 * @param dst Указатель на целевой массив, который необходимо заполнить указанным значением.
 * @param v Значение, которое необходимо установить. Значение передается как целое, но функция заполняет
 *          блок памяти с использованием преобразования беззнакового символа этого значения.
 * @param len Количество байтов, в которых будет установлено значение.
 */
void lv_memset(void * dst, uint8_t v, size_t len);

/**
 * @brief Переместить блок памяти из источника в пункт назначения
 * @param dst Указатель на целевой массив, куда необходимо скопировать содержимое.
 * @param src Указатель на источник копируемых данных.
 * @param len Количество байт для копирования
 * @return Указатель на целевой массив.
 */
void * lv_memmove(void * dst, const void * src, size_t len);

/**
 * @brief Эта функция сравнивает два блока памяти.
 * @param p1 Указатель на первый блок памяти
 * @param p2 Указатель на второй блок памяти
 * @param len Количество байтов для сравнения
 * @return Разница между значением первого несовпадающего байта.
 */
int lv_memcmp(const void * p1, const void * p2, size_t len);

/**
 * То же самое, что `memset(dst, 0x00, len)`.
 * @param dst указатель на целевой буфер
 * @param len количество байтов для установки
 */
static inline void lv_memzero(void * dst, size_t len)
{
    lv_memset(dst, 0x00, len);
}

/**
 * @brief Вычисляет длину строки str до (но не включая) завершающего нулевого символа.
 * @param str Указатель на байтовую строку с нулевым завершением, подлежащую проверке.
 * @return Длина строки в байтах.
 */
size_t lv_strlen(const char * str);

/**
 * @brief Вычисляет длину строки str до (но не включая) завершающего нулевого символа.
 *        или заданная максимальная длина.
 * @param str Указатель на байтовую строку, заканчивающуюся нулем или длиной не менееmax_lenбайт.
 * @param max_len Максимальное количество символов для проверки.
 * @return Длина строки в байтах.
 */
size_t lv_strnlen(const char * str, size_t max_len);

/**
 * @brief Копирует доdst_size-1 (не нулевых) символов из src в dst. Всегда добавляется нулевой терминатор.
 * @param dst Указатель на целевой массив, куда необходимо скопировать содержимое.
 * @param src Указатель на источник копируемых данных.
 * @param dst_size Максимальное количество символов, копируемых в dst, включая нулевой символ.
 * @return Длина src. Возвращаемое значение эквивалентно значению, возвращаемомуlv_strlen(src).
 */
size_t lv_strlcpy(char * dst, const char * src, size_t dst_size);

/**
 * @brief Копирует символы доdest_sizeиз строки, на которую указывает src, в массив символов, на который указывает dst.
 *        и заполняет оставшуюся длину нулевыми байтами.
 * @param dst Указатель на целевой массив, куда необходимо скопировать содержимое.
 * @param src Указатель на источник копируемых данных.
 * @param dest_size Максимальное количество символов, копируемых в dst.
 * @return Указатель на целевой массив, которым является dst.
 * @note dst не будет завершаться нулем, если байтыdest_sizeбыли скопированы из src до достижения конца src.
 */
char * lv_strncpy(char * dst, const char * src, size_t dest_size);

/**
 * @brief Копирует строку, на которую указывает src, включая завершающий нулевой символ,
 *        к массиву символов, который указывает на dst.
 * @param dst Указатель на целевой массив, куда необходимо скопировать содержимое.
 * @param src Указатель на источник копируемых данных.
 * @return Указатель на целевой массив, которым является dst.
 */
char * lv_strcpy(char * dst, const char * src);

/**
 * @brief  Эта функция сравнивает две строки без указанной длины.
 * @param s1    указатель на первую строку
 * @param s2    указатель на вторую строку
 * @return      разница между значением первого несовпадающего символа.
 */
int lv_strcmp(const char * s1, const char * s2);

/**
 * @brief  Эта функция будет сравнивать две строки до заданной длины.
 * @param s1    указатель на первую строку
 * @param s2    указатель на вторую строку
 * @param len   максимальное количество символов для сравнения
 * @return      разница между значением первого несовпадающего символа.
 */
int lv_strncmp(const char * s1, const char * s2, size_t len);

/** Возвращает true, если две условия равны.
 * Просто закройте strcmp для удобства.
 * @param s1    указатель на первую строку
 * @param s2    указатель на вторую строку
 * @return      true: строки равны; ложь: иначе
 */
static inline bool lv_streq(const char * s1, const char * s2)
{
    return lv_strcmp(s1, s2) == 0;
}

/**
 * @brief Дублируйте строку, выделив новую и скопировав содержимое.
 * @param src Указатель на источник копируемых данных.
 * @return Указатель на новую выделенную строку. NULLв случае неудачи.
 */
char * lv_strdup(const char * src);

/**
 * @brief Дублируйте строку, выделив новую и скопировав содержимое.
 *        до конца или указанной максимальной длины, в зависимости от того, что наступит раньше.
 * @param src Указатель на источник копируемых данных.
 * @param max_len Максимальное количество символов для копирования.
 * @return Указатель на вновь выделенную строку с нулевым завершением. NULLв случае неудачи.
 */
char * lv_strndup(const char * src, size_t max_len);

/**
 * @brief Копирует строку, на которую указывает src, включая завершающий нулевой символ,
 *        до конца строки, на которой указано dst.
 * @param dst Указатель на строку назначения, куда необходимо добавить содержимое.
 * @param src Указатель на источник копируемых данных.
 * @return Указатель на строку назначения, которой является dst.
 */
char * lv_strcat(char * dst, const char * src);

/**
 * @brief Копирует символы доsrc_lenиз строки, на которую указывает src.
 *        до конца строки, на которой указано dst.
 *        Завершающий нулевой символ добавляется к dst, даже если нулевой символ отсутствует.
 *        был обнаружен в src после копирования символов src_len.
 * @param dst Указатель на строку назначения, куда необходимо добавить содержимое.
 * @param src Указатель на источник копируемых данных.
 * @param src_len Максимальное количество символов из src, копируемых в конец dst.
 * @return Указатель на строку назначения, которой является dst.
 */
char * lv_strncat(char * dst, const char * src, size_t src_len);

/**
 * @brief Ищет первое вхождение символа c в строке str.
 * @param str Указатель на строку байтов с нулевым завершением, которую необходимо найти.
 * @param c Персонаж, которого нужно искать.
 * @return Указатель на первое вхождение символа c в строке str или нулевой указатель, если c не найден.
 */
char * lv_strchr(const char * str, int c);

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*extern "C"*/
#endif

#endif /*LV_STRING_H*/
