/* TSI 2023.xmo */
/*******************************************************************************
 * Copyright (c) 2023 Think Silicon Single Member PC
 *
 * Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию.
 * этого файла заголовка и/или связанных с ним файлов документации для использования, копирования,
 * изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копии
 * Материалы и разрешать лицам, которым предоставлены Материалы, делать
 * Итак, при соблюдении следующих условий:
 *
 * Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в
 * все копии или существенные части Материалов.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  Программное обеспечение предоставляется «как есть», без каких-либо явных или явных гарантий.
 *  подразумеваемые, включая, помимо прочего, гарантии товарной пригодности,
 *  пригодность для конкретной цели и отсутствие нарушений. Ни в коем случае нельзя
 *  Считайте, что Silicon Single MemberPCнесет ответственность за любые претензии, ущерб или другие
 *  ответственность, будь то по договору, правонарушению или иным образом, возникающая
 *  из, вне или в связи с программным обеспечением, использованием или другими сделками
 *  в программном обеспечении.
 ******************************************************************************/

/**
 * @file
 * @brief Основные функции рисования и инициализации NemaVG API.
 *
 */

#ifndef __NEMA_VG_H__
#define __NEMA_VG_H__

#include "nema_core.h"
#include "nema_sys_defs.h"
#include "nema_vg_path.h"
#include "nema_vg_paint.h"
#include "nema_vg_context.h"

#ifdef __cplusplus
extern "C" {
#endif

// -------------------------------------------------------------------------------
//                           SETUP
// -------------------------------------------------------------------------------

/** \brief Инициализирует библиотеку NemaVG и предлагает трафаретный буфер в пуле памяти по умолчанию (NEMA_MEM_POOL_FB)
 * Вызовите это илиnema_vg_init_stencil_pool, чтобы выделить буфер трафарета в другой пул памяти.
 * илиnema_vg_init_stencil_prealloc, чтобы рассчитать буфер трафарета.
 * \param width Ширина буфера трафарета — должно быть первым числом из 4, равным или превышающим дополнительный кадрбуфер.
 * \param height Высота буфера трафарета — должна быть первым набором из 4, равных или превышающих высоту кадрового буфера.
 */
void nema_vg_init(int width, int height);

/** \brief Инициализирует компонент NemaVG и размещает трафаретный буфер в свободном пуле памяти.
 * Вызовите это илиnema_vg_init, чтобы выделить буфер трафарета в пуле памяти по умолчанию (NEMA_MEM_POOL_FB).
 * илиnema_vg_init_stencil_prealloc, чтобы рассчитать буфер трафарета.
 * \param width Ширина буфера трафарета — должно быть первым числом из 4, равным или превышающим дополнительный кадрбуфер.
 * \param height Высота буфера трафарета — должна быть уменьшена на 4 или равна или больше высоты буфера кадра.
 * \param Пул памяти для выделения буфера трафарета (пулы памяти зависят от платформы и технологии в файле nema_sys_defs.h)
 */
void nema_vg_init_stencil_pool(int width, int height, int pool);

/** \brief Инициализирует компонент NemaVG без выделения трафаретного буфера, предоставленного пользователем.
 * Вызовите это илиnema_vg_init, чтобы выделить буфер трафарета в пуле памяти по умолчанию (NEMA_MEM_POOL_FB).
 * илиnema_vg_init_stencil_pool, чтобы выделить буфер трафарета в другой пул памяти.
 * \param width Ширина буфера трафарета — должно быть первым числом из 4, равным или превышающим дополнительный кадрбуфер.
 * \param height Высота буфера трафарета — должна быть уменьшена на 4 или равна или больше высоты буфера кадра.
 * \param Буфер трафарета stencil_bo
 */
void nema_vg_init_stencil_prealloc(int width, int height, nema_buffer_t stencil_bo);


/** \brief Повторная инициализация библиотеки NemaVG после отключения питания графического процессора
 *
 */
void nema_vg_reinit(void);

/** \brief Деинициализируйте библиотеку NemaVG. Освободить память от неявно выделенных объектов (трафаретный буфер
 *  если он создал внутри библиотеки, буфер lut и путь tsvgs, буферы рисования и градиента)
 *
 *
 */
void nema_vg_deinit(void);

/** \brief Инициализируйте базу NemaVG для нового потока.
 * Должен вызываться для каждого нового используемого потока.
 *
 *
 */
void nema_vg_thread_init(void);

/** \brief Связывает и популяризирует трафаретный буфер в пуле памяти по умолчанию (NEMA_MEM_POOL_FB). Используйте это, если размер фреймбуфера меняется.
 *  во время нанесения необходим другой трафарет. Если предыдущий трафарет был выделен библиотекой путем
 *  Вызываяnema_vg_initилиnema_vg_init_stencil_pool, он будет уничтожен при этом вызове.
 * \param width Ширина буфера трафарета — должна быть уменьшена на 4 или равна ширине кадрового буфера или превысить ее.
 * \param height Высота буфера трафарета — должна быть уменьшена на 4 или равна или больше высоты буфера кадра.
 */
void nema_vg_bind_stencil(int width, int height);

/** \brief Связывает и устанавливает трафаретный буфер в бассейне памяти. Используйте это, если размер фреймбуфера меняется.
 *  во время нанесения необходим другой трафарет. Если предыдущий трафарет был выделен библиотекой путем
 *  Вызываяnema_vg_initилиnema_vg_init_stencil_pool, он будет уничтожен при этом вызове.
 * \param width Ширина буфера трафарета — должна быть уменьшена на 4 или равна ширине кадрового буфера или превысить ее.
 * \param height Высота буфера трафарета — должна быть уменьшена на 4 или равна или больше высоты буфера кадра.
 * \param Пул памяти для выделения буфера трафарета (пулы памяти зависят от платформы и технологии в файле nema_sys_defs.h)
 */
void nema_vg_bind_stencil_pool(int width, int height, int pool);

/** \brief Связывает буфер трафарета, предоставленный пользователем. Используйте это, если размер фреймбуфера меняется.
 *  во время нанесения необходим другой трафарет. Если предыдущий трафарет был выделен библиотекой путем
 *  Вызываяnema_vg_initилиnema_vg_init_stencil_pool, он будет уничтожен при этом вызове.
 * \param width Ширина буфера трафарета — должна быть уменьшена на 4 или равна ширине кадрового буфера или превысить ее.
 * \param height Высота буфера трафарета — должна быть уменьшена на 4 или равна или больше высоты буфера кадра.
 * \param Буфер трафарета stencil_bo
 */
void nema_vg_bind_stencil_prealloc(int width, int height, nema_buffer_t stencil_bo);

// -------------------------------------------------------------------------------
//                           PATH DRAW
// -------------------------------------------------------------------------------

/** \brief Нарисуйте путь, используя указанный объект рисования
 *
 * \param path Указатель (дескриптор) пути, который будет нарисован
 * \param Paint Указатель (дескриптор) объекта рисования, который будет использоваться для рисования.

 * \return Код ошибки. См. NEMA_VG_ERR_*, определяющее в заголовочном файле «nema_vg_context.h» коды ошибок.
 *
 */
uint32_t nema_vg_draw_path(NEMA_VG_PATH_HANDLE path, NEMA_VG_PAINT_HANDLE paint);

/** \brief Нарисуйте строку
 *
 *  \param x1 Верхняя левая координата x
 *  \param y1 Верхняя левая координата y
 *  \param x2 Ширина
 *  \param y2 Высота
 *  \param m 3x3 матрица аффинного преобразования
 *  \param Paint Краска для рисования

 * \return Код ошибки. См. NEMA_VG_ERR_*, определяющее в заголовочном файле «nema_vg_context.h» коды ошибок.
 *
 */
uint32_t nema_vg_draw_line(float x1, float y1, float x2, float y2,
                            nema_matrix3x3_t m,
                            NEMA_VG_PAINT_HANDLE paint);

/** \brief Нарисуйте контур
 *
 *  \param x Верхняя левая координата x
 *  \param y Верхняя левая координата y
 *  \param ширина Ширина
 *  \param высота Высота
 *  \param m 3x3 матрица аффинного преобразования
 *  \param Paint Краска для рисования

 * \return Код ошибки
 *
 */
uint32_t nema_vg_draw_rect(float x, float y, float width, float height,
                            nema_matrix3x3_t m,
                            NEMA_VG_PAINT_HANDLE paint);

/** \brief Нарисуйте закругленный контур
 *
 *  \param x Верхняя левая координата x
 *  \param y Верхняя левая координата y
 *  \param ширина Ширина
 *  \param высота Высота
 *  \param rx Горизонтальный радиус когилы
 *  \param ry Вертикальный радиус когилы
 *  \param m 3x3 матрица аффинного преобразования
 *  \param Paint Краска для рисования

 * \return Код ошибки. См. NEMA_VG_ERR_*, определяющее в заголовочном файле «nema_vg_context.h» коды ошибок.
 *
 */
uint32_t nema_vg_draw_rounded_rect(float x, float y, float width, float height,
                                float rx, float ry,
                                nema_matrix3x3_t m,
                                NEMA_VG_PAINT_HANDLE paint);

/** \brief Нарисуйте эллипс
 *
 *  \param cx Положение эллипса по оси X.
 *  \param cy Положение эллипса по оси Y.
 *  \param rx Радиус оси X
 *  \param ry Радиус по оси Y
 *  \param m 3x3 матрица аффинного преобразования
 *  \param Paint Краска для рисования

 * \return Код ошибки. См. NEMA_VG_ERR_*, определяющее в заголовочном файле «nema_vg_context.h» коды ошибок.
 *
 */
uint32_t nema_vg_draw_ellipse(float cx, float cy, float rx, float ry,
                            nema_matrix3x3_t m,
                            NEMA_VG_PAINT_HANDLE paint);

/** \brief Нарисуйте форму круга
 *
 *  \param cx Центр окружности по оси X.
 *  \param cy Центр окружности по оси Y.
 *  \param r Радиус круга
 *  \param m 3x3 матрица аффинного преобразования
 *  \param Paint Краска для рисования

 * \return Код ошибки. См. NEMA_VG_ERR_*, определяющее в заголовочном файле «nema_vg_context.h» коды ошибок.
 *
 */
uint32_t nema_vg_draw_circle(float cx, float cy, float r,
                            nema_matrix3x3_t m,
                            NEMA_VG_PAINT_HANDLE paint);

/** \private */
uint32_t nema_vg_draw_ring_generic(float cx, float cy, float ring_radius, float angle_start, float angle_end,
                                            NEMA_VG_PAINT_HANDLE paint, uint8_t has_caps)  __attribute__ ((deprecated("This function is deprecated use nema_vg_draw_circular_ring instead.")));

/** \brief Нарисуйте заполненное кольцо. Заглавные буквы соответствуют стилю заглавных букв, установленному вnema_vg_set_cap_style. В случае конического типа градиентной краски,
 * центр конического градиента должен находиться в центре кольца (cx, cy). В другом случае, когда два центра не совпадают,
 * Кольцо необходимо нарисовать с помощью NEMA_VG_QUALITY_MAXIMUM. Ширину кольца можно установить с помощью краски stroke_width.
 *
 *  \param cx Координата центра x колец
 *  \param cy Координата центра и кольца
 *  \paramring_radiusРадиус кольца
 *  \paramangle_startУгловые кольца в градусах
 *  \paramangle_endУгол в градусах, которым заканчивается это кольцо.
 *  \param Paint Краска для рисования

 * \return Код ошибки. См. NEMA_VG_ERR_*, определяющее в заголовочном файле «nema_vg_context.h» коды ошибок.
 *
 */
uint32_t nema_vg_draw_ring(float cx, float cy, float ring_radius, float angle_start, float angle_end, NEMA_VG_PAINT_HANDLE paint);



/** \brief Возвращает минимальные и максимальные значения координат.
 * после применения преобразования (если оно есть), которое
 * может обрабатываться базовым оборудованием.
 * Обратите внимание, что значения перед преобразованием должны находиться в пределах диапазона (-32,767, 32,676).
 * чтобы оборудование могло их обрабатывать
 *
 *  \parammin_coordМинимальное значение координат (x или y) (указатель)
 *  \parammax_coordМаксимальное значение координат (x или y) (указатель)
 *
 */
void nema_vg_get_coord_limits(float *min_coord, float *max_coord);


/** \brief Отключает функцию tsvg при рендеринге. Должен быть установлен раньше
 * nema_vg_draw_tsvg ()
 *
 *  \param Функция Функция, которую нужно отключить
 *
 */
void nema_vg_tsvg_disable_feature(uint32_t feature);

/** \brief проверьте, содержат ли координаты координат пути NaN.
 * Он использует свойства чисел NaN, что f != f.
 * Обратите внимание, что при компиляции с флагами оптимизации, например -ffast-math,
 * компилятор может оптимизировать вышеуказанное условие и, следовательно, эту функцию
 * не будет сообщать координаты NaN.
 *
 * \param path Указатель (дескриптор) пути

 * \returnNEMA_VG_ERR_INVALID_ARGUMENTS, если какая-либо из координат равна NaN
 * в противном случае возвращает NEMA_VG_ERR_NO_ERROR.
 *
 */
uint32_t nema_vg_verify_path(NEMA_VG_PATH_HANDLE path);

#ifdef __cplusplus
}
#endif

#endif //__NEMA_VG_H__
