/* TSI 2023.xmo */
/*******************************************************************************
 * Copyright (c) 2023 Think Silicon Single Member PC
 *
 * Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию.
 * этого файла заголовка и/или связанных с ним файлов документации для использования, копирования,
 * изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копии
 * Материалы и разрешать лицам, которым предоставлены Материалы, делать
 * Итак, при соблюдении следующих условий:
 *
 * Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в
 * все копии или существенные части Материалов.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  Программное обеспечение предоставляется «как есть», без каких-либо явных или явных гарантий.
 *  подразумеваемые, включая, помимо прочего, гарантии товарной пригодности,
 *  пригодность для конкретной цели и отсутствие нарушений. Ни в коем случае нельзя
 *  Считайте, что Silicon Single MemberPCнесет ответственность за любые претензии, ущерб или другие
 *  ответственность, будь то по договору, правонарушению или иным образом, возникающая
 *  из, вне или в связи с программным обеспечением, использованием или другими сделками
 *  в программном обеспечении.
 ******************************************************************************/

/**
 * @file
 * @brief API для рендеринга изображений .tsvg.
 *
 */

#ifndef NEMA_VG_TSVG_H_
#define NEMA_VG_TSVG_H_

#include "nema_vg_context.h"

#ifdef __cplusplus
extern "C" {
#endif

/** \brief Рисует буфер TSVG
 *
 * \param buffer Указатель буфераTSVG, который будет отрисован.
 *
 */
void
nema_vg_draw_tsvg(const void* buffer);

/** \brief Поддержка поддержки и высоты tsvg
 *
 * \param буфер Буфер ЦВГ
 * \param width принимает ресурсы Tsvg
 * \param высота подъема Tsvg
 *
 */
void nema_vg_get_tsvg_resolution(const void *buffer, uint32_t *width, uint32_t *height);

#ifdef __cplusplus
}
#endif

#endif // NEMA_VG_TSVG_H_
