/* TSI 2023.xmo */
/*******************************************************************************
 * Copyright (c) 2023 Think Silicon Single Member PC
 *
 * Разрешение настоящим предоставляется бесплатно любому лицу, получившему копию.
 * этого файла заголовка и/или связанных с ним файлов документации для использования, копирования,
 * изменять, объединять, публиковать, распространять, сублицензировать и/или продавать копии
 * Материалы и разрешать лицам, которым предоставлены Материалы, делать
 * Итак, при соблюдении следующих условий:
 *
 * Вышеупомянутое уведомление об авторских правах и настоящее уведомление о разрешении должны быть включены в
 * все копии или существенные части Материалов.
 *
 * MODIFICATIONS TO THIS FILE MAY MEAN IT NO LONGER ACCURATELY REFLECTS
 * NEMAGFX API. THE UNMODIFIED, NORMATIVE VERSIONS OF THINK-SILICON NEMAGFX
 * SPECIFICATIONS AND HEADER INFORMATION ARE LOCATED AT:
 *   https://think-silicon.com/products/software/nemagfx-api
 *
 *  Программное обеспечение предоставляется «как есть», без каких-либо явных или явных гарантий.
 *  подразумеваемые, включая, помимо прочего, гарантии товарной пригодности,
 *  пригодность для конкретной цели и отсутствие нарушений. Ни в коем случае нельзя
 *  Считайте, что Silicon Single MemberPCнесет ответственность за любые претензии, ущерб или другие
 *  ответственность, будь то по договору, правонарушению или иным образом, возникающая
 *  из, вне или в связи с программным обеспечением, использованием или другими сделками
 *  в программном обеспечении.
 ******************************************************************************/


#ifndef NEMA_EASING_H__
#define NEMA_EASING_H__

#ifdef __cplusplus
extern "C" {
#endif

//Линейный

// Смоделировано по линии y = x
/** \brief Линейное замедление, без ускорения
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_linear(float p);

//квадратичный

// Смоделировано по образцу параболы y = x^2.
/** \brief Квадратичное замедление, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quad_in(float p);

// Смоделировано по образцу параболы y = -x^2 + 2x.
/** \brief Квадратичное замедление, замедление до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quad_out(float p);

// Смоделировано по образцу кусочно-квадратичного
// y = (1/2)((2x)^2)             ; [0, 0.5)
// y = -(1/2)((2x-1)*(2x-3) - 1) ; [0.5, 1]
/** \brief Квадратичное замедление, ускорение до половины, затем замедление
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quad_in_out(float p);

//Кубический

// Смоделировано по образцу кубического y = x^3
/** \brief Кубовое ослабление, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_cub_in(float p);

// Смоделировано по образцу кубики y = (x - 1)^3 + 1
/** \brief Кубик ослабевает, замедляется до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_cub_out(float p);

// Создан по образцу кусочно-кубической
// y = (1/2)((2x)^3)       ; [0, 0.5)
// y = (1/2)((2x-2)^3 + 2) ; [0.5, 1]
/** \brief Кубический плавный вход и выход, ускорение до половины, затем замедление
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_cub_in_out(float p);

//Квартик

// Смоделировано по образцу квартики x^4.
/** \brief Quartic замедляется, ускоряемся с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quar_in(float p);

// Смоделировано по образцу квартики y = 1 - (x - 1)^4.
/** \brief Квартик замедляется, замедляется до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quar_out(float p);

// По образцу кусочной квартики
// y = (1/2)((2x)^4)        ; [0, 0.5)
// y = -(1/2)((2x-2)^4 - 2) ; [0.5, 1]
/** \brief Квартик плавно входит и выходит, ускоряется до половины, затем замедляется.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quar_in_out(float p);

//Квинтик

// По образцу квинтики y = x^5
/** \brief Quintic замедляется, ускоряемся с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quin_in(float p);

// Смоделировано по образцу квинтики y = (x - 1)^5 + 1
/** \brief Quintic замедляется, замедляется до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quin_out(float p);

// По образцу кусочной квинтики
// y = (1/2)((2x)^5)       ; [0, 0.5)
// y = (1/2)((2x-2)^5 + 2) ; [0.5, 1]
/** \brief Quintic плавно возникает и возникает, нарушение происходит до половины, а затем замедляется.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_quin_in_out(float p);

//Грех

// Смоделировано по четверти цикла синусоидальной волны.
/** \brief Синусоидальное замедление, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_sin_in(float p);

// Смоделировано по четверти цикла синусоидальной волны (другая фаза)
/** \brief Синусоидальное ослабление, замедление до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_sin_out(float p);

// Смоделировано по полусинусоидальной волне
/** \brief Синусоидальное замедление, ускорение до половины, затем замедление
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_sin_in_out(float p);

//Круговой

// Смоделировано на основе смещенного квадранта IV единичного круга.
/** \brief Круговое замедление, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_circ_in(float p);

// Смоделировано на основе смещенного квадранта II единичного круга.
/** \brief Круговое замедление, замедление до нулевой скорости.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_circ_out(float p);

// Смоделировано по образцу кусочно-круговой функции.
// y = (1/2)(1 - sqrt(1 - 4x^2)) ; [0, 0,5)
// y = (1/2)(sqrt(-(2x - 3)*(2x - 1)) + 1) ; [0,5, 1]
/** \brief Круговое замедление, ускорение до половины, затем замедление.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_circ_in_out(float p);

//Экспоненциальный

// Смоделировано по показательной функции y = 2^(10(x - 1))
/** \brief Экспоненциальное замедление, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_exp_in(float p);

// Смоделировано по показательной функции y = -2^(-10x) + 1
/** \brief Экспоненциальное замедление, замедление до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_exp_out(float p);

// Смоделировано по образцу кусочной экспоненты
// y = (1/2)2^(10(2x - 1))         ; [0,0.5)
// y = -(1/2)*2^(-10(2x - 1))) + 1 ; [0.5,1]
/** \brief Экспоненциальное замедление, ускорение до половины, затем замедление
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_exp_in_out(float p);

//Эластичный
// Смоделировано по затухающей синусоидальной волне y = sin(13pi/2*x)*pow(2, 10 * (x - 1))

/** \brief Эластическое замедление, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_elast_in(float p);

// Смоделировано по затухающей синусоидальной волне y = sin(-13pi/2*(x + 1))*pow(2, -10x) + 1
/** \brief Упругое ослабление, замедление до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_elast_out(float p);

// Смоделировано по образцу кусочно-экспоненциально затухающей синусоидальной волны:
// y = (1/2)*sin(13pi/2*(2*x))*pow(2, 10 * ((2*x) - 1)) ; [0,0,5)
// y = (1/2)*(sin(-13pi/2*((2x-1)+1))*pow(2,-10(2*x-1)) + 2) ; [0,5, 1]
/** \brief Эластичное плавное движение вперед и назад, ускорение до половины, затем замедление.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_elast_in_out(float p);

//Назад

// Смоделировано по принципу кубического перелета y = x^3-x*sin(x*pi)
/** \brief Промах, плавность, ускорение с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_back_in(float p);

// Смоделировано после превышения кубического y = 1-((1-x)^3-(1-x)*sin((1-x)*pi))
/** \brief Пролет, ослабление, замедление до нулевой скорости
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_back_out(float p);

// Смоделировано по образцу кусочно-вылетающей кубической функции:
// y = (1/2)*((2x)^3-(2x)*sin(2*x*pi)) ; [0, 0,5)
// y = (1/2)*(1-((1-x)^3-(1-x)*sin((1-x)*pi))+1) ; [0,5, 1]
/** \brief Пролет, плавный вход и выход, разгонитесь до половины, затем замедлите ход.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_back_in_out(float p);

//Отказов

/** \brief Подпрыгивая, плавно скручиваясь с нуля
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_bounce_out(float p);

/** \brief Отскок, ослабление, замедление до нулевой скорости.
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_bounce_in(float p);

/** \brief Подпрыгивание, плавное движение вперед и назад, ускорение до половины, затем замедление
 *
 * \param p Входное значение, обычно в составе [0, 1]
 * \return Уменьшенное значение
 *
 */
float nema_ez_bounce_in_out(float p);


/** \brief Удобная функция для выполнения плавного перехода между двумя значениями с учетом количества шагов, текущего шага и функции замедления
 *
 * \param A Начальное значение в сущности [0, 1]
 * \param B Конечное значение в отдельности [0, 1]
 * \param шаги Общее количество шагов
 * \paramcur_stepТекущий шаг
 * \paramez_funcуказатель на нужную функцию плавности
 * \return Уменьшенное значение
 *
 */


float nema_ez(float A, float B, float steps, float cur_step, float (*ez_func)(float p));

#ifdef __cplusplus
}
#endif

#endif
