/**
 * @file lv_draw_private.h
 *
 */

/**
 * Изменено NXP в 2024 г.
 */

#ifndef LV_DRAW_PRIVATE_H
#define LV_DRAW_PRIVATE_H

#ifdef __cplusplus
extern "C" {
#endif

/*********************
 *      INCLUDES
 *********************/

#include "lv_draw.h"
#include "../osal/lv_os_private.h"
#include "../misc/cache/lv_cache.h"

/*********************
 *      DEFINES
 *********************/

/**********************
 *      TYPEDEFS
 **********************/

struct _lv_draw_task_t {
    lv_draw_task_t * next;

    lv_draw_task_type_t type;

    /**
     * Область, где рисовать
     */
    lv_area_t area;

    /**
     * Настоящая зона розыгрыша. Например. для теней, контуров или преобразованных изображений отличается от `area`
     */
    lv_area_t _real_area;

    /** Исходная область, которая обновляется*/
    lv_area_t clip_area_original;

    /**
     * Область обрезки слоя сохраняется здесь при создании задачи рисования.
     * Поскольку область обрезки слоя может быть изменена при добавлении новых задач рисования, ее текущее значение необходимо сохранить.
     * Поэтому во время рисования не следует использовать область обрезки слоя, поскольку она может быть уже изменена для других задач рисования.
     */
    lv_area_t clip_area;
    lv_layer_t * target_layer;

#if LV_DRAW_TRANSFORM_USE_MATRIX
    /** Матрица преобразования, которая будет применяться при рендеринге слоя */
    lv_matrix_t matrix;
#endif

    /* Ссылка на блок рисования для целей отладки или контекста рисования. */
    lv_draw_unit_t * draw_unit;

    volatile int state;              /** int вместо lv_draw_task_state_t, чтобы быть уверенным, что он атомарный */

    void * draw_dsc;

    /** Непрозрачность слоя */
    lv_opa_t opa;

    /**
     * ID из draw_unit, который должен взять на себя эту задачу.
     */
    uint8_t preferred_draw_unit_id;

    /**
     * Эта установка, как известно,`preferred_draw_unit_id`хорошо работает с блоком.
     * 80: означает на 20% лучше (быстрее), чем программный рендеринг
     * 100: значение по умолчанию
     * 110: означает на 10% хуже (медленнее), чем программный рендеринг
     */
    uint8_t preference_score;

};

struct _lv_draw_mask_t {
    void * user_data;
};

struct _lv_draw_unit_t {
    lv_draw_unit_t * next;

    /**
     * Имя и ID блока рисования, только для целей отладки.
     */
    const char * name;
    int32_t idx;

    /**
     * Вызывается, чтобы попытаться назначить себе задачу рисования.
     * `lv_draw_get_next_available_task` можно использовать для получения любых задач рисования.
     * Задачу рисования следует назначать только в том случае, если блок рисования тоже может ее нарисовать.
     * @param draw_unit     указатель на блок рисования
     * @param layer         указатель на слой, на котором должна быть нарисована задача рисования
     * @return              >=0: Количество выполненных задач по розыгрышу:
     *                                  0 означает, что задача еще не завершена.
     *                                  1 означает, что новая задача принята.
     *                      -1: Блок рисования хотел поработать над задачей, но не смог этого сделать.
     *                              из-за некоторых ошибок (например, нехватки памяти).
     *                              Это сигнализирует о том, что LVGL должен позже снова позвонить диспетчеру.
     *                              чтобы позволить блоку рисования попытаться снова начать рендеринг.
     */
    int32_t (*dispatch_cb)(lv_draw_unit_t * draw_unit, lv_layer_t * layer);

    /**
     *
     * @param draw_unit
     * Задача @param
     * @return
     */
    int32_t (*evaluate_cb)(lv_draw_unit_t * draw_unit, lv_draw_task_t * task);

    /**
     * Вызывается для подачи сигнала устройству о необходимости выполнения всех задач и возврата статуса готовности.
     * Этот обратный вызов может быть реализован в случае асинхронной обработки задачи.
     * Ниже приведен пример, показывающий разницу между синхронным и асинхронным:
     *
     * Синхронный:
     * LVGL резьба DRAW резьба HW
     *
     * задача1 --> отправить --> получить задачу1
     *                          wait_for_finish ()
     *                   <-- задача1->state =READY<-- Выполнить задачу1
     * задача2 --> отправить --> получить задачу2
     *                          wait_for_finish ()
     *                          задача2->состояние = READY <-- Завершить задачу2
     * задача3 --> отправить --> получить задачу3
     *                          wait_for_finish ()
     *                   <-- задача3->состояние = READY <-- Завершить задачу3
     * задача 4 -> отправить -> получить задачу 4
     *                          wait_for_finish ()
     *                   <-- задача4->состояние = READY <-- Завершить задачу4
     * NO MORE TASKS
     *
     *
     * Асинхронный:
     * LVGL резьба DRAW резьба HW
     *                                                      is IDLE
     * задача1 --> очередь задача1
     *                          отправить -> Получить задачу 1
     * задача2 -> очередь задача2 — BUSY (с задачей1)
     * задача3 --> очередь задача3 по-прежнему BUSY (с задачей1)
     * задача 4 -> очередь задача 4 становится IDLE
     *                   <-- задача1->state =READY<-- Выполнить задачу1
     *                          отправить --> Получить задачу2, задачу3, задачу4
     * NO MORE TASKS
     * wait_for_finish_cb ()wait_for_finish()
     *                                               <-- Выполнить задачу2, задачу3, задачу4
     *                   <-- задача2->состояние = READY <--
     *                   <-- задача3->состояние = READY <--
     *                   <-- задача4->состояние = READY <--
     *
     * @param draw_unit
     * @return
     */
    int32_t (*wait_for_finish_cb)(lv_draw_unit_t * draw_unit);

    /**
     * Вызывается для удаления единицы рисования.
     * @param draw_unit
     * @return
     */
    int32_t (*delete_cb)(lv_draw_unit_t * draw_unit);

    /**
     * Вызывается, когда событие отправляется в блок рисования.
     * @param event указатель на дескриптор события
     */
    void (*event_cb)(lv_event_t * event);
};

typedef struct {
    lv_draw_unit_t * unit_head;
    uint32_t unit_cnt;
    uint32_t used_memory_for_layers; /* измеряется в байтах */
#if LV_USE_OS
    lv_thread_sync_t sync;
#else
    volatile int dispatch_req;
#endif
    lv_mutex_t circle_cache_mutex;
    bool task_running;
} lv_draw_global_info_t;

/**********************
 * GLOBAL PROTOTYPES
 **********************/

/**********************
 *      MACROS
 **********************/

#ifdef __cplusplus
} /*внешний "С"*/
#endif

#endif /*LV_DRAW_PRIVATE_H*/
