#ifndef _THORVG_H_
#define _THORVG_H_

#include "../../lv_conf_internal.h"

/*Тестирование зависимостей*/
#if LV_USE_THORVG && LV_USE_VECTOR_GRAPHIC == 0
#error "ThorVG: LV_USE_VECTOR_GRAPHIC is required. Enable it in lv_conf.h"
#endif

#if LV_USE_THORVG_INTERNAL
#define TVG_BUILD 1


#include <functional>
#include <cstdint>
#include <memory>
#include <string>
#include <list>
#include "../../stdlib/lv_mem.h"
#include "../../stdlib/lv_string.h"
#include "../../misc/lv_assert.h"

#ifdef TVG_API
    #undef TVG_API
#endif

#ifndef TVG_STATIC
    #ifdef _WIN32
        #if TVG_BUILD
            #define TVG_API __declspec(dllexport)
        #else
            #define TVG_API __declspec(dllimport)
        #endif
    #elif (defined(__SUNPRO_C)  || defined(__SUNPRO_CC))
        #define TVG_API __global
    #else
        #if (defined(__GNUC__) && __GNUC__ >= 4) || defined(__INTEL_COMPILER)
            #define TVG_API __attribute__ ((visibility("default")))
        #else
            #define TVG_API
        #endif
    #endif
#else
    #define TVG_API
#endif

#ifdef TVG_DEPRECATED
    #undef TVG_DEPRECATED
#endif

#ifdef _WIN32
    #define TVG_DEPRECATED __declspec(deprecated)
#elif __GNUC__ > 3 || (__GNUC__ == 3 && __GNUC_MINOR__ >= 1)
    #define TVG_DEPRECATED __attribute__ ((__deprecated__))
#else
    #define TVG_DEPRECATED
#endif

#define _TVG_DECLARE_PRIVATE(A) \
    struct Impl; \
    Impl* pImpl; \
protected: \
    A(const A&) = delete; \
    const A& operator=(const A&) = delete; \
    A()

#define _TVG_DISABLE_CTOR(A) \
    A() = delete; \
    ~A() = delete

#define _TVG_DECLARE_ACCESSOR(A) \
    friend A

namespace tvg
{

class RenderMethod;
class Animation;

/**
 * @defgroup ТорВГ ТорВГ
 * @brief Классы и перечисления ThorVG, предоставляющие API C++.
 */

/**@{*/

/**
 * @brief Перечисление, определяющее результат API.
 *
 * ВсеAPIThorVG могут возвращать одни результаты измерений в список.
 * Обратите внимание, что некоторые API могут дополнительно указывать причины, по которым возвращаются их значения.
 *
 */
enum class Result
{
    Success = 0,           ///< Значение, возвращаемое в случае корректного выполнения запроса.
    InvalidArguments,      ///< Значение, возвращаемое в случае проблемы с аргументами, переданными в API - например. пустые пути или нулевые указатели.
    InsufficientCondition, ///< Значение, возвращаемое в случае, если запрос не может быть обработан - например. запрос свойств объекта, которого не существует.
    FailedAllocation,      ///< Значение, возвращаемое в случае неудачного выделения памяти.
    MemoryCorruption,      ///< Значение, возвращаемое в случае неправильной обработки памяти – например. сбой при освобождении или приведении указателя
    NonSupport,            ///< Значение, возвращаемое в случае выбора неподдерживаемых функций (опций) движка.
    Unknown                ///< Значение, возвращаемое во всех остальных случаях.
};


/**
 * @brief Перечисление, указывающее значения команд пути, принимаемых TVG.
 *
 * Не путать с командами пути из элемента пути svg (например, M, L, Q, H и другими).
 * TVG интерпретирует их все и преобразует в значения PathCommand.
 */
enum class PathCommand
{
    Close = 0, ///< Заканчивает текущий подпуть и соединяет его с начальной точкой. Эта команда не ожидает никаких очков.
    MoveTo,    ///< Устанавливает новую начальную точку подпути и новую текущую точку. Эта команда ожидает 1 точку: стартовую позицию.
    LineTo,    ///< Рисует линию от текущей точки до заданной точки и устанавливает новое значение текущей точки. Эта команда ожидает 1 точку: конечную позицию линии.
    CubicTo    ///< Рисует кубическую кривую Безье от текущей точки до заданной точки, используя две заданные контрольные точки, и устанавливает новое значение текущей точки. Эта команда ожидает 3 точки: 1-я контрольная точка, 2-я контрольная точка и конечная точка кривой.
};


/**
 * @brief Перечисление, определяющее тип окончания штриха в открытых подпутях.
 */
enum class StrokeCap
{
    Square = 0, ///< Обводка расширяется в обеих конечных точках подпути на прямоугольник с шириной, равной ширине обводки, и длиной, равной половине ширины обводки. Для подпутей нулевой длины квадрат отображается с размером ширины штриха.
    Round,      ///< Штрих расширяется в обеих конечных точках подпути на полукруг с радиусом, равным половине ширины штриха. Для подпутей нулевой длины отображается полный круг.
    Butt        ///< Штрих заканчивается точно в каждой из двух конечных точек подпути. Для подпутей нулевой длины штрих не отображается.
};


/**
 * @brief Перечисление, определяющее стиль, используемый в углах соединенных сегментов обведенного контура.
 */
enum class StrokeJoin
{
    Bevel = 0, ///< Внешний угол соединяемых сегментов пути скошен в точке соединения. Треугольная область угла ограничена прямой линией между внешними углами каждого штриха.
    Round,     ///< Внешний угол соединяемых сегментов пути закруглен. Круглая область центрируется в точке соединения.
    Miter      ///< Внешний угол соединенных сегментов пути имеет шипы. Шип создается путем расширения за пределы точки соединения внешних краев обводки до их пересечения. Если расширение выходит за пределы ограничения, стиль соединения преобразуется в стиль «Скос».
};


/**
 * @brief Перечисление, указывающее, как заполнить область за пределами границ градиента.
 */
enum class FillSpread
{
    Pad = 0, ///< Оставшаяся область заполняется ближайшим стоп-цветом.
    Reflect, ///< Узор градиента отражается за пределами области градиента до тех пор, пока ожидаемая область не будет заполнена.
    Repeat   ///< Шаблон градиента непрерывно повторяется за пределами области градиента, пока ожидаемая область не будет заполнена.
};


/**
 * @brief Перечисление, определяющее алгоритм, используемый для определения того, какие части фигуры считаются внутренней частью фигуры.
 */
enum class FillRule
{
    Winding = 0, ///< Рисуется линия от точки до места за пределами фигуры. Подсчитываются пересечения линии с сегментом пути фигуры. Начиная с нуля, если сегмент пути фигуры пересекает линию по часовой стрелке, единица добавляется, в противном случае единица вычитается. Если полученная сумма не равна нулю, точка находится внутри фигуры.
    EvenOdd      ///< Рисуется линия от точки до места за пределами фигуры и подсчитываются ее пересечения с сегментами пути фигуры. Если количество пересечений нечетное, точка находится внутри фигуры.
};


/**
 * @brief Перечисление, указывающее метод, используемый в составе двух объектов — целевого и исходного.
 *
 * Notation: S (Источник), T (Цель),SA(Источник альфа),TA(Цель альфа)
 *
 * @see Краска:: composite()
 */
enum class CompositeMethod
{
    None = 0,           ///< Композиция не применяется.
    ClipPath,           ///< Определяется пересечение источника и цели, и визуализируются только результирующие пиксели из источника. Обратите внимание, что ClipPath поддерживает только тип Shape.  @deprecatedВместо этого воспользуйтесь Paint::clip().
    AlphaMask,          ///< Альфа-маскирование с использованием пикселей цели композиции в качестве значения альфа.
    InvAlphaMask,       ///< Альфа-маскирование с использованием дополнения к пикселям цели композиции в качестве значения альфа.
    LumaMask,           ///< Альфа-маскирование с использованием оттенков серого (0,2125R + 0,7154G + 0,0721*B) цели композитинга.  @since0.9
    InvLumaMask,        ///< Альфа-маскирование с использованием оттенков серого (0,2125R + 0,7154G + 0,0721*B) соответствует пикселям композиции цели.  @since0.11
    AddMask,            ///< Объединяет пиксели целевого и исходного объектов с использованием целевой альфа. (T*TA) + (S*(255 - TA)) (Экспериментальный API)
    SubtractMask,       ///< Вычитает исходный цвет из целевого цвета, учитывая соответствующую целевую альфу. (T*TA) — (S*(255 — TA)) (Экспериментальный API)
    IntersectMask,      ///< Вычисляете результаты, беря минимальное значение между предельным альфа и исходной альфа и умножая его на верхний цвет. (T * min(TA,SA)) (ЭкспериментальныйAPI)
    DifferenceMask,     ///< Вычисляется абсолютная разница между целевым цветом и исходным цветом, умноженная на дополнение альфа. abs(T - S * (255 -TA)) (ЭкспериментальныйAPI)
    LightenMask,        ///< При пересечении нескольких масок используется наибольшее значение прозрачности. (Экспериментальный API)
    DarkenMask          ///< При пересечении нескольких масок используется наименьшее значение прозрачности. (Экспериментальный API)
};


/**
 * @brief Нумерация указывает метод, используемый для смешивания краски. Пожалуйста, обратитесь к соответствующим формулам для каждого метода.
 *
 * Notation: S (исходная краска в качестве верхнего слоя), D (назначение в качестве нижнего слоя), Sa (исходная краска альфа), Da (назначенная альфа)
 *
 * @see Краска:: blend()
 *
 * @since 0,15
 */
enum class BlendMethod : uint8_t
{
    Normal = 0,        ///< Выполняем альфа-смешение (по умолчанию). S если (Sa == 255), иначе (Sa * S) + (255 - Sa) * D
    Multiply,          ///< Принимает значения канала RGB от 0 до 255 для каждого пикселя верхнего слоя и умножает их на значения для соответствующего пикселя нижнего слоя. (С*Д)
    Screen,            ///< Значения пикселей в двух слоях инвертируются, умножаются, а затем снова инвертируются. (С+Д) - (С*Д)
    Overlay,           ///< Сочетает режимы наложения «Умножение» и «Экран». (2*С*Д), если (2*Д<Да), иначе (Са*Да) — 2*(Да — С)*(Са — Д)
    SrcOver,           ///< Заменить нижний слой верхним.
    Darken,            ///< Создает пиксель, который сохраняет наименьшие компоненты пикселей верхнего и нижнего слоев. мин(С, Д)
    Lighten,           ///< Только имеет действие, противоположное «Только потомнить». макс(С, Д)
    ColorDodge,        ///< Делит нижний слой на инвертированный верхний слой. Д/(255 - С)
    ColorBurn,         ///< Делит инвертированный нижний слой на верхний слой, а затем инвертирует результат. 255 - (255 - Д)/С
    HardLight,         ///< То же, что и Overlay, но с обратным расположением цветов. (2*С*Д), если (С<Са), иначе (Са*Да)-2*(Да-С)*(Са-Д)
    SoftLight,         ///< То же, что и наложение, но с применением чистого черного или белого цвета не получается чистый черный или белый цвет. (1 - 2*С)*(Д^2) + (2*С*Д)
    Difference,        ///< Вычитает нижний слой из верхнего слоя или наоборот, чтобы всегда получать неотрицательное значение. (S - D), если (S > D), иначе (D - S)
    Exclusion,         ///< Результат — удвоенное произведение верхнего и нижнего слоев, вычтенное из их суммы. с + д - (2 * с * д)
    Hue,               ///< Зарезервировано. Не поддерживается.
    Saturation,        ///< Зарезервировано. Не поддерживается.
    Color,             ///< Зарезервировано. Не поддерживается.
    Luminosity,        ///< Зарезервировано. Не поддерживается.
    Add,               ///< Просто добавляет значения пикселей одного слоя к другому. (С + Д)
    HardMix            ///< Зарезервировано. Не поддерживается.
};


/**
 * @brief Перечисление, определяющее методы, используемые для эффектов сцены.
 *
 * Это перечисление предоставляет возможности применения к сцене различных эффектов постобработки.
 * Эффекты сцены обычно применяются для изменения окончательного внешнего вида визуализированной сцены, например, для размытия.
 *
 * @see Scene::push(эффект SceneEffect, ...)
 *
 * @note Экспериментальный API
 */
enum class SceneEffect : uint8_t
{
    ClearAll = 0,      ///< Сброс всех ранее примененных эффектов сцены, возвращая сцену в исходное состояние.
    GaussianBlur       ///< Применить эффект размытия с помощью фильтра Гаусса. Param(3) = {sigma(float)[> 0], направление(int)[оба: 0 / по горизонтали: 1 / по вертикали: 2], граница (int)[дубликат: 0 / перенос: 1], качество (int)[0 - 100]}
};


/**
 * @brief Перечисление, определяющее тип механизма, используемого для графического процессора. Для нескольких серверов разрешены побитовые операции.
 */
enum class CanvasEngine
{
    Sw = (1 << 1), ///< Растеризатор CPU.
    Gl = (1 << 2), ///< Растеризатор OpenGL.
    Wg = (1 << 3), ///< Растеризатор WebGPU.  @since0,15
};


/**
 * @brief Перечисление, указывающее значение типа класса ThorVG.
 *
 * Объекты рисования ThorVG могут возвращать значения типа класса, что позволяет вам определять конкретный класс каждого объекта.
 *
 * @see Краска:: type()
 * @see Заполнить:: type()
 *
 * @note Экспериментальный API
 */
enum class Type : uint8_t
{
    Undefined = 0,         ///< Неизвестный класс
    Shape,                 ///< Класс формы
    Scene,                 ///< Класс сцены
    Picture,               ///< Класс изображения
    Text,                  ///< Текстовый класс
    LinearGradient = 10,   ///< Класс LinearGradient
    RadialGradient         ///< Класс RadialGradient
};


/**
 * @brief Структура данных, представляющая точку в двумерном пространстве.
 */
struct Point
{
    float x, y;
};


/**
 * @brief Структура данных, представляющая трехмерную матрицу.
 *
 * Элементы e11, e12, e21 и e22 представляют матрицу вращения, включая коэффициент масштабирования.
 * Элементы e13 и e23 определяют перемещение объекта по осям x и y соответственно.
 * Элементы e31 и e32 установлены в 0, e33 — в 1.
 */
struct Matrix
{
    float e11, e12, e13;
    float e21, e22, e23;
    float e31, e32, e33;
};


/**
 * @class Краска
 *
 * @brief Абстрактный класс для управления графическими элементами.
 *
 * Графический элемент вTVG— это любой объект, составленный в Canvas.
 * Paint представляет собой такой графический объект и его поведение, такое как дублирование, преобразование и композиция.
 * TVG рекомендует пользователю рассматривать набор портативных команд. Они могут подготовить Paint, а затем запросить Canvas для их запуска.
 */
class TVG_API Paint
{
public:
    virtual ~Paint();

    /**
     * @brief Устанавливает угол, на который поворачивается объект.
     *
     * Угол измеряется по часовой стрелке от горизонтальной оси.
     * Ось вращения проходит через точку на объекте с нулевыми координатами.
     *
     * @param [in] градус Значение угла в градусах.
     *
     * @retval Result::InsufficientCondition в случае применения пользовательского преобразования.
     * @see Краска:: transform()
     */
    Result rotate(float degree) noexcept;

    /**
     * @brief Устанавливает значение масштаба объекта.
     *
     * @param Коэффициент [in] Значение коэффициента масштабирования. Значение по умолчанию — 1.
     *
     * @retval Result::InsufficientCondition в случае применения пользовательского преобразования.
     * @see Краска:: transform()
     */
    Result scale(float factor) noexcept;

    /**
     * @brief Устанавливает значения, на которые объект перемещается в двумерном пространстве.
     *
     * Начало системы координат находится в верхнем левом углу холста.
     * Горизонтальная и вертикальная оси указывают вправо и вниз соответственно.
     *
     * @param [in] x Значение горизонтального сдвига.
     * @param [in] y Значение вертикального смещения.
     *
     * @retval Result::InsufficientCondition в случае применения пользовательского преобразования.
     * @see Краска:: transform()
     */
    Result translate(float x, float y) noexcept;

    /**
     * @brief Устанавливает матрицу аффинного преобразования для объекта.
     *
     * Ожидается получение расширенной матрицы преобразования.
     *
     * @param [дюймы] м Расширенная матрица 3х3.
     */
    Result transform(const Matrix& m) noexcept;

    /**
     * @brief Получает матрицу аффинного преобразования объекта.
     *
     * Значения матрицы могут быть установлены с помощьюtransform()API, а также с помощью translate(),
     * scale() иrotate(). Если преобразование не было применено, возвращается единственная матрица.
     *
     * @return Расширенная матрица преобразования.
     *
     * @since 0.4
     */
    Matrix transform() noexcept;

    /**
     * @brief Устанавливает непрозрачность объекта.
     *
     * @param [in] o Значение непрозрачности в диапазоне [0 ~ 255], где 0 — полная прозрачность, а 255 — непрозрачность.
     *
     * @note Установка непрозрачности с помощью этогоAPIможет потребовать нескольких проходов рендеринга для композиции. По возможности рекомендуется избегать изменения непрозрачности.
     */
    Result opacity(uint8_t o) noexcept;

    /**
     * @brief Устанавливает целевой объект композиции и метод композиции.
     *
     * @param [in] target Краска целевого объекта.
     * @param [in] метод Метод, используемый для объединения исходного объекта с целевыми.
     */
    Result composite(std::unique_ptr<Paint> target, CompositeMethod method) noexcept;

    /**
     * @brief Вырежьте область рисования объекта рисования.
     *
     * Эта функция ограничивает область рисования объекта рисования путями указанной фигуры.
     *
     * @param [in] Clipper Объект формы в качестве обрезки.
     *
     * @retval Результат::NonSupport Если тип клиппера@pотличается от Shape.
     *
     * @note Машинка для стрижки@pподдерживает только тип Shape.
     * @note Экспериментальный API
     */
    Result clip(std::unique_ptr<Paint> clipper) noexcept;

    /**
     * @brief Устанавливает метод смешивания для объекта рисования.
     *
     * Функция смешивания позволяет комбинировать цвета для создания визуально привлекательных эффектов, включая, среди прочего, прозрачность, освещение, затенение и смешивание цветов.
     * его процесс включает в себя сочетание цветов или изображений исходного объекта рисования с целевым (изображением нижнего слоя) с использованием операций смешивания.
     * Операция определения определяется выбранным@pBlendMethod, который определяет, как комбинируются цвета или изображения.
     *
     * @param [in] метод Устанавливаемый метод колебания.
     *
     * @note Экспериментальный API
     */
    Result blend(BlendMethod method) noexcept;

    /**
     * @deprecated Вместо этого используйте границы (float* x, float* y, float* w, float* h, bool преобразованный)
     */
    TVG_DEPRECATED Result bounds(float* x, float* y, float* w, float* h) const noexcept;

    /**
     * @brief Получает выровненную по оси ограничивающую рамку объекта рисования.
     *
     * @param [out] x Координата X верхнего левого угла объекта.
     * @param [out] y Координата Y верхнего левого угла объекта.
     * @param [out] w Ширина объекта.
     * @param [out] h Высота объекта.
     * @param [in] Transformed Если@ctrue, конвертировать сцены будут на сцене, к которой она принадлежит. В противном случае это не так.
     *
     * @note Это полезно, когда вам нужно определить ограничивающую рамку краски в пространстве холста.
     * @note Ограничивающая рамка не указывает фактическую область рисования. Это наименьший прямоугольник, заключающий объект.
     * @note Если преобразование@pимеет значение@ctrue, краску необходимо перенести на холст и обновить перед вызовом этого API.
     * @see Холст:: update()
     */
    Result bounds(float* x, float* y, float* w, float* h, bool transformed) const noexcept;

    /**
     * @brief Дублирует объект.
     *
     * Создает новый объект и устанавливает все его свойства как в исходном объекте.
     *
     * @return Созданный объект в случае успеха, в противном случае@cnullptr.
     */
    Paint* duplicate() const noexcept;

    /**
     * @brief Получает значение непрозрачности объекта.
     *
     * @return Значение непрозрачности в диапазоне [0 ~ 255], где 0 — полностью прозрачный, а 255 — непрозрачный.
     */
    uint8_t opacity() const noexcept;

    /**
     * @brief Получает целевой объект композиции и метод композиции.
     *
     * @param [out] target Краска целевого объекта.
     *
     * @return Метод, используемый для объединения исходного объекта с целевым.
     *
     * @since 0,5
     */
    CompositeMethod composite(const Paint** target) const noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра Paint.
     *
     * @since Экспериментальный API
     */
    virtual Type type() const noexcept = 0;

    /**
     * @brief УникальныйIDэтого экземпляра.
     *
     * Это зарезервировано для указания экземпляра рисования в сцене.
     *
     * @since Экспериментальный API
     */
    uint32_t id = 0;

    /**
     * @see Краска:: type()
     */
    TVG_DEPRECATED uint32_t identifier() const noexcept;

    _TVG_DECLARE_PRIVATE(Paint);
};


/**
 * @class Заполнить
 *
 * @brief Абстрактный класс, представляющий градиентную заливку объекта Shape.
 *
 * Содержит информацию о цветах градиента и их расположении.
 * внутри границ градиента. Границы градиентов науки в LinearGradient.
 * или класс RadialGradient, в зависимости от типа используемого градиента.
 * Он определяет поведение градиента в случае, если область, определяемая границами градиента,
 * меньше площади, подлежащей заполнению.
 */
class TVG_API Fill
{
public:
    /**
     * @brief Структура данных, хранящая информацию о цвете и его относительном положении внутри границ градиента.
     */
    struct ColorStop
    {
        float offset; /**< The relative position of the color. */
        uint8_t r;    /**< The red color channel value in the range [0 ~ 255]. */
        uint8_t g;    /**< The green color channel value in the range [0 ~ 255]. */
        uint8_t b;    /**< The blue color channel value in the range [0 ~ 255]. */
        uint8_t a;    /**< The alpha channel value in the range [0 ~ 255], where 0 is completely transparent and 255 is opaque. */
    };

    virtual ~Fill();

    /**
     * @brief Устанавливает параметры цветов градиента и их положение.
     *
     * @param [in] colorStops Массивная структура данных ColorStop.
     * @param [in] cnt Счетчик массива colorStops@p, необходимое количество цветов, эффект в градиенте.
     */
    Result colorStops(const ColorStop* colorStops, uint32_t cnt) noexcept;

    /**
     * @brief Устанавливает значение FillSpread, которое определяет, как заполнить область за пределами границ градиента.
     *
     * @param [in] s Значение FillSpread.
     */
    Result spread(FillSpread s) noexcept;

    /**
     * @brief Устанавливает матрицу аффинного преобразования для градиентной заливки.
     *
     * Ожидается получение расширенной матрицы преобразования.
     *
     * @param [дюймы] м Расширенная матрица 3х3.
     */
    Result transform(const Matrix& m) noexcept;

    /**
     * @brief Получает параметры цветов градиента, их положение и количество.
     *
     * @param [out] colorStops Указатель на ячейку памяти, где сохраняется массив градиента ColorStop.
     *
     * @return Количество цветов, используемых в градиенте. Это значение соответствует длине массива colorStops @p.
     */
    uint32_t colorStops(const ColorStop** colorStops) const noexcept;

    /**
     * @brief Получает значение FillSpread заливки.
     *
     * @return Значение FillSpread этого Fill.
     */
    FillSpread spread() const noexcept;

    /**
     * @brief Получает матрицу аффинного преобразования градиентной заливки.
     *
     * Если преобразование не применялось, возвращается единичная матрица.
     *
     * @return Расширенная матрица преобразования.
     */
    Matrix transform() const noexcept;

    /**
     * @brief Создает копию объекта Fill.
     *
     * Верните вновь созданный объект. Заполните его, скопировав из оригинала.
     *
     * @return Скопированный объект Fill в случае успеха, в противном случае@cnullptr.
     */
    Fill* duplicate() const noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра Fill.
     *
     * @since Экспериментальный API
     */
    virtual Type type() const noexcept = 0;

    /**
     * @see Заполнить:: type()
     */
    TVG_DEPRECATED uint32_t identifier() const noexcept;

    _TVG_DECLARE_PRIVATE(Fill);
};


/**
 * @class Холст
 *
 * @brief Абстрактный класс для рисования графических элементов.
 *
 * Холст — это объект, связанный с рисованием цели. Он настраивает механизм рисования и буфер, которым можно рисовать на экране. Он также управляет заданными объектами Paint.
 *
 * @note Поведение Canvas зависит от растрового движка, хотя ожидается, что окончательное содержимое буфера будет идентичным.
 * @warning Объекты Paint, принадлежащие одному холсту, не могут использоваться несколькими холстами.
 */
class TVG_API Canvas
{
public:
    Canvas(RenderMethod*);
    virtual ~Canvas();

    TVG_DEPRECATED Result reserve(uint32_t n) noexcept;

    /**
     * @brief Возвращает список красок, которые в данный момент хранятся на Canvas.
     *
     * Эта функция предоставляет список узлов рисования, предоставляя пользователям прямую возможность изменять дерево сцены.
     *
     * @warning Пожалуйста, избегайте доступа к краскам во время обновления/рисования Canvas. Вы можете получить к ним доступ после вызова sync().
     * @see Холст:: sync()
     *
     * @note Экспериментальный API
     */
    std::list<Paint*>& paints() noexcept;

    /**
     * @brief Передает элементы рисования на холст с помощью объектов Paint.
     *
     * Только нарисованные на холсте краски будут целями рисования.
     * Они расположены на заднем плане до тех пор, пока вы не вызовете Canvas::clear().
     *
     * @param [in] Paint Объект Paint, который нужно нарисовать.
     *
     * @retval Result::MemoryCorruption В случае, если в качестве аргумента передается нулевой параметр @c.
     *
     * @note Порядок нанесения красок такой же, как и порядок их нанесения на холст. Если вы собираетесь использовать слои, рассмотрите возможность сортировки красок перед тем, как их раскладывать.
     * @see Холст:: paints()
     * @see Холст:: clear()
     */
    virtual Result push(std::unique_ptr<Paint> paint) noexcept;

    /**
     * @brief Очистите внутренние ресурсы холста, использованные для рисунка.
     *
     * Этот API устанавливает общее количество красок, помещенных на холст, в ноль.
     * В зависимости от значений аргумента свободные@pкраски либо освобождаются, либо используются.
     * Поэтому, если вам необходимо обновить свойства рисования, сохраняя эту модель сцены, вы можете установить@pfree = false.
     *
     * @param [in] free Если@ctrue, память, занятая красками, освобождается, в противном случае — нет.
     *
     *
     * @see Холст:: push()
     * @see Холст:: paints()
     */
    virtual Result clear(bool free = true) noexcept;

    /**
     * @brief Запросите холст для обновления объектов рисования.
     *
     * Если применяется нулевой параметр@c, все объекты рисования, сохраняющие Canvas, обновляются.
     * в противном случае только краска, на которую указывает данная краска @p.
     *
     * @param [in] Paint Указатель на объект Paint или@cnullptr.
     *
     * @note Поведение обновления может быть асинхронным, если назначенный номер потока больше нуля.
     */
    virtual Result update(Paint* paint = nullptr) noexcept;

    /**
     * @brief Запрашивает холст для рисования объектов Paint.
     *
     * @note Рисование может быть асинхронным, если назначенный номер потока больше нуля. Чтобы гарантировать, что рисунок готов, после этого позвоните sync().
     * @see Холст:: sync()
     */
    virtual Result draw() noexcept;

    /**
     * @brief Устанавливает область рисования на холсте.
     *
     * Эта функция определяет прямоугольную область холста, которая будет использоваться для операций рисования.
     * Указанный область просмотра используется для обрезки вывода рендеринга по границам прямоугольника.
     *
     * @param [in] x Координата X верхнего левого угла прямоугольника.
     * @param [in] y Координата Y верхнего левого угла прямоугольника.
     * @param [in] w Ширина прямоугольника.
     * @param [in] h Высота прямоугольника.
     *
     * @see Свканвас:: target()
     * @see Глканвас:: target()
     * @see Вгканвас:: target()
     *
     * @warning Не разрешается менять область просмотра во время Canvas::push()- Canvas::sync()или Canvas::update()- Canvas::sync().
     *
     * @note При сбросе цели область просмотра также будет сброшена до целевого размера.
     * @since 0,15
     */
    virtual Result viewport(int32_t x, int32_t y, int32_t w, int32_t h) noexcept;

    /**
     * @brief Гарантирует, что задача рисования завершена.
     *
     * Рендеринг Canvas может выполняться асинхронно. Чтобы убедиться, что рендеринг завершен,
     * sync() должен перейти послеdraw()независимо от потока.
     *
     * @retval Result::InsufficientCondition: холст либо уже находится в состоянии синхронизации, либо поврежден (перед синхронизацией требуется отрисовка).
     *
     * @see Холст:: draw()
     */
    virtual Result sync() noexcept;

    _TVG_DECLARE_PRIVATE(Canvas);
};


/**
 * @class Линейный градиент
 *
 * @brief Класс, представляющий линейную градиентную заливку объекта Shape.
 *
 * ПомимоAPI, независимо от класса Fill, он позволяет сохранять и получать границы линейного градиента.
 * Поведение за пределами границ градиента зависит от значения, указанного в разбросе API.
 */
class TVG_API LinearGradient final : public Fill
{
public:
    ~LinearGradient();

    /**
     * @brief Устанавливает границы линейного градиента.
     *
     * Границы линейного градиента определяются как поверхность, ограниченная двумя параллельными линиями, пересекающими
     * заданные точки ( @p x1, @p y1) и ( @p x2, @p y2) соответственно. Обе линии перпендикулярны линии, соединяющей
     * ( @p x1, @p y1) и ( @p x2, @p y2).
     *
     * @param [in] x1 Горизонтальная координата первой точки, используемая для определения границ градиента.
     * @param [in] y1 Вертикальная координата первой точки, используемой для определения границ градиента.
     * @param [in] x2 Горизонтальная координата второй точки, используемая для определения границ градиента.
     * @param [in] y2 Вертикальная координата второй точки, используемая для определения границ градиента.
     *
     * @note Если первая и вторая точки равны, объект заполняется одним цветом, используя последний цвет, указанный в colorStops().
     * @see Заполнить:: colorStops()
     */
    Result linear(float x1, float y1, float x2, float y2) noexcept;

    /**
     * @brief Получает границы линейного градиента.
     *
     * Границы линейного градиента определяются как поверхность, ограниченная двумя параллельными линиями, пересекающими
     * заданные точки ( @p x1, @p y1) и ( @p x2, @p y2) соответственно. Обе линии перпендикулярны линии, соединяющей
     * ( @p x1, @p y1) и ( @p x2, @p y2).
     *
     * @param [out] x1 Горизонтальная координата первой точки, используемой для определения границ градиента.
     * @param [out] y1 Вертикальная координата первой точки, используемой для определения границ градиента.
     * @param [out] x2 Горизонтальная координата второй точки, используемая для определения границ градиента.
     * @param [out] y2 Вертикальная координата второй точки, используемая для определения границ градиента.
     */
    Result linear(float* x1, float* y1, float* x2, float* y2) const noexcept;

    /**
     * @brief Создает новый объект LinearGradient.
     *
     * @return Новый объект LinearGradient.
     */
    static std::unique_ptr<LinearGradient> gen() noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра LinearGradient.
     *
     * @since Экспериментальный API
     */
    Type type() const noexcept override;

    /**
     * @see ЛинейарГрадиент:: type()
     */
    TVG_DEPRECATED static uint32_t identifier() noexcept;

    _TVG_DECLARE_PRIVATE(LinearGradient);
};


/**
 * @class Радиальный градиент
 *
 * @brief Класс, представляющий радиальную градиентную заливку объекта Shape.
 *
 */
class TVG_API RadialGradient final : public Fill
{
public:
    ~RadialGradient();

    /**
     * @brief Устанавливает границы радиального градиента.
     *
     * Границы радиального градиента определяются как окружность с центром в заданной точке ( @p cx, @p cy) заданного радиуса.
     *
     * @param [in] cx Горизонтальная координата центра ограничивающего круга.
     * @param [in] cy Вертикальная координата центра ограничивающего круга.
     * @param [дюйм] радиус Радиус ограничивающего круга.
     *
     * @retval Result::InvalidArguments в случае, если значение радиуса@pравно нулю или меньше.
     *
     * @note Если радиус@pравен нулю, объект заполняется одним цветом, используя последний цвет, указанный в colorStops().
     */
    Result radial(float cx, float cy, float radius) noexcept;

    /**
     * @brief Получает границы радиального градиента.
     *
     * Границы радиального градиента определяются как окружность с центром в заданной точке ( @p cx, @p cy) заданного радиуса.
     *
     * @param [out] cx Горизонтальная координата центра ограничивающего круга.
     * @param [out] cy Вертикальная координата центра ограничивающего круга.
     * @param [out] radius Радиус ограничивающего круга.
     *
     */
    Result radial(float* cx, float* cy, float* radius) const noexcept;

    /**
     * @brief Создает новый объект RadialGradient.
     *
     * @return Новый объект RadialGradient.
     */
    static std::unique_ptr<RadialGradient> gen() noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра LinearGradient.
     *
     * @since Экспериментальный API
     */
    Type type() const noexcept override;

    /**
     * @see РадиалГрадиент:: type()
     */
    TVG_DEPRECATED static uint32_t identifier() noexcept;

    _TVG_DECLARE_PRIVATE(RadialGradient);
};


/**
 * Форма @class
 *
 * @brief Класс, представляющий двумерные фигуры и их свойства.
 *
 * Форма имеет три основных свойства: контур фигуры, обводка, заполнение. Контур фигуры сохраняется как путь.
 * Путь может быть составлен путем сбора примитивных команд, таких как moveTo(), lineTo(), cubicTo(), или полных форм интерфейсов, таких как appendRect(),appendCircle()и т. д. д.
 * Путь может состоять из подпутей. Один подпуть определяется командой закрытия.
 *
 * Обводка Форма — это необязательное свойство, если фигуру необходимо представить с контурными границами или без них.
 * Это эффективно, поскольку путь формы и путь обводки можно использовать совместно. Это также удобно при управлении обоими в одном контексте.
 */
class TVG_API Shape final : public Paint
{
public:
    ~Shape();

    /**
     * @brief Сбрасывает путь фигуры.
     *
     * Свойства матрицы преобразования, цвета, заливки и обводки сохраняются.
     *
     * @note Память, в которой хранятся данные пути, на этом этапе не освобождается для обеспечения кэширования.
     */
    Result reset() noexcept;

    /**
     * @brief Устанавливает начальную точку подпути.
     *
     * Значение текущей точки устанавливается в данную точку.
     *
     * @param [in] x Горизонтальная координата начальной точки подпути.
     * @param [in] y Вертикальная координата начальной точки подпути.
     */
    Result moveTo(float x, float y) noexcept;

    /**
     * @brief Добавляет новую точку к подпути, в результате чего рисуется линия от текущей точки до заданной конечной точки.
     *
     * Значение текущей точки устанавливается в заданную конечную точку.
     *
     * @param [in] x Горизонтальная координата конечной точки линии.
     * @param [in] y Вертикальная координата конечной точки линии.
     *
     * @note Если это первая команда в пути, она соответствует вызову moveTo().
     */
    Result lineTo(float x, float y) noexcept;

    /**
     * @brief Добавляет новые точки к подпути, в результате чего начинается рисование кубической кривой Безье.
     * в текущей точке и заканчивая в заданной конечной точке ( @p x, @p y) с использованием контрольных точек ( @p cx1, @p cy1) и ( @p cx2, @p cy2).
     *
     * Значение текущей точки устанавливается в заданную конечную точку.
     *
     * @param [in] cx1 Горизонтальная координата первой контрольной точки.
     * @param [in] cy1 Вертикальная координата первой контрольной точки.
     * @param [in] cx2 Горизонтальная координата второй контрольной точки.
     * @param [in] cy2 Вертикальная координата второй контрольной точки.
     * @param [in] x Горизонтальная координата конечной точки кривой.
     * @param [in] y Вертикальная координата конечной точки кривой.
     *
     * @note Если это первая команда в пути, данные из пути не отображаются.
     */
    Result cubicTo(float cx1, float cy1, float cx2, float cy2, float x, float y) noexcept;

    /**
     * @brief Закрывает текущий вложенный путь, рисуя линию от текущей точки до начальной точки вложенного пути.
     *
     * Значение текущей точки устанавливается в начальную точку замкнутого подпути.
     *
     * @note Если подпуть не содержит точек, эта функция не действует.
     */
    Result close() noexcept;

    /**
     * @brief Добавляет прямоугольник к пути.
     *
     * Прямоугольник с закругленными углами можно получить, установив ненулевые значения для аргументов @p rx и @p ry.
     * Значения @p rx и @p ry определяют радиусы эллипса, определяющие скругление углов.
     *
     * Положение прямоугольника задается координатами его верхнего левого угла — аргументами @p x и @p y.
     *
     * Прямоугольник рассматривается как новый подпуть — он не связан с предыдущим подпутем.
     *
     * Значение текущей точки устанавливается на ( @p x + @p rx, @p y) - в случае, если @p rx больше
     * чем @p w/2, текущая точка устанавливается на ( @p x + @p w/2, @p y)
     *
     * @param [in] x Горизонтальная координата верхнего левого угла прямоугольника.
     * @param [in] y Вертикальная координата верхнего левого угла прямоугольника.
     * @param [in] w Ширина прямоугольника.
     * @param [in] h Высота прямоугольника.
     * @param [in] rx Радиус эллипса по оси X, определяющий закругленные углы прямоугольника.
     * @param [in] ry Радиус эллипса по оси Y, определяющий закругленные углы прямоугольника.
     *
     * @note Если@prx и@pry больше или равны половине@pw и половине@ph соответственно, форма становится эллипсом.
     */
    Result appendRect(float x, float y, float w, float h, float rx = 0, float ry = 0) noexcept;

    /**
     * @brief Добавляет эллипс к пути.
     *
     * Положение эллипса задается координатами его центра — аргументами @p cx и @p cy.
     *
     * Эллипс рассматривается как новый подпуть — он не связан с предыдущим подпутем.
     *
     * Значение текущей точки установлено на ( @p cx, @p cy - @p ry).
     *
     * @param [in] cx Горизонтальная координата центра эллипса.
     * @param [in] cy Вертикальная координата центра эллипса.
     * @param [in] rx Радиус эллипса по оси X.
     * @param [in] ry Радиус эллипса по оси Y.
     *
     */
    Result appendCircle(float cx, float cy, float rx, float ry) noexcept;

    /**
     * @brief Добавляет к пути дугу окружности.
     *
     * Дуга рассматривается как новый подпуть - она не связана с предыдущим подпутем.
     * Текущее значение точки задается в конечных точках дуги, если круговая диаграмма@pимеет значение@cfalse, и в центре дуги в случае отказа.
     *
     * @param [in] cx Горизонтальная координата центра дуги.
     * @param [in] cy Вертикальная координата центра дуги.
     * @param [дюймы] радиус Радиус дуги.
     * @param [in] startAngle Начальный угол дуги, заданный в градусах и измеренный против часовой стрелки от горизонтальной линии.
     * @param [in] развертка Центрального угла дуги, заданного в градусах и направленного против часовой стрелки от@pstartAngle.
     * @param [in] круговая диаграмма Определяет, следует ли рисовать радиусы от центра дуги до ее конечных точек — рисуется, если@cистинно.
     *
     * @note Установка значения развертки@pболее 360 градусов эквивалентна вызову addCircle(cx, cy, radius, radius).
     */
    Result appendArc(float cx, float cy, float radius, float startAngle, float sweep, bool pie) noexcept;

    /**
     * @brief Добавляет заданный подпуть к пути.
     *
     * Текущее значение точки устанавливается на последнюю точку подпути.
     * Для каждой команды из cmds-массива@pнеобходимо указать количество точек в массиве@ppts.
     * Если количество точек в массиве точек@pотличается от количества, требуемого массивом cmds@p, фигура с этим подпутем не будет находиться на экране Google.
     *
     * @param [in] cmds Массив команд в подпути.
     * @param [in] cmdCnt Количество команд подпути.
     * @param [in] pts Массив двумерных точек.
     * @param [in] ptsCnt Число точек в массиве@ppts.
     *
     * @note Интерфейс разработан для оптимальной настройки пути, если у вызывающего объекта уже есть завершенные команды пути.
     */
    Result appendPath(const PathCommand* cmds, uint32_t cmdCnt, const Point* pts, uint32_t ptsCnt) noexcept;

    /**
     * @brief Устанавливает ширину обводки для всех фигур контура.
     *
     * @param [дюймы] Ширина Ширина обводки. Значение по умолчанию — 0.
     *
     */
    Result stroke(float width) noexcept;

    /**
     * @brief Устанавливает цвет обводки для всех фигур на пути.
     *
     * @param [in] r Значение канала красного цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] g Значение канала зеленого цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] b Значение канала синего цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] a Значение альфа-канала в диапазоне [0 ~ 255], где 0 — полностью прозрачный, а 255 — непрозрачный. Значение по умолчанию — 0.
     *
     */
    Result stroke(uint8_t r, uint8_t g, uint8_t b, uint8_t a = 255) noexcept;

    /**
     * @brief Устанавливает градиентную заливку обводки для всех фигур контура.
     *
     * @param [in] f Градиентная заливка.
     *
     * @retval Result::MemoryCorruption В случае, если в качестве аргумента передается нулевой параметр @c.
     */
    Result stroke(std::unique_ptr<Fill> f) noexcept;

    /**
     * @brief Устанавливает штриховой рисунок обводки.
     *
     * @param [in] DashPattern Массив последовательных парных значений длины штриха и длины пробела.
     * @param [in] cnt Длина массива DashPattern@p.
     *
     * @retval Result::InvalidArguments Если@pDashPattern имеет значение@cnullptr и@pcnt > 0,@pcnt равен нулю, любое из значений шаблона штриха равно нулю или меньше.
     *
     * @note Чтобы сбросить образец штрихового штриха, передайте@cnullptr в@pDashPattern и ноль в@pcnt.
     * @warning @p cnt должно быть больше 1, если образец штриха действителен.
     */
    Result stroke(const float* dashPattern, uint32_t cnt) noexcept;

    /**
     * @brief Устанавливает стиль окончания обводки в открытых подпутях.
     *
     * @param [in] cap Значение стиля шапки. Значение по умолчанию —@cStrokeCap::Square.
     *
     */
    Result stroke(StrokeCap cap) noexcept;

    /**
     * @brief Задает стиль соединения для обведенных сегментов пути.
     *
     * Стиль соединения используется для соединения двух сегментов линии при обводке пути.
     *
     * @param [in] join Значение стиля соединений. Значение по умолчанию —@cStrokeJoin::Bevel.
     *
     */
    Result stroke(StrokeJoin join) noexcept;

    /**
     * @brief Устанавливает предел хода.
     *
     * @param [in] miterlimit Miterlimit накладывает ограничение на размер соединений штрихов, когда установлен стиль соединения@cStrokeJoin::Miter. Значение по умолчанию — 4.
     *
     * @retval Result::InvalidArgument для значений предела скоса@pменьше нуля.
     *
     * @since 0.11
     */
    Result strokeMiterlimit(float miterlimit) noexcept;

    /**
     * @brief Устанавливает обрезку обводки вдоль определенного сегмента пути, позволяя контролировать, какая часть обводки будет видна.
     *
     * Если значения аргументов@pBegin и@pEnd превышают диапазон 0–1, они переносятся соответственно переносу под углом, эффективно рассматривая диапазон как круговой.
     *
     * @param [in] начало Указывает начало сегмента, отображаемого по пути.
     * @param [in] end Указывает конец сегмента, отображаемого вдоль пути.
     * @param [in] одновременно определяет, как обрезать несколько контуров внутри одной фигуры. Если установлено значение@ctrue (по умолчанию), обрезка применяется одновременно ко всем путям;
     * В противном случае все пути рассматриваются как единый объект с общей длиной, равной сумме их отдельных длин, и обрезаются как таковые.
     *
     * @note Экспериментальный API
     */
    Result strokeTrim(float begin, float end, bool simultaneous = true) noexcept;

    /**
     * @brief Устанавливает сплошной цвет для всех фигур на пути.
     *
     * Части фигуры, определенные как внутренние, окрашены.
     *
     * @param [in] r Значение канала красного цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] g Значение канала зеленого цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] b Значение канала синего цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] a Значение альфа-канала в диапазоне [0 ~ 255], где 0 — полностью прозрачный, а 255 — непрозрачный. Значение по умолчанию — 0.
     *
     * @note Применяется либо сплошной цвет, либо градиентная заливка, в зависимости от того, что было установлено последним.
     */
    Result fill(uint8_t r, uint8_t g, uint8_t b, uint8_t a = 255) noexcept;

    /**
     * @brief Устанавливает градиентную заливку для всех фигур контура.
     *
     * Части фигуры, определенные как внутренние, заполняются.
     *
     * @param [in] f Уникальный указатель на градиентную заливку.
     *
     * @note Применяется либо сплошной цвет, либо градиентная заливка, в зависимости от того, что было установлено последним.
     */
    Result fill(std::unique_ptr<Fill> f) noexcept;

    /**
     * @brief Устанавливает правило заливки для объекта Shape.
     *
     * @param [in] r Значение правил помогает. Значение по умолчанию —@cFillRule::Winding.
     */
    Result fill(FillRule r) noexcept;

    /**
     * @brief Устанавливает порядок отрисовки обводки и заливки.
     *
     * @param [in]strokeFirst Если@ctrue, обводка отображается перед заливкой, в противном случае обводка отображается как вторая (параметр по умолчанию).
     *
     * @since 0.10
     */
    Result order(bool strokeFirst) noexcept;

    /**
     * @brief Получает данные команд пути.
     *
     * @param [out] cmds Указатель на массив команд из пути.
     *
     * @return Длина массива cmds@pв случае успеха, в противном случае — ноль.
     */
    uint32_t pathCommands(const PathCommand** cmds) const noexcept;

    /**
     * @brief Получает значения точек пути.
     *
     * @param [out] pts Указатель на массив двумерных точек пути.
     *
     * @return Длина массива точек@pв случае успеха, в противном случае равна нулю.
     */
    uint32_t pathCoords(const Point** pts) const noexcept;

    /**
     * @brief Получает указатель на градиентную заливку фигуры.
     *
     * @return Указатель на градиентную заливку обводки в случае успеха,@cnullptr в случае, если заливка не была установлена.
     */
    const Fill* fill() const noexcept;

    /**
     * @brief Получает сплошной цвет фигуры.
     *
     * @param [out] r Значение канала красного цвета в диапазоне [0 ~ 255].
     * @param [out] g Значение канала зеленого цвета в диапазоне [0 ~ 255].
     * @param [out] b Значение канала синего цвета в диапазоне [0 ~ 255].
     * @param [out] a Значение альфа-канала в диапазоне [0 ~ 255], где 0 — полностью прозрачный, а 255 — непрозрачный.
     *
     */
    Result fillColor(uint8_t* r, uint8_t* g, uint8_t* b, uint8_t* a = nullptr) const noexcept;

    /**
     * @brief Получает значение правила заполнения.
     *
     * @return Значение правила заливки фигуры.
     */
    FillRule fillRule() const noexcept;

    /**
     * @brief Получает ширину штриха.
     *
     * @return Значение ширины обводки в случае успеха, ноль, если обводка не была установлена.
     */
    float strokeWidth() const noexcept;

    /**
     * @brief Получает цвет обводки фигуры.
     *
     * @param [out] r Значение канала красного цвета в диапазоне [0 ~ 255].
     * @param [out] g Значение канала зеленого цвета в диапазоне [0 ~ 255].
     * @param [out] b Значение канала синего цвета в диапазоне [0 ~ 255].
     * @param [out] a Значение альфа-канала в диапазоне [0 ~ 255], где 0 — полностью прозрачный, а 255 — непрозрачный.
     *
     */
    Result strokeColor(uint8_t* r, uint8_t* g, uint8_t* b, uint8_t* a = nullptr) const noexcept;

    /**
     * @brief Получает указатель на градиентную заливку обводки.
     *
     * @return Указатель на градиентную заливку обводки в случае успеха, в противном случае@cnullptr.
     */
    const Fill* strokeFill() const noexcept;

    /**
     * @brief Получает штриховой образец обводки.
     *
     * @param [out] DashPattern Указатель на память, где хранится массив образцов штрихов.
     *
     * @return Длина массива DashPattern @p.
     */
    uint32_t strokeDash(const float** dashPattern) const noexcept;

    /**
     * @brief Получает стиль окончания, используемый для обводки пути.
     *
     * @return Значение стиля штриха.
     */
    StrokeCap strokeCap() const noexcept;

    /**
     * @brief Получает значение стиля соединения, используемое для обводки пути.
     *
     * @return Значение стиля соединения обводки.
     */
    StrokeJoin strokeJoin() const noexcept;

    /**
     * @brief Получает предел хода митры.
     *
     * @return Значение ограничения хода в случае успеха, 4, если ход не был установлен.
     *
     * @since 0.11
     */
    float strokeMiterlimit() const noexcept;

    /**
     * @brief Создает новый объект Shape.
     *
     * @return Новый объект Shape.
     */
    static std::unique_ptr<Shape> gen() noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра Shape.
     *
     * @since Экспериментальный API
     */
    Type type() const noexcept override;

    /**
     * @see Форма:: ЗСК0КСЗ
     */
    TVG_DEPRECATED static uint32_t identifier() noexcept;

    _TVG_DECLARE_PRIVATE(Shape);
};


/**
 * @class Изображение
 *
 * @brief Класс, представляющий изображение, прочитанное в одном из поддерживаемых форматов: raw, svg, png, jpg, lottie(json) и т. д.
 * Помимо методов, унаследованных от Paint, он предоставляет методы для загрузки и рисования изображений на холсте.
 *
 * @note Поддерживаемые форматы зависят от доступных загрузчиков TVG.
 * @note См. Класс анимации, если данные изображения можно анимировать.
 */
class TVG_API Picture final : public Paint
{
public:
    ~Picture();

    /**
     * @brief Загружает данные изображения непосредственно из файла.
     *
     * ThorVG эффективно кэширует загруженные данные, используя указанный путь@pв качестве ключа.
     * Это означает, что повторная загрузка того же файла не приведет к дублированию операций;
     * вместо этого ThorVG будет повторно использовать ранее загруженные данные изображения.
     *
     * @param [in] путь Путь к файлу изображения.
     *
     * @retval Result::InvalidArguments В случае, если путь@pнедействителен.
     * @retval Результат::NonSupport При попытке загрузить файл с неизвестным расширением.
     *
     * @note Поведение загрузки может быть асинхронным, если назначенный номер потока больше нуля.
     * @see Инициализатор:: init()
     */
    Result load(const std::string& path) noexcept;

    /**
     * @deprecated Вместо этого используйте load(const char* data, размер uint32_t, const std::string& mimeType, bool copy).
     */
    TVG_DEPRECATED Result load(const char* data, uint32_t size, bool copy = false) noexcept;

    /**
     * @brief Загружает данные изображения из блока памяти заданного размера.
     *
     * ThorVG эффективно кэширует загруженные данные, используя указанный адрес данных@pв качестве ключа.
     * когда копия@pимеет@cfalse. Это означает, что повторная загрузка тех же данных не приводит к дублированию операций.
     * для общих данных@p. Вместо этого ThorVG будет повторно использовать ранее загруженные данные изображения.
     *
     * @param [in] data Указатель на ячейку памяти, где хранятся стандартные файлы изображений. Для недвоичных данных выведите строку с нулевым завершением, если копия@pимеет значение@cfalse.
     * @param [in] size Размер в байтах памяти, занимаемой данными @p.
     * @param [in] mimeType Mimetype или расширение данных, например «jpg», «jpeg», «lottie», «svg», «svg+xml», «png» и т. д. д. Если указана пустая строка или неизвестный тип, загрузчики будут проверены один за другим.
     * @param [in] copy Если@ctrue, данные копируются в локальный буферный механизм, в противном случае — нет.
     *
     * @retval Result::InvalidArguments В случае, если данные не предоставлены или размер@pравен нулю или меньше.
     * @retval Результат::NonSupport При попытке загрузить файл с неизвестным расширением.
     *
     * @warning Пользователь несет ответственность за освобождение памяти данных @p.
     *
     * @note Если вы не уверены в типе MIME, вы можете указать пустое значение, например@c"", и thorvg попытается его выяснить.
     * @since 0,5
     */
    Result load(const char* data, uint32_t size, const std::string& mimeType, bool copy = false) noexcept;

    /**
     * @brief Изменяет размер содержимого изображения до заданной ширины и высоты.
     *
     * Размер содержимого изображения изменяется с сохранением соотношения сторон размера по умолчанию.
     * Коэффициент масштабирования устанавливается для каждого из измерений, и к обоим из них применяется меньшее значение.
     *
     * @param [in] w Новая ширина изображения в пикселях.
     * @param [in] h Новая высота изображения в пикселях.
     *
     */
    Result size(float w, float h) noexcept;

    /**
     * @brief Получает размер изображения.
     *
     * @param [out] w Ширина изображения в пикселях.
     * @param [out] h Высота изображения в пикселях.
     *
     */
    Result size(float* w, float* h) const noexcept;

    /**
     * @brief Загружает необработанные данные в форматеARGB8888из блока памяти заданного размера.
     *
     * ThorVG эффективно кэширует загруженные данные, используя указанный адрес данных@pв качестве ключа.
     * когда копия@pимеет@cfalse. Это означает, что повторная загрузка тех же данных не приводит к дублированию операций.
     * для общих данных@p. Вместо этого ThorVG будет повторно использовать ранее загруженные данные изображения.
     *
     * @param [in] data Указатель на ячейку памяти, где хранится содержимое необработанных данных изображения.
     * @param [in] w Ширина данных @p изображения в пикселях.
     * @param [in] h Высота изображения, данные @p, в пикселях.
     * @param [in] с предварительным умножением. Если@ctrue, данные изображения умножаются в альфа-канале.
     * @param [in] copy Если@ctrue, данные копируются в локальный буферный механизм, в противном случае — нет.
     *
     * @since 0.9
     */
    Result load(uint32_t* data, uint32_t w, uint32_t h, bool copy) noexcept;

    /**
     * @brief Получите объект рисования из сцены Picture по его уникальномуID.
     *
     * Эта функция ищет объект рисования в сцене изображения, соответствующий предоставленному идентификатору @p.
     *
     * @param [in] id Уникальный ID объекта рисования.
     *
     * @return Указатель на объект рисования, соответствующий заданному идентификатору, или@cnullptr, если соответствующий объект рисования не найден.
     *
     * @see Аксессор:: id()
     *
     * @note Экспериментальный API
     */
    const Paint* paint(uint32_t id) noexcept;

    /**
     * @brief Создает новый объект Picture.
     *
     * @return Новый объект изображения.
     */
    static std::unique_ptr<Picture> gen() noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра Picture.
     *
     * @since Экспериментальный API
     */
    Type type() const noexcept override;

    /**
     * @see Изображение:: type()
     */
    TVG_DEPRECATED static uint32_t identifier() noexcept;

    _TVG_DECLARE_ACCESSOR(Animation);
    _TVG_DECLARE_PRIVATE(Picture);
};


/**
 * @class Сцена
 *
 * @brief Занятие по составлению детских красок.
 *
 * В качестве традиционного метода рендеринга графики TVG также включает механизм графа сцены.
 * Эта функция поддерживает функцию массива для управления несколькими отрисовками как одной групповой отрисовкой.
 *
 * Как группу сцену можно трансформировать, сделать полупрозрачной и скомпоновать с другими целевыми красками.
 * на его детей будет влиять мир сцены.
 */
class TVG_API Scene final : public Paint
{
public:
    ~Scene();

    /**
     * @brief Передает элементы рисования в сцену с помощью объектов Paint.
     *
     * Нарисованными целями будут только краски, попавшие в сцену.
     * Краски представлены на сцене до тех пор, пока не будет вызвана Scene::clear().
     *
     * @param [in] Paint Объект Paint, который нужно нарисовать.
     *
     * @note Порядок рендеринга красок такой же, как и порядок их нажатия. Если вы собираетесь использовать слои, рассмотрите возможность сортировки красок перед тем, как их раскладывать.
     * @see Сцена:: paints()
     * @see Сцена:: clear()
     */
    Result push(std::unique_ptr<Paint> paint) noexcept;

    TVG_DEPRECATED Result reserve(uint32_t size) noexcept;

    /**
     * @brief Возвращает список красок, которые в данный момент хранятся в сцене.
     *
     * Эта функция предоставляет список узлов рисования, предоставляя пользователям прямую возможность изменять дерево сцены.
     *
     * @warning Пожалуйста, избегайте доступа к краскам во время обновления/отрисовки сцены. Вы можете получить к ним доступ после вызова Canvas::sync().
     * @see Холст:: sync()
     * @see Scene::push(std::unique_ptr<Paint> краска)
     * @see Сцена:: clear()
     *
     * @note Экспериментальный API
     */
    std::list<Paint*>& paints() noexcept;

    /**
     * @brief Устанавливает общее количество красок, помещенных в сцену, равным нулю.
     * В зависимости от значений аргумента свободные@pлампы отключаются или нет.
     *
     * @param [in] free Если@ctrue, память, занятая красками, освобождается, в противном случае — нет.
     *
     * @warning Если не освободить краски, они будут болтаться. Их предполагается использовать повторно, иначе вы несете ответственность за их жизнь. Поэтому используйте свободный аргумент@pтолько в том случае, если вы знаете, как он работает, в противном случае это не рекомендуется.
     *
     * @since 0.2
     */
    Result clear(bool free = true) noexcept;

    /**
     * @brief Примените к сцене эффект постобработки.
     *
     * Эта функция добавляет указанный эффект сцены, например очистку всех эффектов или применение размытия по Гауссу.
     * на сцену после ее рендеринга. Несколько эффектов могут применяться последовательно.
     *
     * @param [in] effect Применяемый эффект сцены. Параметры применяются в процедурах SceneEffect.
     *                   Например, воспользуйтесь SceneEffect::GaussianBlur, чтобы применить размытие с настройками параметров.
     * @param [in] ... Дополнительные переменные параметры, необходимые для определенных эффектов (например, сигма и направление для GaussianBlur).
     *
     * @note Экспериментальный API
     */
    Result push(SceneEffect effect, ...) noexcept;

    /**
     * @brief Создает новый объект сцены.
     *
     * @return Новый объект сцены.
     */
    static std::unique_ptr<Scene> gen() noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра сцены.
     *
     * @since Экспериментальный API
     */
    Type type() const noexcept override;

    /**
     * @see Сцена:: type()
     */
    TVG_DEPRECATED static uint32_t identifier() noexcept;

    _TVG_DECLARE_PRIVATE(Scene);
};


/**
 * @class Текст
 *
 * @brief Класс для представления текстовых объектов в графическом контексте, позволяющий отображать и манипулировать текстом в Юникоде.
 *
 * @since 0,15
 */
class TVG_API Text final : public Paint
{
public:
    ~Text();

    /**
     * @brief Устанавливает свойства шрифта для текста.
     *
     * Эта функция позволяет вам определить характеристики шрифта, используемые для рендеринга текста.
     * Он устанавливает имя шрифта, его размер и, при необходимости, стиль.
     *
     * @param [in] name Имя шрифта. Это должно соответствовать шрифту, доступному на холсте.
     * @param [in] size Размер шрифта в пунктах. Это определяет, насколько большим будет текст.
     * @param [in] style Стиль шрифта. Его можно использовать для установки шрифта «курсив».
     *                  Если не указано, используется стиль по умолчанию. В настоящее время поддерживается только курсив.
     *
     * @retval Result::InsufficientCondition, когда указанное имя@pне может быть найдено.
     *
     * @note Экспериментальный API
     */
    Result font(const char* name, float size, const char* style = nullptr) noexcept;

    /**
     * @brief Назначает данный текст в Юникоде для отображения.
     *
     * Эта функция устанавливает строку Юникода, которая будет отображаться системой рендеринга.
     * Текст задается в соответствии с указанным методом кодирования UTF, который по умолчанию равен UTF -8.
     *
     * @param [in] Многотекстовый байтовый текст, закодированный строкой utf8 для отображения.
     *
     * @note Экспериментальный API
     */
    Result text(const char* text) noexcept;

    /**
     * @brief Устанавливает цвет текста.
     *
     * @param [in] r Значение канала красного цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] g Значение канала зеленого цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     * @param [in] b Значение канала синего цвета в диапазоне [0 ~ 255]. Значение по умолчанию — 0.
     *
     * @see Текст:: font()
     *
     * @since 0,15
     */
    Result fill(uint8_t r, uint8_t g, uint8_t b) noexcept;

    /**
     * @brief Устанавливает градиентную заливку для всех фигур из текста.
     *
     * Части текста, определенные как внутренние, заполняются.
     *
     * @param [in] f Уникальный указатель на градиентную заливку.
     *
     * @note Применяется либо сплошной цвет, либо градиентная заливка, в зависимости от того, что было установлено последним.
     * @see Текст:: font()
     *
     * @since 0,15
     */
    Result fill(std::unique_ptr<Fill> f) noexcept;

    /**
     * @brief Загружает данные масштабируемого шрифта (ttf) из файла.
     *
     * ThorVG эффективно кэширует загруженные данные, используя указанный путь@pв качестве ключа.
     * Это означает, что повторная загрузка того же файла не приведет к дублированию операций;
     * вместо этого ThorVG будет повторно использовать ранее загруженный шрифт данных.
     *
     * @param [in] путь Путь к файлу шрифта.
     *
     * @retval Result::InvalidArguments В случае, если путь@pнедействителен.
     * @retval Результат::NonSupport При попытке загрузить файл с неизвестным расширением.
     *
     * @see Text::unload(const std::string& path)
     *
     * @since 0,15
     */
    static Result load(const std::string& path) noexcept;

    /**
     * @brief Загружает данные масштабируемого шрифта (ttf) из блока памяти заданного размера.
     *
     * ThorVG эффективно кэширует загруженные данные шрифта, используя указанное имя@pв качестве переключателя.
     * Это означает, что повторная загрузка тех же шрифтов не приведет к дублированию операций.
     * Вместо этого ThorVG будет повторно использовать ранее загруженный шрифт данных.
     *
     * @param [in] name Имя, под которым шрифт будет храниться и доступен (например, в@pfont()API).
     * @param [in] data Указатель на ячейку памяти, где хранится содержимое данных шрифта.
     * @param [in] size Размер в байтах памяти, занимаемой данными @p.
     * @param [in] mimeType Mime-тип или расширение шрифта данных. В случае указания пустые строки загрузчик будут определены автоматически.
     * @param [in] copy Если@ctrue, данные копируются в локальный буферный механизм, в противном случае они не копируются (по умолчанию).
     *
     * @retval Result::InvalidArguments Если имя не указано или размер@pравен нулю, а данные@pуказывают на допустимую ячейку памяти.
     * @retval Результат::NonSupport При попытке загрузить файл с неподдерживаемым расширением.
     * @retval Result::InsufficientCondition При попытке выгрузить данные шрифта, которые не были загружены ранее.
     *
     * @warning Пользователь несет ответственность за освобождение памяти данных @p.
     *
     * @note Чтобы выгрузить данные шрифта, загруженные с помощью этогоAPI, передайте правильное имя@pи нуль-птр@cв качестве данных @p.
     * @note Если вы не уверены в типе MIME, вы можете указать пустое значение, например@c"", и thorvg попытается его выяснить.
     * @see Text::font(имя const char*, размер float, стиль const char*)
     *
     * @note 0,15
     */
    static Result load(const char* name, const char* data, uint32_t size, const std::string& mimeType = "ttf", bool copy = false) noexcept;

    /**
     * @brief Выгружает указанные данные масштабируемого шрифта (TTF), которые были загружены ранее.
     *
     * Эта функция используется для освобождения ресурсов, связанных с файлом шрифта, загруженным в память.
     *
     * @param [in] Путь к файлу установленного шрифта.
     *
     * @retval Result::InsufficientCondition Ошибка, если загрузчик не инициализирован.
     *
     * @note Если данные шрифта в данный момент используются, они не будут немедленно выгружены.
     * @see Текст::load(const std::string& путь)
     *
     * @since 0,15
     */
    static Result unload(const std::string& path) noexcept;

    /**
     * @brief Создает новый текстовый объект.
     *
     * @return Новый текстовый объект.
     *
     * @since 0,15
     */
    static std::unique_ptr<Text> gen() noexcept;

    /**
     * @brief Возвращает значениеIDэтого класса.
     *
     * Этот метод можно использовать для проверки текущего конкретного типа экземпляра.
     *
     * @return Тип классаIDэкземпляра Text.
     *
     * @since Экспериментальный API
     */
    Type type() const noexcept override;

    _TVG_DECLARE_PRIVATE(Text);
};


/**
 * @class SwCanvas
 *
 * @brief Класс для рендеринга графических элементов с помощью программного растрового движка.
 */
class TVG_API SwCanvas final : public Canvas
{
public:
    ~SwCanvas();

    /**
     * @brief Перечисление, определяющее методы объединения 8-битных цветовых каналов в 32-битный цвет.
     */
    enum Colorspace
    {
        ABGR8888 = 0,      ///< Каналы соединяются в порядке: альфа, синий, зеленый, красный. Цвета предварительно умножаются на альфа-канал. (а << 24 | б << 16 | г << 8 | г)
        ARGB8888,          ///< Каналы соединяются в порядке: альфа, красный, зеленый, синий. Цвета предварительно умножаются на альфа-канал. (а << 24 | г << 16 | г << 8 | б)
        ABGR8888S,         ///< Каналы соединяются в порядке: альфа, синий, зеленый, красный. Цвета не умножаются по альфа-каналу.  @since0.12
        ARGB8888S,         ///< Каналы соединяются в порядке: альфа, красный, зеленый, синий. Цвета не умножаются по альфа-каналу.  @since0.12
    };

    /**
     * @brief Перечисление, определяющее методы политики поведения пула памяти.
     * @since 0.4
     */
    enum MempoolPolicy
    {
        Default = 0, ///< Поведение по умолчанию, для которого предназначен ThorVG.
        Shareable,   ///< Пульная память является общей для SwCanvas.
        Individual   ///< Выделить назначенный пул памяти, который будет использоваться только текущим экземпляром.
    };

    /**
     * @brief Устанавливает цель рисования для растеризации.
     *
     * Буфер желаемого размера должен быть выделен и принадлежать вызывающей стороне.
     *
     * Буфер@param[in] Указатель блока памяти размером@pшаг x@ph, где хранятся растровые данные.
     * @param [in] шаг Шаг растрового изображения – больше или равен@pw.
     * @param [in] w Ширина растрового изображения.
     * @param [in] h Высота растрового изображения.
     * @param [in] cs Значение, определяющее способ чтения/записи 32-битных цветов.
     *
     * @retval Result::InvalidArguments В случае, если не указан допустимый указатель или ширина, высота или шаг равны нулю.
     * @retval Result::InsufficientCondition, если холст выполняет рендеринг. Убедитесь, что холст синхронизирован.
     * @retval Результат::NonSupport В случае, если программный движок не поддерживается.
     *
     * @warning Не обращайтесь к буферу@pво время Canvas::push()- Canvas::sync(). К нему не следует обращаться, пока движок пишет на нем.
     *
     * @see Холст:: viewport()
     * @see Холст:: sync()
    */
    Result target(uint32_t* buffer, uint32_t stride, uint32_t w, uint32_t h, Colorspace cs) noexcept;

    /**
     * @brief Установите политику поведения пула памяти механизма SW.
     *
     * По сути, ThorVG рисует множество фигур, популярных/освобождает часть памяти.
     * во время обработки рендеринга. Он внутренне использует один общий пул памяти.
     * который можно повторно использовать среди холстов, чтобы избежать накладных расходов на память.
     *
     * Таким образом, ThorVG предлагает использовать политику пула памяти для удовлетворения требований пользователей.
     * если ему необходимо гарантировать потокобезопасность доступа к внутренним данным.
     *
     * @param [in] policy Метод, определяющий поведение пула памяти. Значение по умолчанию —@cMempoolPolicy::Default.
     *
     * @retval Result::InsufficientCondition Если холст уже содержит краски.
     * @retval Результат::NonSupport В случае, если программный движок не поддерживается.
     *
     * @note Если для политики@cустановлено значение@cMempoolPolicy::Individual, текущий экземпляр холста использует свой собственный
     *       данные памяти, которые не используются совместно с другими. Это необходимо, когда доступ к холсту осуществляется через рабочий поток.
     *
     * @warning Не допускается после нажатия каких-либо красок.
     *
     * @since 0.4
    */
    Result mempool(MempoolPolicy policy) noexcept;

    /**
     * @brief Создает новый объект SwCanvas.
     * @return Новый объект SwCanvas.
     */
    static std::unique_ptr<SwCanvas> gen() noexcept;

    _TVG_DECLARE_PRIVATE(SwCanvas);
};


/**
 * @class GlCanvas
 *
 * @brief Класс для рендеринга графических элементов с помощью растрового движка GL.
 *
 * @since 0.14
 */
class TVG_API GlCanvas final : public Canvas
{
public:
    ~GlCanvas();

    /**
     * @brief Устанавливает цель рисования для растеризации.
     *
     * Эта функция определяет цель рисования, в которой будет происходить растеризация. Он может быть нацелен
     * конкретный объект кадрового буфера ( FBO ) или основную поверхность.
     *
     * @param [in] id Цель GL ID , обычно указывающая FBO ID . Значение @c 0 определяет основную поверхность.
     * @param [in] w Ширина (в пикселях) растрового изображения.
     * @param [in] h Высота (в пикселях) растрового изображения.
     *
     * @retval Result::InsufficientCondition, если холст выполняет рендеринг. Убедитесь, что холст синхронизирован.
     * @retval Result::NonSupport В случае, если движок gl не поддерживается.
     *
     * @see Холст:: viewport()
     * @see Холст:: sync()
     *
     * @note В настоящее время поддерживается только формат цветового пространства GL_RGBA8.
     * @note Экспериментальный API
    */
    Result target(int32_t id, uint32_t w, uint32_t h) noexcept;

    /**
     * @brief Создает новый объект GlCanvas.
     *
     * @return Новый объект GlCanvas.
     *
     * @since 0.14
     */
    static std::unique_ptr<GlCanvas> gen() noexcept;

    _TVG_DECLARE_PRIVATE(GlCanvas);
};


/**
 * @class WgCanvas
 *
 * @brief Класс для рендеринга графических элементов с помощью растрового движка WebGPU.
 *
 * @warning Пожалуйста, не используйте его. Этот класс еще не полностью поддерживается.
 *
 * @since 0,15
 */
class TVG_API WgCanvas final : public Canvas
{
public:
    ~WgCanvas();

    /**
     * @brief Устанавливает цель рисования для растеризации.
     *
     * @param [in] экземпляр WGPUInstance, контекст для всех остальных объектов wgpu.
     * @param [in] поверхность WGPUSurface, дескриптор презентабельной поверхности.
     * @param [дюймы] w Ширина поверхности.
     * @param [дюймы] ч Высота поверхности.
     * @param [in] устройство WGPDevice, желаемый дескриптор устройства wgpu. Если это@cnullptr, ThorVG внутренне назначит наличие устройства.
     *
     * @retval Result::InsufficientCondition, если холст выполняет рендеринг. Убедитесь, что холст синхронизирован.
     * @retval Result::NonSupport В случае, если движок wg не поддерживается.
     *
     * @note Экспериментальный API
     *
     * @see Холст:: viewport()
     * @see Холст:: sync()
     */
    Result target(void* instance, void* surface, uint32_t w, uint32_t h, void* device = nullptr) noexcept;

    /**
     * @brief Создает новый объект WgCanvas.
     *
     * @return Новый объект WgCanvas.
     *
     * @since 0,15
     */
    static std::unique_ptr<WgCanvas> gen() noexcept;

    _TVG_DECLARE_PRIVATE(WgCanvas);
};


/**
 * @class Инициализатор
 *
 * @brief Класс, который позволяет инициализировать и завершать работу механизмов TVG.
 */
class TVG_API Initializer final
{
public:
    /**
     * @brief Инициализирует двигатели TVG.
     *
     * TVG требует среды работающего двигателя.
     * TVG использует собственный планировщик задач для эффективного распараллеливания задач рендеринга.
     * Вы можете указать количество потоков, количество которых обозначается потоками @p.
     * На этапе инициализации TVG будет генерировать/создавать потоки в соответствии с количеством потоков @p.
     *
     * @param [in] engine Типы соглашений, беспричинные обоснования. Это относится к типам Canvas, в которых он будет использоваться. Для нескольких серверов разрешены побитовые операции.
     * @param [in] threads Количество дополнительных потоков. Ноль указывает, что будет использоваться только основной поток.
     *
     * @retval Result::NonSupport В случае, если тип ядра не поддерживается системой.
     *
     * @note Инициализатор отслеживает количество вызовов. Количество потоков фиксируется при первом вызове init().
     * @see Инициализатор:: term()
     */
    static Result init(CanvasEngine engine, uint32_t threads) noexcept;

    /**
     * @brief Завершает работу двигателей TVG.
     *
     * @param [in] engine Типы критериев, которые необходимо разработать. Это относится к типам Canvas, в которых он будет использоваться. Для нескольких серверов разрешены побитовые операции.
     *
     * @retval Result::InsufficientCondition Если нечего завершать.
     * @retval Result::NonSupport В случае, если тип ядра не поддерживается системой.
     *
     * @note Инициализатор самостоятельно подсчитывает ссылки для нескольких вызовов.
     * @see Инициализатор:: init()
     */
    static Result term(CanvasEngine engine) noexcept;

    /**
     * @brief Получает версию движка TVG.
     *
     * @param [out] major Основной номер версии.
     * @param [out] второстепенный номер версии.
     * @param [out] micro Номер микро-версии.
     *
     * @return Версия движка в формате major.minor.micro или nullptr@pв случае внутренней ошибки.
     *
     * @since 0,15
     */
    static const char* version(uint32_t* major, uint32_t* minor, uint32_t* micro) noexcept;

    _TVG_DISABLE_CTOR(Initializer);
};


/**
 * @class Анимация
 *
 * @brief Класс Animation позволяет манипулировать анимационными изображениями.
 *
 * Этот класс поддерживает отображение и управление кадрами анимации.
 *
 * @since 0.13
 */

class TVG_API Animation
{
public:
    ~Animation();

    /**
     * @brief Указывает текущий кадр анимации.
     *
     * @param [in] нет Индекс кадровой анимации, который будет находиться в базе данных Bluetooth. Индекс должен быть меньшеtotalFrame().
     *
     * @retval Result::InsufficientCondition, если заданный номер@pсовпадает со значением текущего кадра.
     * @retval Result::NonSupport Текущие данные изображения не поддерживают анимацию.
     *
     * @note В целях эффективности ThorVG игнорирует обновления нового значения кадра, если оно отличается от текущего значения кадра.
     *       меньше 0,001. В таких случаях он получает@cResult::InsufficientCondition.
     *       Значения меньше 0,001 могут быть проигнорированы и не могут быть точно сохранены анимацией.
     *
     * @see totalFrame()
     *
     */
    Result frame(float no) noexcept;

    /**
     * @brief Получает экземпляр изображения, связанный с этим экземпляром анимации.
     *
     * Эта функция обеспечивает доступ к экземпляру изображения, которое можно использовать для загрузки форматов анимации, таких как Lottie(json).
     * После настройки изображения его можно переместить на назначенный холст, что позволит управлять кадрами анимации.
     * с этим экземпляром анимации.
     *
     * @return Экземпляр изображения, привязанный к этой анимации.
     *
     * @warning Экземпляр изображения принадлежит компании Animation. Его не следует удалять вручную.
     *
     */
    Picture* picture() const noexcept;

    /**
     * @brief Получает текущий номер кадра анимации.
     *
     * @return Текущий номер кадра анимации от 0 доtotalFrame()– 1.
     *
     * @note Если изображение настроено неправильно, эта функция вернет 0.
     *
     * @see Анимация::frame(номер с плавающей запятой)
     * @see Анимация:: totalFrame()
     *
     */
    float curFrame() const noexcept;

    /**
     * @brief Получает общее количество кадров в анимации.
     *
     * @return Общее количество кадров в анимации.
     *
     * @note Нумерация кадров начинается с 0.
     * @note Если изображение настроено неправильно, эта функция вернет 0.
     *
     */
    float totalFrame() const noexcept;

    /**
     * @brief Получает продолжительность анимации в секундах.
     *
     * @return Продолжительность анимации в секундах.
     *
     * @note Если изображение настроено неправильно, эта функция вернет 0.
     *
     */
    float duration() const noexcept;

    /**
     * @brief Указывает сегмент воспроизведения анимации.
     *
     * Установленный сегмент обозначается как игровая область анимации.
     * Это полезно для воспроизведения определенного сегмента всей анимации.
     * После настройки рассчитывается количество кадров анимации и время воспроизведения.
     * путем сопоставления сегмента воспроизведения как всего диапазона.
     *
     * @param [in] начало сегмента.
     * @param [in] конец сегмента конец.
     *
     * @retval Result::InsufficientCondition Если анимация не загружена.
     * @retval Result::NonSupport Когда его нельзя анимировать.
     *
     * @note Анимация допускает диапазон от 0,0 до 1,0.  Конец@pне должен быть выше начала @p.
     * @note Если был указан маркер, его диапазон будет игнорироваться.
     * @see LottieAnimation::segment(const char* маркер)
     *
     * @note Экспериментальный API
     */
    Result segment(float begin, float end) noexcept;

    /**
     * @brief Получает текущий сегмент.
     *
     * @param [out] начало сегмента.
     * @param [out] конец сегмента конец.
     *
     * @retval Result::InsufficientCondition Если анимация не загружена.
     * @retval Result::NonSupport Когда его нельзя анимировать.
     *
     * @note Экспериментальный API
     */
    Result segment(float* begin, float* end = nullptr) noexcept;

    /**
     * @brief Создает новый объект Animation.
     *
     * @return Новый объект анимации.
     *
     */
    static std::unique_ptr<Animation> gen() noexcept;

    _TVG_DECLARE_PRIVATE(Animation);
};


/**
 * @class Заставка
 *
 * @brief Класс для экспорта объекта рисования в указанный файл, из которого можно позже восстановить данные рисования.
 *
 * ThorVG обеспечивает функцию экспорта и импорта данных о красках. Роль Saver заключается в экспорте данных рисования в файле.
 * Это полезно, когда вам нужно сохранить созданную сцену или изображение из объекта рисования и воссоздать его позже.
 *
 * Формат файла Определенное имя расширения (например, «*.tvg»), применимые формы, соответствующие стандарту упаковкиTVG.
 * Если формат файла не соответствует, методsave()возвращает результат@cResult::NonSupport.
 *
 * После получения экспорта краски в файл вы можете отправить ее в регион с помощью изображения класса.
 *
 * @see Изображение:: load()
 *
 * @since 0,5
 */
class TVG_API Saver final
{
public:
    ~Saver();

    /**
     * @brief Устанавливает базовое фоновое содержимое для сохраненного изображения.
     *
     * @param [in] краска Краска, которая будет использоваться в качестве фонового изображения для сохранения красок.
     *
     * @note Экспериментальный API
     */
    Result background(std::unique_ptr<Paint> paint) noexcept;

    /**
     * @brief Экспортирует данные краски@pв заданный путь @p.
     *
     * Если модуль сохранения поддерживает какой-либо механизм сжатия, он оптимизирует размер данных.
     * В некоторых случаях это может повлиять на время кодирования/декодирования. Вы можете отключить сжатие
     * если вы хотите оптимизировать скорость.
     *
     * @param [in] краска Краска, которую необходимо сохранить, со всеми переменами с ней следствием.
     * @param [in] путь Путь к файлу, в котором должны быть сохранены данные рисования.
     * @param [in] compress Если@ctrue, сжимайте данные, если это возможно.
     *
     * @retval Result::InsufficientCondition Если в данный момент сохраняются другие ресурсы.
     * @retval Результат::NonSupport При попытке сохранить файл с неизвестным расширением или в неподдерживаемом формате.
     * @retval Результат::Неизвестно В случае, если необходимо сохранить пустую краску.
     *
     * @note Сохранение может быть асинхронным, если назначенный номер потока больше нуля. Чтобы гарантировать, что сохранение выполнено, после этого вызовите sync().
     * @see Заставка:: sync()
     *
     * @since 0,5
     */
    Result save(std::unique_ptr<Paint> paint, const std::string& path, bool compress = true) noexcept;

    /**
     * @brief Экспортируйте предоставленные данные анимации в указанный путь к файлу.
     *
     * Эта функция экспортирует данные анимации по указанному пути к файлу. Вы также можете указать желаемую скорость кадров в секундах (FPS), указав параметр fps.
     *
     * @param [in] анимация Сохраняемая анимация, включая все связанные свойства.
     * @param [in] путь Путь к файлу, в котором будет сохранена анимация.
     * @param [in] качество Уровень качества кодирования.  @c0 — минимальное значение,@c100 — максимальное значение (рекомендуется).
     * @param [in] fps Желаемое количество кадров в секунду ( FPS ). Например, чтобы закодировать данные по адресу 60 FPS, передайте 60. Передайте 0, чтобы сохранить исходные данные кадра.
     *
     * @retval Result::InsufficientCondition, если выполняются текущие операции по экономии ресурсов.
     * @retval Result::NonSupport, если предпринята попытка сохранить файл с неизвестным расширением или в неподдерживаемом формате.
     * @retval Результат::Неизвестно при попытке сохранить пустую краску.
     *
     * @note Более высокое количество кадров в секунду (FPS) приведет к увеличению размера файла. Рекомендуется использовать значение по умолчанию.
     * @note Сохранение может быть асинхронным, если назначенный номер потока больше нуля. Чтобы гарантировать, что сохранение выполнено, после этого вызовите sync().
     *
     * @see Заставка:: sync()
     *
     * @note Экспериментальный API
     */
    Result save(std::unique_ptr<Animation> animation, const std::string& path, uint32_t quality = 100, uint32_t fps = 0) noexcept;

    /**
     * @brief Гарантирует, что задача сохранения завершена.
     *
     * Поведение Saver работает на основе синхронизации/асинхронности, в зависимости от настроек исходника потоков.
     * Таким образом, если вы хотите получить эту выгоду, вам нужно вызватьsync()послеsave()в нужное время задержки.
     * В противном случае вы можете немедленно позвонить sync().
     *
     * @note Асинхронное выполнение задач зависит от реализации модуля Saver.
     * @see Заставка:: save()
     *
     * @since 0,5
     */
    Result sync() noexcept;

    /**
     * @brief Создает новый объект Saver.
     *
     * @return Новый объект Saver.
     *
     * @since 0,5
     */
    static std::unique_ptr<Saver> gen() noexcept;

    _TVG_DECLARE_PRIVATE(Saver);
};


/**
 * @class Аксессуар
 *
 * @brief Accessor — это служебный класс для отладки структуры сцены путем обхода дерева сцены.
 *
 * Аксессор помогает вам искать определенные узлы, читать информацию о свойствах, определять структуру дерева сцены и его размер.
 *
 * @warning Мы настоятельно предупреждаем вас не менять краски сцены, если вы действительно не знаете структуру дизайна.
 *
 * @since 0.10
 */
class TVG_API Accessor final
{
public:
    ~Accessor();

    TVG_DEPRECATED std::unique_ptr<Picture> set(std::unique_ptr<Picture> picture, std::function<bool(const Paint* paint)> func) noexcept;

    /**
     * @brief Установите функцию доступа для обхода узлов дерева сцены Picture.
     *
     * @param [in] image Узел изображения для обхода внутреннего дерева сцены.
     * @param [in] func Функция обратного вызова, вызывающая все узлы рисования изображения.
     * @param [in] data Данные, передаваемые в функцию @p в качестве аргумента.
     *
     * @note Растровое изображение может не иметь дерева сцены.
     *
     * @note Экспериментальный API
     */
    Result set(const Picture* picture, std::function<bool(const Paint* paint, void* data)> func, void* data) noexcept;

    /**
     * @brief Создайте уникальныйID(хеш-ключ) по заданному имени.
     *
     * Эта функция вычисляет уникальное значение идентификатора на основе предоставленной строки.
     * Вы можете использовать это, чтобы назначить уникальный объектIDPaint.
     *
     * @param [in] name Входная строка, на основе которой создается уникальный идентификатор.
     *
     * @return Сгенерированное значение уникального идентификатора.
     *
     * @see Краска::id
     *
     * @note Экспериментальный API
     */
    static uint32_t id(const char* name) noexcept;

    /**
     * @brief Создает новый объект Accessor.
     *
     * @return Новый объект Accessor.
     */
    static std::unique_ptr<Accessor> gen() noexcept;

    _TVG_DECLARE_PRIVATE(Accessor);
};


/**
 * @brief Функцияcast()— это служебная функция, используемая для приведения «Paint» к типу «T».
 * @since 0.11
 */
template<typename T = tvg::Paint>
std::unique_ptr<T> cast(Paint* paint)
{
    return std::unique_ptr<T>(static_cast<T*>(paint));
}


/**
 * @brief Функцияcast()— это служебная функция, используемая для приведения «Заливки» к типу «Т».
 * @since 0.11
 */
template<typename T = tvg::Fill>
std::unique_ptr<T> cast(Fill* fill)
{
    return std::unique_ptr<T>(static_cast<T*>(fill));
}


/** @}*/

} //пространство имен

#endif //_THORVG_H_

#endif /* LV_USE_THORVG_INTERNAL */

